distributable-web=distributable-web \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0
distributable-web.add=distributable-web \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
distributable-web.remove=distributable-web \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u524A\u9664\u3057\u307E\u3059\u3002
distributable-web.default-session-management=\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u5206\u6563\u53EF\u80FD\u30BB\u30C3\u30B7\u30E7\u30F3\u7BA1\u7406\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC
distributable-web.default-single-sign-on-management=\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u5206\u6563\u53EF\u80FD\u30B7\u30F3\u30B0\u30EB\u30B5\u30A4\u30F3\u30AA\u30F3\u7BA1\u7406\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC

distributable-web.session-management.add=\u5206\u6563\u53EF\u80FD\u30BB\u30C3\u30B7\u30E7\u30F3\u7BA1\u7406\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
distributable-web.session-management.remove=\u5206\u6563\u53EF\u80FD\u30BB\u30C3\u30B7\u30E7\u30F3\u7BA1\u7406\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
distributable-web.session-management.granularity=\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u5C5E\u6027\u3092\u6C38\u7D9A\u5316\u3059\u308B\u30B9\u30C8\u30E9\u30C6\u30B8\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002

distributable-web.infinispan-session-management=Infinispan \u30D9\u30FC\u30B9\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u7BA1\u7406\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC
distributable-web.infinispan-session-management.cache-container=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u95A2\u9023\u3059\u308B\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u540D\u524D\u3002
distributable-web.infinispan-session-management.cache=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u95A2\u9023\u3059\u308B\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u540D\u524D\u3002

distributable-web.affinity=\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u8A2D\u5B9A
distributable-web.affinity.add=\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
distributable-web.affinity.remove=\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002

distributable-web.affinity.none=Web \u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u306F\u30AF\u30E9\u30B9\u30BF\u30FC\u30E1\u30F3\u30D0\u30FC\u306E\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u306F\u3042\u308A\u307E\u305B\u3093\u3002
distributable-web.affinity.local=Web \u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u306F\u3001\u6307\u5B9A\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u3092\u6700\u5F8C\u306B\u51E6\u7406\u3057\u305F\u30E1\u30F3\u30D0\u30FC\u306E\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u304C\u3042\u308A\u307E\u3059\u3002
distributable-web.affinity.primary-owner=Web \u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u306F\u3001\u6307\u5B9A\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u30D7\u30E9\u30A4\u30DE\u30EA\u30FC\u6240\u6709\u8005\u306E\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u304C\u3042\u308A\u307E\u3059\u3002
distributable-web.affinity.ranked=Web \u30EA\u30AF\u30A8\u30B9\u304A\u306B\u306F\u3001\u30D7\u30E9\u30A4\u30DE\u30EA\u30FC\u304A\u3088\u3073\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u6240\u6709\u8005\u3068\u3001\u6307\u5B9A\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u3092\u6700\u5F8C\u306B\u51E6\u7406\u3057\u305F\u30E1\u30F3\u30D0\u30FC\u304C\u542B\u307E\u308C\u308B\u30EA\u30B9\u30C8\u306E\u3001\u6700\u521D\u306B\u5229\u7528\u3067\u304D\u308B\u30E1\u30F3\u30D0\u30FC\u306E\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u304C\u3042\u308A\u307E\u3059\u3002
distributable-web.affinity.ranked.delimiter=\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u30BB\u30C3\u30B7\u30E7\u30F3\u8B58\u5225\u5B50\u5185\u306E\u500B\u5225\u30EB\u30FC\u30C8\u3092\u533A\u5207\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u533A\u5207\u308A\u6587\u5B57\u3002
distributable-web.affinity.ranked.max-routes=\u30BB\u30C3\u30B7\u30E7\u30F3\u8B58\u5225\u5B50\u306B\u30A8\u30F3\u30B3\u30FC\u30C9\u3059\u308B\u30EB\u30FC\u30C8\u306E\u6700\u5927\u6570\u3002

distributable-web.hotrod-session-management=HotRod \u30D9\u30FC\u30B9\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u7BA1\u7406\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC
distributable-web.hotrod-session-management.remote-cache-container=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u95A2\u9023\u3059\u308B\u30EA\u30E2\u30FC\u30C8\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u540D\u524D\u3002
distributable-web.hotrod-session-management.cache-configuration=\u30EA\u30E2\u30FC\u30C8\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u8A2D\u5B9A\u306E\u540D\u524D\u3002

distributable-web.single-sign-on-management.add=\u5206\u6563\u53EF\u80FD\u306A\u30B7\u30F3\u30B0\u30EB\u30B5\u30A4\u30F3\u30AA\u30F3\u7BA1\u7406\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
distributable-web.single-sign-on-management.remove=\u5206\u6563\u53EF\u80FD\u306A\u30B7\u30F3\u30B0\u30EB\u30B5\u30A4\u30F3\u30AA\u30F3\u7BA1\u7406\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002

distributable-web.infinispan-single-sign-on-management=Infinispan \u30D9\u30FC\u30B9\u306E\u30B7\u30F3\u30B0\u30EB\u30B5\u30A4\u30F3\u30AA\u30F3\u7BA1\u7406\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC
distributable-web.infinispan-single-sign-on-management.cache-container=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u95A2\u9023\u3059\u308B\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u540D\u524D\u3002
distributable-web.infinispan-single-sign-on-management.cache=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u95A2\u9023\u3059\u308B\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u540D\u524D\u3002

distributable-web.hotrod-single-sign-on-management=HotRod \u30D9\u30FC\u30B9\u306E\u30B7\u30F3\u30B0\u30EB\u30B5\u30A4\u30F3\u30AA\u30F3\u7BA1\u7406\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC
distributable-web.hotrod-single-sign-on-management.remote-cache-container=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u95A2\u9023\u3059\u308B\u30EA\u30E2\u30FC\u30C8\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u540D\u524D\u3002
distributable-web.hotrod-single-sign-on-management.cache-configuration=\u30EA\u30E2\u30FC\u30C8\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u8A2D\u5B9A\u306E\u540D\u524D\u3002

distributable-web.routing=\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC
distributable-web.routing.add=\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
distributable-web.routing.remove=\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002

distributable-web.routing.local=\u30ED\u30FC\u30AB\u30EB\u30EB\u30FC\u30C8\u306E\u751F\u6210\u306B\u4F7F\u7528\u3055\u308C\u308B\u30ED\u30FC\u30AB\u30EB\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3002

distributable-web.routing.infinispan=\u30ED\u30FC\u30AB\u30EB\u3067\u306A\u3044\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u3092\u751F\u6210\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B Infinispan \u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3002
distributable-web.routing.infinispan.cache-container=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u95A2\u9023\u3059\u308B\u30AD\u30E3\u30C3\u30B7\u30E5\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u540D\u524D\u3002
distributable-web.routing.infinispan.cache=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u95A2\u9023\u3059\u308B\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u540D\u524D\u3002

distributable-web.affinity=\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u8A2D\u5B9A
distributable-web.affinity.add=\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
distributable-web.affinity.remove=\u30A2\u30D5\u30A3\u30CB\u30C6\u30A3\u30FC\u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002

