distributable-web=El subsistema web distribuible
distributable-web.add=Agrega el subsistema web distribuible
distributable-web.remove=Elimina el subsistema web distribuible
distributable-web.default-session-management=El proveedor de administraci\u00F3n de sesiones distribuible predeterminado del servidor
distributable-web.default-single-sign-on-management=El proveedor de administraci\u00F3n de inicio de sesi\u00F3n \u00FAnico distribuible predeterminado del servidor

distributable-web.session-management.add=Agrega un proveedor de administraci\u00F3n de sesiones distribuible
distributable-web.session-management.remove=Elimina un proveedor de administraci\u00F3n de sesiones distribuible
distributable-web.session-management.granularity=Define la estrategia para la persistencia de los atributos de una sesi\u00F3n

distributable-web.infinispan-session-management=Proveedor de administraci\u00F3n de sesiones basado en Infinispan
distributable-web.infinispan-session-management.cache-container=El nombre del contenedor de cach\u00E9 asociado con este proveedor
distributable-web.infinispan-session-management.cache=El nombre de la cach\u00E9 asociada con este proveedor

distributable-web.affinity=Una configuraci\u00F3n de afinidad
distributable-web.affinity.add=Agrega una configuraci\u00F3n de afinidad
distributable-web.affinity.remove=Elimina una configuraci\u00F3n de afinidad

distributable-web.affinity.none=Las solicitudes web no tendr\u00E1n afinidad con ning\u00FAn miembro del cl\u00FAster
distributable-web.affinity.local=Las solicitudes web tendr\u00E1n una afinidad con el miembro que manej\u00F3 por \u00FAltima vez una sesi\u00F3n determinada
distributable-web.affinity.primary-owner=Las solicitudes web tendr\u00E1n una afinidad con el propietario principal de una sesi\u00F3n determinada
distributable-web.affinity.ranked=Las solicitudes web tendr\u00E1n afinidad con el primer miembro disponible en una lista que contenga propietarios primarios y de respaldo, y con el \u00FAltimo miembro que manej\u00F3 una sesi\u00F3n determinada
distributable-web.affinity.ranked.delimiter=El delimitador utilizado para separar las rutas individuales dentro del identificador de sesi\u00F3n codificado
distributable-web.affinity.ranked.max-routes=El n\u00FAmero m\u00E1ximo de rutas por codificar en el identificador de sesi\u00F3n

distributable-web.hotrod-session-management=Proveedor de administraci\u00F3n de sesiones basado en HotRod
distributable-web.hotrod-session-management.remote-cache-container=El nombre del contenedor de cach\u00E9 remoto asociado con este proveedor
distributable-web.hotrod-session-management.cache-configuration=El nombre de la configuraci\u00F3n de cach\u00E9 en el contenedor de cach\u00E9 remoto.

distributable-web.single-sign-on-management.add=Agrega un proveedor de administraci\u00F3n de inicio de sesi\u00F3n \u00FAnico distribuible
distributable-web.single-sign-on-management.remove=Elimina un proveedor de administraci\u00F3n de inicio de sesi\u00F3n \u00FAnico distribuible

distributable-web.infinispan-single-sign-on-management=Proveedor de administraci\u00F3n de inicio de sesi\u00F3n \u00FAnico basado en Infinispan
distributable-web.infinispan-single-sign-on-management.cache-container=El nombre del contenedor de cach\u00E9 asociado con este proveedor
distributable-web.infinispan-single-sign-on-management.cache=El nombre de la cach\u00E9 asociada con este proveedor

distributable-web.hotrod-single-sign-on-management=Proveedor de administraci\u00F3n de inicio de sesi\u00F3n \u00FAnico basado en HotRod
distributable-web.hotrod-single-sign-on-management.remote-cache-container=El nombre del contenedor de cach\u00E9 remoto asociado con este proveedor
distributable-web.hotrod-single-sign-on-management.cache-configuration=El nombre de la configuraci\u00F3n de cach\u00E9 en el contenedor de cach\u00E9 remoto.

distributable-web.routing=Un proveedor de enrutamiento
distributable-web.routing.add=Agrega un proveedor de enrutamiento
distributable-web.routing.remove=Elimina un proveedor de enrutamiento

distributable-web.routing.local=El proveedor de enrutamiento local, utilizado para generar rutas locales.

distributable-web.routing.infinispan=El proveedor de enrutamiento Infinispan, utilizado para generar afinidades no locales.
distributable-web.routing.infinispan.cache-container=El nombre del contenedor de cach\u00E9 asociado con este proveedor
distributable-web.routing.infinispan.cache=El nombre de la cach\u00E9 asociada con este proveedor

distributable-web.affinity=Una configuraci\u00F3n de afinidad
distributable-web.affinity.add=Agrega una configuraci\u00F3n de afinidad
distributable-web.affinity.remove=Elimina una configuraci\u00F3n de afinidad

