acceptor.add.params=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u306E factory-class \u304C\u7406\u89E3\u3057\u3001\u8A2D\u5B9A\u306B\u5229\u7528\u3059\u308B key-value \u30DA\u30A2\u30BB\u30C3\u30C8
acceptor.add=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u8FFD\u52A0\u64CD\u4F5C
acceptor.factory-class=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u3092\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3067\u304D\u308B\u30D5\u30A1\u30AF\u30C8\u30EA\u30AF\u30E9\u30B9\u306E\u30AF\u30E9\u30B9\u540D\u3002
acceptor.http-listener=HTTP \u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u8981\u6C42\u3092\u51E6\u7406\u3059\u308B Undertow \u306E http-listener\u3002
acceptor.params=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u306E factory-class \u304C\u7406\u89E3\u3057\u3001\u8A2D\u5B9A\u306B\u5229\u7528\u3059\u308B key-value \u30DA\u30A2
acceptor.remote=\u30EA\u30E2\u30FC\u30C8\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC
acceptor.remove=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u8FFD\u52A0\u64CD\u4F5C
acceptor.server-id=\u30B5\u30FC\u30D0\u30FC ID
acceptor.socket-binding=\u63A5\u7D9A\u3092\u8A31\u53EF\u3059\u308B\u305F\u3081\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u304C\u4F7F\u7528\u3059\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3002
acceptor.start=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u306E\u958B\u59CB
acceptor.started=\u3053\u306E\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u3092\u958B\u59CB\u3059\u308B\u304B\u3069\u3046\u304B
acceptor.stop=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u3092\u505C\u6B62\u3057\u307E\u3059\u3002
acceptor=ActiveMQ \u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3059\u308B\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u3002
acceptor.upgrade-legacy=\u30EC\u30AC\u30B7\u30FC (HornetQ) \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304B\u3089 HTTP \u8981\u6C42\u3092\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3059\u308B\u3053\u3068\u3082\u8A31\u53EF\u3057\u307E\u3059\u3002 
address-setting.add=address-setting \u306E\u8FFD\u52A0\u64CD\u4F5C
address-setting.address-full-policy=max-size-bytes \u3092\u6307\u5B9A\u3057\u305F\u30A2\u30C9\u30EC\u30B9\u304C\u3044\u3063\u3071\u3044\u306B\u306A\u3063\u305F\u5834\u5408\u306B\u3069\u3046\u3059\u308B\u304B\u6C7A\u5B9A (PAGE\u3001DROP\u3001BLOCK)
address-setting.auto-create-jms-queues=JMS \u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u307E\u305F\u306F\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u3053\u306E\u3088\u3046\u306A\u30AD\u30E5\u30FC\u3092\u4F7F\u7528\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u304D\u306B\u4E00\u81F4\u3059\u308B address-settings \u306B\u5BFE\u5FDC\u3059\u308B JMS \u30AD\u30E5\u30FC\u3092 ActiveMQ \u306B\u3088\u3063\u3066\u81EA\u52D5\u7684\u306B\u4F5C\u6210\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
address-setting.auto-create-jms-queues.deprecated=\u3053\u306E\u5C5E\u6027\u306F ActiveMQ \u306E\u30B5\u30DD\u30FC\u30C8\u5BFE\u8C61\u5916\u3068\u306A\u308A\u307E\u3057\u305F\u3002
address-setting.auto-delete-jms-queues=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3084\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u306A\u3044\u5834\u5408\u306B\u3001ActiveMQ \u304C\u81EA\u52D5\u4F5C\u6210\u3055\u308C\u305F JMS \u30AD\u30E5\u30FC\u3092\u81EA\u52D5\u7684\u306B\u524A\u9664\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
address-setting.auto-delete-jms-queues.deprecated=\u3053\u306E\u5C5E\u6027\u306F ActiveMQ \u306E\u30B5\u30DD\u30FC\u30C8\u5BFE\u8C61\u5916\u3068\u306A\u308A\u307E\u3057\u305F\u3002
address-setting.auto-create-addresses=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u307E\u305F\u306F\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u3053\u306E\u3088\u3046\u306A\u30AD\u30E5\u30FC\u306E\u4F7F\u7528\u3092\u8A66\u307F\u308B\u3068\u304D\u306B\u4E00\u81F4\u3059\u308B address-settings \u306B\u5BFE\u5FDC\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u3092 ActiveMQ \u304C\u81EA\u52D5\u7684\u306B\u4F5C\u6210\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
address-setting.auto-delete-addresses=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3084\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u306A\u3044\u5834\u5408\u306B\u3001\u81EA\u52D5\u4F5C\u6210\u3055\u308C\u305F\u30A2\u30C9\u30EC\u30B9\u3092\u81EA\u52D5\u7684\u306B\u524A\u9664\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
address-setting.auto-create-queues=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u307E\u305F\u306F\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u3053\u306E\u3088\u3046\u306A\u30AD\u30E5\u30FC\u306E\u4F7F\u7528\u3092\u8A66\u307F\u308B\u3068\u304D\u306B\u4E00\u81F4\u3059\u308B address-settings \u306B\u5BFE\u5FDC\u3059\u308B\u30AD\u30E5\u30FC\u3092 ActiveMQ \u304C\u81EA\u52D5\u7684\u306B\u4F5C\u6210\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
address-setting.auto-delete-queues=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3084\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u306A\u3044\u5834\u5408\u306B\u3001\u81EA\u52D5\u4F5C\u6210\u3055\u308C\u305F\u30AD\u30E5\u30FC\u3092\u81EA\u52D5\u7684\u306B\u524A\u9664\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
address-setting.dead-letter-address=\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9
address-setting.expiry-address=\u6709\u52B9\u671F\u9650\u306E\u5207\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
address-setting.expiry-delay=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u6709\u52B9\u671F\u9650\u3092\u4F7F\u7528\u3057\u3066\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u4F7F\u7528\u3059\u308B\u6709\u52B9\u671F\u9650\u3092\u5B9A\u7FA9\u3057\u307E\u3059
address-setting.last-value-queue=\u30AD\u30E5\u30FC\u304C\u6700\u5F8C\u306E\u5024\u3092\u5229\u7528\u3059\u308B\u304B\u5426\u304B\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
address-setting.max-delivery-attempts=dead-letter-address \u306B\u9001\u4FE1\u3059\u308B\u524D\u306B\u3001\u30AD\u30E3\u30F3\u30BB\u30EB\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u518D\u9001\u3059\u308B\u56DE\u6570\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
address-setting.max-redelivery-delay=redelivery-delay \u306E\u6700\u5927\u5024 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002
address-setting.max-size-bytes=\u6700\u5927\u30D0\u30A4\u30C8\u30B5\u30A4\u30BA
address-setting.message-counter-history-day-limit=1\u65E5\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u5C65\u6B74\u306E\u5236\u9650
address-setting.page-max-cache-size=\u30DA\u30FC\u30B8\u30F3\u30B0\u306E\u30CA\u30D3\u30B2\u30FC\u30B7\u30E7\u30F3\u6642\u306E IO \u3092\u6700\u9069\u5316\u3059\u308B\u305F\u3081\u306B\u3001\u30E1\u30E2\u30EA\u5185\u306B\u4FDD\u6301\u3059\u308B\u30DA\u30FC\u30B8\u30D5\u30A1\u30A4\u30EB\u306E\u6570\u3002
address-setting.page-size-bytes=\u30DA\u30FC\u30B8\u30F3\u30B0\u30B5\u30A4\u30BA
address-setting.redelivery-delay=\u30AD\u30E3\u30F3\u30BB\u30EB\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u518D\u9001\u3092\u8A66\u884C\u3059\u308B\u524D\u306B\u5F85\u6A5F\u3059\u308B\u6642\u9593\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
address-setting.redelivery-multiplier=redelivery-delay \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306B\u9069\u7528\u3059\u308B\u4E57\u6570\u3002
address-setting.redistribution-delay=\u6700\u5F8C\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u30AD\u30E5\u30FC\u3067\u9589\u3058\u3089\u308C\u305F\u5834\u5408\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u518D\u9001\u3092\u884C\u3046\u524D\u306B\u5F85\u6A5F\u3059\u308B\u671F\u9593\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
address-setting.remove=\u65E2\u5B58\u306E address-setting \u306E\u524A\u9664\u64CD\u4F5C
address-setting.send-to-dla-on-no-route=\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u304C\u305D\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u5BFE\u3057\u3066 true \u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3067\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u3069\u306E\u30AD\u30E5\u30FC\u306B\u3082\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u305D\u306E\u30A2\u30C9\u30EC\u30B9\u306E\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9 (DLA) \u304C\u3042\u308C\u3070\u305D\u3061\u3089\u306B\u9001\u4FE1\u3055\u308C\u307E\u3059\u3002
address-setting.slow-consumer-check-period=\u7279\u5B9A\u30AD\u30E5\u30FC\u4E0A\u306E\u9045\u3044\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3092\u30C1\u30A7\u30C3\u30AF\u3059\u308B\u983B\u5EA6\u3002
address-setting.slow-consumer-policy=\u9045\u3044\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u7279\u5B9A\u3055\u308C\u305F\u3068\u304D\u306B\u4F55\u3092\u884C\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
address-setting.slow-consumer-threshold=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u9045\u3044\u3068\u5224\u65AD\u3055\u308C\u308B\u524D\u306B\u8A31\u53EF\u3055\u308C\u308B\u6700\u4F4E\u30E1\u30C3\u30BB\u30FC\u30B8\u6D88\u8CBB\u7387\u3002
address-setting=\u30A2\u30C9\u30EC\u30B9\u8A2D\u5B9A\u306F\u4E00\u90E8\u306E\u5C5E\u6027\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u304C\u3001\u3053\u308C\u3089\u306F\u7279\u5B9A\u306E\u30AD\u30E5\u30FC\u3067\u306F\u306A\u304F\u30A2\u30C9\u30EC\u30B9\u306E\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u306B\u5BFE\u3057\u3066\u5B9A\u7FA9\u3055\u308C\u307E\u3059\u3002
bindings-directory.path=\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B8\u30E3\u30FC\u30CA\u30EB\u304C\u5B58\u5728\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F${jboss.server.data.dir}/messagingbindings \u3067\u3059\u3002
bridge.add=\u30D6\u30EA\u30C3\u30B8\u306E\u8FFD\u52A0\u64CD\u4F5C
bridge.check-period=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u554F\u984C\u78BA\u8A8D\u306E\u671F\u9593 (\u30DF\u30EA\u79D2)
bridge.confirmation-window-size=\u5BFE\u8C61\u30CE\u30FC\u30C9\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8EE2\u9001\u3059\u308B\u306E\u306B\u4F7F\u3046\u63A5\u7D9A\u306B\u5229\u7528\u3059\u308B confirmation-window-size 
bridge.connection-ttl=\u30D6\u30EA\u30C3\u30B8\u3067\u4F7F\u7528\u3057\u305F\u63A5\u7D9A\u304C (\u30CF\u30FC\u30C8\u30D3\u30FC\u30C8\u306A\u3057\u3067\u3082) \u5B58\u7D9A\u3057\u3066\u3044\u308B\u3068\u307F\u306A\u3055\u308C\u308B\u6700\u5927\u6642\u9593 (\u30DF\u30EA\u79D2)
bridge.credential-reference=\u30D6\u30EA\u30C3\u30B8\u3092\u8A8D\u8A3C\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB (\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304B\u3089\u306E)
bridge.credential-reference.store=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3078\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D
bridge.credential-reference.type=\u3053\u306E\u53C2\u7167\u304C\u610F\u5473\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30BF\u30A4\u30D7
bridge.credential-reference.alias=\u4FDD\u5B58\u3055\u308C\u305F\u79D8\u5BC6\u307E\u305F\u306F\u30B9\u30C8\u30A2\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u610F\u5473\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9
bridge.credential-reference.clear-text=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u79D8\u5BC6 (\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB/ \u79D8\u5BC6\u3092\u30B5\u30FC\u30D3\u30B9\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044)
bridge.discovery-group=\u3053\u306E\u30D6\u30EA\u30C3\u30B8\u304C\u4F7F\u3046\u30C7\u30A3\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u540D\u3002'static-connectors' \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u672A\u5B9A\u7FA9 (null) \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
bridge.failover-on-server-shutdown.deprecated=\u975E\u63A8\u5968\u3002\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u5F71\u97FF\u306F\u306A\u304F\u3001\u3053\u306E\u5C5E\u6027\u306E\u5024\u3092\u8A2D\u5B9A\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u8B66\u544A\u304C\u51FA\u3055\u308C\u307E\u3059\u3002
bridge.failover-on-server-shutdown=\u975E\u63A8\u5968\u3002\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u5F71\u97FF\u306F\u306A\u304F\u3001\u3053\u306E\u5C5E\u6027\u306E\u5024\u3092\u8A2D\u5B9A\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u8B66\u544A\u304C\u51FA\u3055\u308C\u307E\u3059\u3002
bridge.filter=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u6587\u5B57\u5217\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30D5\u30A3\u30EB\u30BF\u30FC\u5F0F\u306B\u4E00\u81F4\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u307F\u304C\u8EE2\u9001\u3055\u308C\u307E\u3059\u3002\u30D5\u30A3\u30EB\u30BF\u30FC\u6587\u5B57\u5217\u306F ActiveMQ \u6587\u66F8\u3067\u8AAC\u660E\u3055\u308C\u3066\u3044\u308B ActiveMQ \u30D5\u30A3\u30EB\u30BF\u30FC\u5F0F\u306E\u69CB\u6587\u306B\u5F93\u3044\u307E\u3059\u3002
bridge.forwarding-address=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u3068\u306A\u308B\u5BFE\u8C61\u30B5\u30FC\u30D0\u30FC\u4E0A\u306E\u30A2\u30C9\u30EC\u30B9\u3002\u8EE2\u9001\u30A2\u30C9\u30EC\u30B9\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u5143\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u304C\u4FDD\u305F\u308C\u307E\u3059\u3002
bridge.ha=\u3053\u306E\u30D6\u30EA\u30C3\u30B8\u304C\u9AD8\u53EF\u7528\u6027\u306B\u5BFE\u5FDC\u3059\u3079\u304D\u304B\u3002True \u306F\u30AF\u30E9\u30B9\u30BF\u30FC\u5185\u3067\u5229\u7528\u53EF\u80FD\u306A\u30B5\u30FC\u30D0\u30FC\u306B\u63A5\u7D9A\u3057\u3001\u30D5\u30A7\u30A4\u30EB\u30AA\u30FC\u30D0\u30FC\u306B\u5BFE\u5FDC\u3059\u308B\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
bridge.initial-connect-attempts=\u3053\u306E\u30D6\u30EA\u30C3\u30B8\u3067\u521D\u671F\u63A5\u7D9A\u3092\u8A66\u884C\u3059\u308B\u56DE\u6570\u3002
bridge.max-retry-interval=\u63A5\u7D9A\u306E\u518D\u8A66\u884C\u306B\u5229\u7528\u3059\u308B\u6700\u5927\u9593\u9694
bridge.min-large-message-size=\u5927\u5BB9\u91CF\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u307F\u306A\u3055\u308C\u308B\u307E\u3067\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6700\u5C0F\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8)
bridge.password=\u30EA\u30E2\u30FC\u30C8\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u30D6\u30EA\u30C3\u30B8\u63A5\u7D9A\u3092\u4F5C\u6210\u6642\u306B\u4F7F\u3046\u30D1\u30B9\u30EF\u30FC\u30C9\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30EB\u30FC\u30C8\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u30EA\u30BD\u30FC\u30B9\u306Ecluster-password \u5C5E\u6027\u3067\u6307\u5B9A\u3055\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5229\u7528\u3057\u307E\u3059\u3002
bridge.producer-window-size=\u30D6\u30EA\u30C3\u30B8\u4E0A\u306E\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306E\u30D5\u30ED\u30FC\u5236\u5FA1\u30B5\u30A4\u30BA
bridge.queue-name=\u30D6\u30EA\u30C3\u30B8\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30E0\u3059\u308B\u30ED\u30FC\u30AB\u30EB\u30AD\u30E5\u30FC\u306E\u4E00\u610F\u540D
bridge.reconnect-attempts-on-same-node=\u30D6\u30EA\u30C3\u30B8\u304C\u540C\u3058\u30CE\u30FC\u30C9\u3067\u8A66\u884C\u3059\u308B\u518D\u63A5\u7D9A\u306E\u5408\u8A08\u56DE\u6570\u3002\u3053\u306E\u56DE\u6570\u8A66\u884C\u3057\u305F\u5F8C\u3001\u30D6\u30EA\u30C3\u30B8\u306F\u518D\u63A5\u7D9A\u3092\u65AD\u5FF5\u3057\u3001\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3057\u307E\u3059\u3002\u5024\u304C -1 \u306E\u5834\u5408\u306F\u3001\u7121\u5236\u9650\u306B\u518D\u8A66\u884C\u3092\u884C\u3044\u307E\u3059\u3002
bridge.reconnect-attempts=\u30D6\u30EA\u30C3\u30B8\u304C\u8A66\u884C\u3059\u308B\u518D\u63A5\u7D9A\u306E\u5408\u8A08\u56DE\u6570\u3002\u3053\u306E\u56DE\u6570\u8A66\u884C\u3057\u305F\u5F8C\u3001\u30D6\u30EA\u30C3\u30B8\u306F\u518D\u63A5\u7D9A\u3092\u65AD\u5FF5\u3057\u3001\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3057\u307E\u3059\u3002\u5024\u304C -1 \u306E\u5834\u5408\u3001\u7121\u5236\u9650\u306B\u518D\u8A66\u884C\u3092\u884C\u3044\u307E\u3059\u3002
bridge.remove=\u30D6\u30EA\u30C3\u30B8\u306E\u524A\u9664\u64CD\u4F5C
bridge.retry-interval-multiplier=\u6B21\u306E\u518D\u8A66\u884C\u307E\u3067\u306E\u6642\u9593\u3092\u7B97\u51FA\u3059\u308B\u305F\u3081\u306B\u6700\u5F8C\u306E\u518D\u8A66\u884C\u304B\u3089\u306E\u6642\u9593\u3092\u9069\u7528\u3059\u308B\u4E57\u6570\u3002\u3053\u308C\u306B\u3088\u308A\u5404\u518D\u8A66\u884C\u306E\u9593\u306E\u518D\u9001\u671F\u9593\u3092\u7B97\u51FA\u3059\u308B\u65B9\u6CD5\u3092\u5B9F\u88C5\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
bridge.retry-interval=\u5BFE\u8C61\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u306B\u5931\u6557\u3057\u305F\u5834\u5408\u3001\u518D\u63A5\u7D9A\u3092\u8A66\u884C\u3057\u3066\u304B\u3089\u6B21\u306E\u8A66\u884C\u307E\u3067\u306E\u671F\u9593 (\u30DF\u30EA\u79D2)\u3002
bridge.start=\u30D6\u30EA\u30C3\u30B8\u3092\u958B\u59CB\u3057\u307E\u3059\u3002
bridge.started=\u30D6\u30EA\u30C3\u30B8\u3092\u958B\u59CB\u3059\u308B\u304B\u3069\u3046\u304B
bridge.static-connectors=\u3053\u306E\u30D6\u30EA\u30C3\u30B8\u304C\u4F7F\u3046\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u9759\u7684\u306B\u5B9A\u7FA9\u3059\u308B\u540D\u524D\u306E\u4E00\u89A7\u3002'discovery-group-name' \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u672A\u5B9A\u7FA9 (null) \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
bridge.stop=\u30D6\u30EA\u30C3\u30B8\u3092\u505C\u6B62\u3057\u307E\u3059\u3002
bridge.transformer-class-name=org.apache.activemq.artemis.core.server.cluster.Transformer \u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u5B9F\u88C5\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u5B9A\u7FA9\u30AF\u30E9\u30B9\u306E\u540D\u524D\u3002
bridge.use-duplicate-detection=\u30D6\u30EA\u30C3\u30B8\u304C\u8EE2\u9001\u3059\u308B\u5404\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u81EA\u52D5\u7684\u306B\u8907\u88FD id \u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3092\u633F\u5165\u3059\u308B\u304B\u3069\u3046\u304B
bridge.user=\u30EA\u30E2\u30FC\u30C8\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u30D6\u30EA\u30C3\u30B8\u63A5\u7D9A\u306E\u4F5C\u6210\u6642\u306B\u4F7F\u3046\u30E6\u30FC\u30B6\u30FC\u540D\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u30EB\u30FC\u30C8\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u30EA\u30BD\u30FC\u30B9\u306E clustrer-user \u5C5E\u6027\u3067\u6307\u5B9A\u3055\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u30E6\u30FC\u30B6\u30FC\u3092\u5229\u7528\u3057\u307E\u3059\u3002
bridge=\u30BD\u30FC\u30B9\u30AD\u30E5\u30FC\u304B\u3089\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u6D88\u8CBB\u3057\u3066\u76EE\u7684\u306E\u30A2\u30C9\u30EC\u30B9 (\u4E00\u822C\u7684\u306B\u306F\u5225\u306E ActiveMQ \u30B5\u30FC\u30D0\u30FC\u306E\u30A2\u30C9\u30EC\u30B9) \u306B\u8EE2\u9001\u3059\u308B\u306E\u304C\u30D6\u30EA\u30C3\u30B8\u306E\u5F79\u5272\u3067\u3059\u3002
broadcast-group.add=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u8FFD\u52A0
broadcast-group.broadcast-period=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3068\u6B21\u306E\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u306E\u9593\u306E\u671F\u9593 (\u30DF\u30EA\u79D2)
broadcast-group.connectors=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3092\u884C\u3046\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u540D\u524D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
broadcast-group.get-connector-pairs-as-json=JSON \u30B7\u30EA\u30A2\u30EB\u5316\u3092\u4F7F\u3063\u3066\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u304C\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3059\u308B live-backup \u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u30DA\u30A2\u3092\u8FD4\u3057\u307E\u3059\u3002
broadcast-group.group-address.deprecated=\u4EE3\u308F\u308A\u306B socket-binding \u3092\u4F7F\u7528\u3057\u3066\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u30B0\u30EB\u30FC\u30D7\u30A2\u30C9\u30EC\u30B9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
broadcast-group.group-address=\u975E\u63A8\u5968\u3002\u30C7\u30FC\u30BF\u3092\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3059\u308B\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30A2\u30C9\u30EC\u30B9\u3002\u7BC4\u56F2\u304C 224.0.0.0 \u304B\u3089 239.255.255.255 (\u4E21\u5024\u3092\u542B\u3080) \u307E\u3067\u306E\u30AF\u30E9\u30B9 D \u306E IP \u30A2\u30C9\u30EC\u30B9\u3067\u3059\u3002\u30A2\u30C9\u30EC\u30B9 244.0.0.0 \u306F\u4E88\u7D04\u3055\u308C\u3066\u3044\u308B\u305F\u3081\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002
broadcast-group.group-port.deprecated=\u4EE3\u308F\u308A\u306B socket-binding \u3092\u4F7F\u7528\u3057\u3066\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u30B0\u30EB\u30FC\u30D7\u30DD\u30FC\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
broadcast-group.group-port=\u975E\u63A8\u5968\u3002\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u306B\u4F7F\u7528\u3055\u308C\u308B UDP \u30DD\u30FC\u30C8\u756A\u53F7\u3002
broadcast-group.jgroups-cluster=\u8AD6\u7406\u30AF\u30E9\u30B9\u30BF\u30FC\u540D\u3002
broadcast-group.jgroups-channel=JGroups \u30C1\u30E3\u30CD\u30EB\u306E\u540D\u524D\u3092\u53C2\u7167\u3057\u307E\u3059\u3002\u672A\u5B9A\u7FA9\u306E\u5834\u5408\u306F\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30C1\u30E3\u30CD\u30EB\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
broadcast-group.jgroups-stack=JGroups \u30C1\u30E3\u30CD\u30EB\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u540D\u524D\u3092\u53C2\u7167\u3057\u307E\u3059\u3002
broadcast-group.jgroups-stack.deprecated=\u975E\u63A8\u5968\u3002\u4EE3\u308F\u308A\u306B groups-channel \u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
broadcast-group.local-bind-address.deprecated=\u4EE3\u308F\u308A\u306B socket-binding \u3092\u4F7F\u7528\u3057\u3066\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u30ED\u30FC\u30AB\u30EB\u30D0\u30A4\u30F3\u30C9\u30A2\u30C9\u30EC\u30B9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
broadcast-group.local-bind-address=\u975E\u63A8\u5968\u3002\u30C7\u30FC\u30BF\u30B0\u30E9\u30E0\u30BD\u30B1\u30C3\u30C8\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B\u30ED\u30FC\u30AB\u30EB\u306E\u30D0\u30A4\u30F3\u30C9\u30A2\u30C9\u30EC\u30B9\u3002\u8907\u6570\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304C\u30B5\u30FC\u30D0\u30FC\u4E0A\u306B\u3042\u308B\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8A2D\u5B9A\u3057\u3066\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u306B\u4F7F\u7528\u3057\u305F\u3044\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30AB\u30FC\u30CD\u30EB\u306B\u3088\u3063\u3066\u9078\u629E\u3055\u308C\u308B IP \u30A2\u30C9\u30EC\u30B9\u3067\u3042\u308B\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u30A2\u30C9\u30EC\u30B9\u3078\u30BD\u30B1\u30C3\u30C8\u304C\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u307E\u3059\u3002
broadcast-group.local-bind-port.deprecated=\u4EE3\u308F\u308A\u306B socket-binding \u3092\u4F7F\u7528\u3057\u3066\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u30ED\u30FC\u30AB\u30EB\u30D0\u30A4\u30F3\u30C9\u30DD\u30FC\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
broadcast-group.local-bind-port=\u975E\u63A8\u5968\u3002\u30C7\u30FC\u30BF\u30B0\u30E9\u30E0\u30BD\u30B1\u30C3\u30C8\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B\u30ED\u30FC\u30AB\u30EB\u30DD\u30FC\u30C8\u3002\u901A\u5E38\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u3067\u3042\u308B -1 \u3092\u4F7F\u7528\u3057\u307E\u3059\u3002-1 \u306F\u533F\u540D\u30DD\u30FC\u30C8\u304C\u4F7F\u7528\u3055\u308C\u308B\u3079\u304D\u3067\u3042\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F\u5FC5\u305A local-bind-address \u3068\u4F75\u305B\u3066\u6307\u5B9A\u3055\u308C\u307E\u3059\u3002
broadcast-group.remove=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u524A\u9664
broadcast-group.socket-binding=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
broadcast-group.start=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u958B\u59CB
broadcast-group.started=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u3092\u958B\u59CB\u3059\u308B\u304B\u3069\u3046\u304B
broadcast-group.stop=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u505C\u6B62
broadcast-group=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u304C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u7D4C\u7531\u3067\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3059\u308B\u624B\u6BB5\u3067\u3059\u3002
external-jms-queue.add=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 JMS \u30AD\u30E5\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
external-jms-queue.entries=\u30AD\u30E5\u30FC\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B jndi \u540D
external-jms-queue.remove=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 JMS \u30AD\u30E5\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
external-jms-queue=\u30EA\u30E2\u30FC\u30C8\u30D6\u30ED\u30FC\u30AB\u30FC\u3078 JMS \u30AD\u30E5\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
external-jms-topic.add=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 JMS \u30C8\u30D4\u30C3\u30AF\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
external-jms-topic.entries=\u30C8\u30D4\u30C3\u30AF\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B jndi \u540D
external-jms-topic.remove=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 JMS \u30C8\u30D4\u30C3\u30AF\u3092\u524A\u9664\u3057\u307E\u3059\u3002
external-jms-topic=\u30EA\u30E2\u30FC\u30C8\u30D6\u30ED\u30FC\u30AB\u30FC\u3078 JMS\u8A2D\u5B9A \u30C8\u30D4\u30C3\u30AF\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
cluster-connection.add=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306E\u8FFD\u52A0\u64CD\u4F5C
cluster-connection.allow-direct-connections-only=\u3042\u308B\u30CE\u30FC\u30C9\u304C 2 \u30DB\u30C3\u30D7\u4EE5\u4E0A\u5148\u306B\u30CE\u30FC\u30C9\u304C\u3042\u308B\u3053\u3068\u3092\u8A8D\u8B58\u3057\u305F\u5834\u5408\u3001\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u76F4\u63A5\u63A5\u7D9A\u306B\u30D6\u30EA\u30C3\u30B8\u3092\u4F5C\u6210\u3057\u306A\u3044\u304B\u3069\u3046\u304B\u3002'static-connectors' \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306B\u306E\u307F\u8A72\u5F53\u3057\u307E\u3059\u3002
cluster-connection.call-failover-timeout=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306B\u3088\u308B\u30EA\u30E2\u30FC\u30C8\u547C\u3073\u51FA\u3057\u306B\u5BFE\u3057\u3066\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u304C\u51E6\u7406\u3055\u308C\u3066\u3044\u308B\u6642\u306B\u4F7F\u7528\u3059\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u30DF\u30EA\u79D2)\u3002
cluster-connection.call-timeout=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306E\u30EA\u30E2\u30FC\u30C8\u547C\u3073\u51FA\u3057\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u30DF\u30EA\u79D2)
cluster-connection.check-period=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u554F\u984C\u78BA\u8A8D\u306E\u671F\u9593 (\u30DF\u30EA\u79D2)
cluster-connection.cluster-connection-address=\u5404\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306F\u3001\u3053\u306E\u5024\u3067\u59CB\u307E\u308B\u30A2\u30C9\u30EC\u30B9\u3078\u9001\u4FE1\u3055\u308C\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u306E\u307F\u9069\u7528\u3055\u308C\u307E\u3059\u3002
cluster-connection.confirmation-window-size=\u30BF\u30FC\u30B2\u30C3\u30C8\u30CE\u30FC\u30C9\u3078\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8EE2\u9001\u3059\u308B\u305F\u3081\u4F7F\u7528\u3055\u308C\u308B\u63A5\u7D9A\u306B\u5BFE\u3059\u308B confirmation-window-size\u3002
cluster-connection.connection-ttl=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3067\u4F7F\u7528\u3057\u305F\u63A5\u7D9A\u304C (\u30CF\u30FC\u30C8\u30D3\u30FC\u30C8\u306A\u3057\u3067\u3082) \u5B58\u7D9A\u3057\u3066\u3044\u308B\u3068\u307F\u306A\u3055\u308C\u308B\u6700\u5927\u6642\u9593 (\u30DF\u30EA\u79D2)
cluster-connection.connector-name=\u30E9\u30A4\u30D6\u63A5\u7D9A\u306B\u4F7F\u7528\u3059\u308B\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u540D\u524D
cluster-connection.discovery-group=\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u63A5\u7D9A\u5148\u3068\u306A\u308B\u30AF\u30E9\u30B9\u30BF\u30FC\u3067\u4ED6\u306E\u30B5\u30FC\u30D0\u30FC\u4E00\u89A7\u3092\u53D6\u5F97\u3059\u308B\u305F\u3081\u306B\u5229\u7528\u3059\u308B\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u3002'static-connectors' \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u672A\u5B9A\u7FA9 (null) \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
cluster-connection.message-load-balancing-type=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3067\u63D0\u4F9B\u3055\u308C\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u8CA0\u8377\u5206\u6563\u306E\u30BF\u30A4\u30D7\u3002
cluster-connection.get-nodes.reply=\u30AD\u30FC\u304C\u30CE\u30FC\u30C9 ID \u3067\u3001\u5024\u304C\u30CE\u30FC\u30C9\u3078\u306E\u63A5\u7D9A\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30C9\u30EC\u30B9\u3067\u3042\u308B\u30DE\u30C3\u30D7\u3002
cluster-connection.get-nodes=\u3053\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306B\u63A5\u7D9A\u3059\u308B\u30CE\u30FC\u30C9\u306E\u30DE\u30C3\u30D7\u3092\u8FD4\u3057\u307E\u3059\u3002\u3053\u306E\u30DE\u30C3\u30D7\u3067\u306F\u30AD\u30FC\u304C\u30CE\u30FC\u30C9 ID \u3067\u3001\u5024\u304C\u30CE\u30FC\u30C9\u3078\u306E\u63A5\u7D9A\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30C9\u30EC\u30B9\u306B\u306A\u308A\u307E\u3059\u3002
cluster-connection.get-static-connectors-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u9759\u7684\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u4E00\u89A7\u3092\u8FD4\u3057\u307E\u3059\u3002
cluster-connection.initial-connect-attempts=\u3053\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3067\u521D\u671F\u63A5\u7D9A\u3092\u8A66\u884C\u3059\u308B\u56DE\u6570\u3002
cluster-connection.max-hops=\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8EE2\u9001\u53EF\u80FD\u306A\u6700\u5927\u56DE\u6570\u3002ActiveMQ \u306F\u3001\u30C1\u30A7\u30FC\u30F3\u306E\u4EF2\u4ECB\u3068\u3057\u3066\u4ED6\u306E ActiveMQ \u30B5\u30FC\u30D0\u30FC\u3068\u9593\u63A5\u7684\u306B\u306E\u307F\u63A5\u7D9A\u3067\u304D\u308B\u30CE\u30FC\u30C9\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8CA0\u8377\u5206\u6563\u3059\u308B\u3088\u3046\u306B\u8A2D\u5B9A\u3059\u308B\u3053\u3068\u3082\u3067\u304D\u307E\u3059\u3002
cluster-connection.max-retry-interval=\u63A5\u7D9A\u306E\u518D\u8A66\u884C\u306B\u5229\u7528\u3059\u308B\u6700\u5927\u9593\u9694
cluster-connection.min-large-message-size=\u5927\u5BB9\u91CF\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u307F\u306A\u3055\u308C\u308B\u307E\u3067\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6700\u5C0F\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8)
cluster-connection.node-id=\u3053\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306B\u3088\u308A\u4F7F\u7528\u3055\u308C\u308B\u30CE\u30FC\u30C9 ID
cluster-connection.notification-attempts=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u304C\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3092\u884C\u3046\u56DE\u6570\u3002
cluster-connection.notification-interval=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u304C\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3092\u884C\u3046\u983B\u5EA6
cluster-connection.producer-window-size=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u4E0A\u306E\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306E\u30D5\u30ED\u30FC\u5236\u5FA1\u30B5\u30A4\u30BA
cluster-connection.reconnect-attempts=\u30D6\u30EA\u30C3\u30B8\u304C\u8A66\u884C\u3059\u308B\u518D\u63A5\u7D9A\u306E\u5408\u8A08\u56DE\u6570\u3002\u3053\u306E\u56DE\u6570\u8A66\u884C\u3057\u305F\u5F8C\u3001\u30D6\u30EA\u30C3\u30B8\u306F\u518D\u63A5\u7D9A\u3092\u65AD\u5FF5\u3057\u3001\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3057\u307E\u3059\u3002\u5024\u304C -1 \u306E\u5834\u5408\u3001\u7121\u5236\u9650\u306B\u518D\u8A66\u884C\u3092\u884C\u3044\u307E\u3059\u3002
cluster-connection.remove=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306E\u524A\u9664\u64CD\u4F5C
cluster-connection.retry-interval-multiplier=\u6B21\u306E\u518D\u8A66\u884C\u307E\u3067\u306E\u6642\u9593\u3092\u7B97\u51FA\u3059\u308B\u305F\u3081\u306B\u6700\u5F8C\u306E\u518D\u8A66\u884C\u304B\u3089\u306E\u6642\u9593\u3092\u9069\u7528\u3059\u308B\u4E57\u6570\u3002\u3053\u308C\u306B\u3088\u308A\u5404\u518D\u8A66\u884C\u306E\u9593\u306E\u518D\u9001\u671F\u9593\u3092\u7B97\u51FA\u3059\u308B\u65B9\u6CD5\u3092\u5B9F\u88C5\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
cluster-connection.retry-interval=\u5BFE\u8C61\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u306B\u5931\u6557\u3057\u305F\u5834\u5408\u3001\u5BFE\u8C61\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u518D\u63A5\u7D9A\u3092\u8A66\u884C\u3057\u3066\u304B\u3089\u6B21\u306E\u8A66\u884C\u3092\u884C\u3046\u307E\u3067\u306E\u671F\u9593 (\u30DF\u30EA\u79D2)\u3002
cluster-connection.start=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306E\u958B\u59CB
cluster-connection.started=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3092\u958B\u59CB\u3059\u308B\u304B\u3069\u3046\u304B
cluster-connection.static-connectors=\u3053\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u304C\u63A5\u7D9A\u3059\u308B\u5148\u3092\u9759\u7684\u306B\u5B9A\u7FA9\u3057\u305F\u30B3\u30CD\u30AF\u30BF\u30FC\u4E00\u89A7\u3002'discovery-group-name' \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u672A\u5B9A\u7FA9 (null) \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
cluster-connection.stop=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306E\u505C\u6B62
cluster-connection.topology=\u3053\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u304C\u8A8D\u8B58\u3057\u3066\u3044\u308B\u30CE\u30FC\u30C9\u306E\u30C8\u30DD\u30ED\u30B8\u30FC
cluster-connection.use-duplicate-detection=\u30D6\u30EA\u30C3\u30B8\u304C\u8EE2\u9001\u3059\u308B\u5404\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u81EA\u52D5\u7684\u306B\u8907\u88FD id \u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3092\u633F\u5165\u3059\u308B\u304B\u3069\u3046\u304B
cluster-connection=\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u30CE\u30FC\u30C9\u9593\u3067\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8CA0\u8377\u5206\u6563\u3059\u308B\u305F\u3081\u306B\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306F\u30B5\u30FC\u30D0\u30FC\u7FA4\u3092\u30AF\u30E9\u30B9\u30BF\u30FC\u306B\u30B0\u30EB\u30FC\u30D7\u5316\u3057\u307E\u3059\u3002
configuration=\u8A2D\u5B9A
connection-factory.add-jndi.jndi-binding=Jndi \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
connection-factory.add-jndi=\u30D5\u30A1\u30AF\u30C8\u30EA\u3092\u5225\u306E JNDI \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306B\u8FFD\u52A0
connection-factory.add=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u8FFD\u52A0
connection-factory.auto-group=\u81EA\u52D5\u3067\u30E1\u30C3\u30BB\u30FC\u30B8\u5206\u985E\u3092\u5229\u7528\u3059\u308B\u304B\u3069\u3046\u304B
connection-factory.block-on-acknowledge=True \u306F\u78BA\u8A8D\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
connection-factory.block-on-durable-send=True \u306F\u6C38\u7D9A\u9001\u4FE1\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u8A2D\u5B9A\u3057\u307E\u3059\u3002
connection-factory.block-on-non-durable-send=True \u306F\u975E\u6C38\u7D9A\u9001\u4FE1\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u8A2D\u5B9A\u3057\u307E\u3059\u3002
connection-factory.cache-large-message-client=True \u306F\u5927\u5BB9\u91CF\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u3057\u307E\u3059\u3002
connection-factory.call-failover-timeout=\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u304C\u51E6\u7406\u4E2D\u306E\u6642\u306B\u4F7F\u7528\u3059\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u30DF\u30EA\u79D2)\u3002
connection-factory.call-timeout=\u547C\u3073\u51FA\u3057\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
connection-factory.client-failure-check-period=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u554F\u984C\u78BA\u8A8D\u671F\u9593
connection-factory.client-id=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 id
connection-factory.compress-large-messages=\u5927\u5BB9\u91CF\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u5727\u7E2E\u3059\u3079\u304D\u304B\u3069\u3046\u304B
connection-factory.confirmation-window-size=\u78BA\u8A8D\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
connection-factory.connection-factory=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u5B9A\u7FA9
connection-factory.connection-load-balancing-policy-class-name=\u30AF\u30E9\u30B9\u30BF\u30FC\u5185\u306E\u69D8\u3005\u306A\u30CE\u30FC\u30C9\u306E\u9593\u3067\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u8CA0\u8377\u5206\u6563\u3092\u884C\u3046\u969B\u306B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u5229\u7528\u53EF\u80FD\u306A\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5074\u306E\u8CA0\u8377\u5206\u6563\u30DD\u30EA\u30B7\u30FC\u3092\u5B9F\u88C5\u3059\u308B\u30AF\u30E9\u30B9\u540D\u3002
connection-factory.connection-ttl=\u63A5\u7D9A ttl
connection-factory.connectors=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u5B9A\u7FA9\u3002\u672A\u5B9A\u7FA9\u306E\u5024\u3068\u5408\u308F\u305B\u3066\u3001\u30B3\u30CD\u30AF\u30BF\u30FC\u540D\u3067\u30DE\u30C3\u30D7\u5185\u306B\u4FDD\u5B58\u3055\u308C\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u3092\u66F8\u304D\u8FBC\u3080\u3068\u304D\u306F\u3001\u30B3\u30CD\u30AF\u30BF\u30FC\u540D\u306E\u30EA\u30B9\u30C8\u3092\u6E21\u3059\u3053\u3068\u304C\u53EF\u80FD\u3067\u3059\u3002
connection-factory.consumer-max-rate=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u6700\u5927\u30EC\u30FC\u30C8
connection-factory.consumer-window-size=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
connection-factory.deserialization-black-list=JMS ObjectMessage \u306E\u30B7\u30EA\u30A2\u30EB\u5316\u3067\u306E\u4F7F\u7528\u304C\u62D2\u5426\u3055\u308C\u308B\u30AF\u30E9\u30B9\u540D\u306E\u30EA\u30B9\u30C8 (\u30B9\u30DA\u30FC\u30B9\u533A\u5207\u308A)\u3002
connection-factory.deserialization-white-list=JMS ObjectMessage \u306E\u30B7\u30EA\u30A2\u30EB\u5316\u3067\u306E\u4F7F\u7528\u304C\u8A31\u53EF\u3055\u308C\u308B\u30AF\u30E9\u30B9\u540D\u306E\u30EA\u30B9\u30C8 (\u30B9\u30DA\u30FC\u30B9\u533A\u5207\u308A)\u3002
connection-factory.discovery-group=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30B0\u30EB\u30FC\u30D7\u540D
connection-factory.discovery-jgroups-channel=\u30EC\u30AC\u30B7\u30FC\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306B\u3088\u308B\u691C\u51FA\u306B\u4F7F\u7528\u3055\u308C\u308B JGroups \u30C1\u30E3\u30F3\u30CD\u30EB\u306E\u540D\u524D\u3002
connection-factory.discovery-socket-binding=\u30EC\u30AC\u30B7\u30FC\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306B\u3088\u308B\u691C\u51FA\u306B\u4F7F\u7528\u3055\u308C\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3002
connection-factory.discovery-initial-wait-timeout.deprecated=\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u5F71\u97FF\u306F\u306A\u304F\u3001\u3053\u306E\u5C5E\u6027\u306E\u5024\u3092\u8A2D\u5B9A\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u8B66\u544A\u304C\u51FA\u3055\u308C\u307E\u3059\u3002
connection-factory.discovery-initial-wait-timeout=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u306E\u521D\u671F\u5F85\u6A5F\u6642\u9593\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
connection-factory.discovery-refresh-timeout=\u7279\u5B9A\u306E\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u6700\u5F8C\u306E\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3092\u53D7\u4FE1\u3057\u3066\u304B\u3089\u4E00\u89A7\u304B\u3089\u30B5\u30FC\u30D0\u30FC\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u30DA\u30A2\u30A8\u30F3\u30C8\u30EA\u3092\u524A\u9664\u3059\u308B\u307E\u3067\u30C7\u30A3\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u304C\u5F85\u6A5F\u3059\u308B\u6642\u9593
connection-factory.dups-ok-batch-size=dups ok batch size
connection-factory.enable-amq1-prefix=\u30A2\u30C9\u30EC\u30B9\u3067 ActiveMQ 1.5.x \u63A5\u982D\u8F9E\u306E\u4F7F\u7528\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
connection-factory.entries=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u306B\u306A\u308B\u3079\u304D jndi \u540D
connection-factory.factory-type=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u578B\u3002 0 = jms cf, 1 = queue cf, 2 = topic cf, 3 = xa cf, 4 = xa queue cf, 5 = xa topic cf
connection-factory.failover-on-initial-connection=True \u306F\u521D\u671F\u63A5\u7D9A\u6642\u306B\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u3057\u307E\u3059\u3002
connection-factory.failover-on-server-shutdown.deprecated=\u975E\u63A8\u5968\u3002\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u5F71\u97FF\u306F\u306A\u304F\u3001\u3053\u306E\u5C5E\u6027\u306E\u5024\u3092\u8A2D\u5B9A\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u8B66\u544A\u304C\u51FA\u3055\u308C\u307E\u3059\u3002
connection-factory.failover-on-server-shutdown=True \u306F\u30B5\u30FC\u30D0\u30FC\u306E\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u6642\u306B\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u3057\u307E\u3059\u3002
connection-factory.group-id=\u30B0\u30EB\u30FC\u30D7 id
connection-factory.ha=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u304C\u9AD8\u53EF\u7528\u6027\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u304B\u3069\u3046\u304B
connection-factory.initial-connect-attempts=\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u521D\u671F\u63A5\u7D9A\u306E\u8A66\u884C\u56DE\u6570\u3002
connection-factory.initial-message-packet-size=\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u7D4C\u7531\u3067\u4F5C\u6210\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u521D\u671F\u30B5\u30A4\u30BA
connection-factory.max-retry-interval=\u518D\u8A66\u884C\u306E\u6700\u5927\u9593\u9694
connection-factory.min-large-message-size=\u5927\u5BB9\u91CF\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6700\u5C0F\u30B5\u30A4\u30BA
connection-factory.pre-acknowledge=True \u306F\u4E8B\u524D\u78BA\u8A8D\u3092\u884C\u3044\u307E\u3059\u3002
connection-factory.producer-max-rate=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306E\u6700\u5927\u30EC\u30FC\u30C8
connection-factory.producer-window-size=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306E\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
connection-factory.protocol-manager-factory=\u3053\u306E\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30ED\u30C8\u30B3\u30EB\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC org.apache.activemq.artemis.spi.core.remoting.ClientProtocolManagerFactory \u3092\u5B9F\u88C5\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059)\u3002
connection-factory.reconnect-attempts=\u518D\u63A5\u7D9A\u8A66\u884C
connection-factory.remove-jndi.jndi-binding=Jndi \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
connection-factory.remove-jndi=JNDI \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u524A\u9664\u3057\u307E\u3059
connection-factory.remove=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u524A\u9664
connection-factory.retry-interval-multiplier=\u518D\u8A66\u884C\u9593\u9694\u306E\u4E57\u6570
connection-factory.retry-interval=\u518D\u8A66\u884C\u306E\u9593\u9694
connection-factory.scheduled-thread-pool-max-size=\u4E88\u7D04\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B5\u30A4\u30BA
connection-factory.thread-pool-max-size=\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B5\u30A4\u30BA
connection-factory.transaction-batch-size=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA
connection-factory.use-global-pools=True \u306F\u30B0\u30ED\u30FC\u30D0\u30EB\u30D7\u30FC\u30EB\u3092\u4F7F\u3044\u307E\u3059\u3002
connection-factory.use-topology-for-load-balancing=\u30AF\u30E9\u30B9\u30BF\u30FC\u304B\u3089\u30C8\u30DD\u30ED\u30B8\u30FC\u60C5\u5831\u3092\u4F7F\u7528\u3057\u3066\u63A5\u7D9A\u3059\u308B\u304B\u3069\u3046\u304B\u3002false \u306B\u8A2D\u5B9A\u3055\u308C\u305F\u5834\u5408\u306F\u3001\u6700\u521D\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u307F\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
connection-factory=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u5B9A\u7FA9
connector-service.add=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u306E\u8FFD\u52A0\u64CD\u4F5C
connector-service.factory-class=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u3092\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u53EF\u80FD\u306A\u30D5\u30A1\u30AF\u30C8\u30EA\u30AF\u30E9\u30B9\u306E\u30AF\u30E9\u30B9\u540D
connector-service.params=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u306E factory-class \u306B\u3088\u308A\u7406\u89E3\u3055\u308C\u308B key/value \u30DA\u30A2
connector-service.remove=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u306E\u524A\u9664\u64CD\u4F5C
connector-service=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u3092\u4F7F\u7528\u3057\u3066\u5916\u90E8\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3068 Apache ActiveMQ Artemis \u3092\u7D71\u5408\u3057\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u53D7\u4FE1\u304C\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002
connector.add.params=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E factory-class \u304C\u7406\u89E3\u3057\u3001\u8A2D\u5B9A\u306B\u5229\u7528\u3059\u308B key-value \u30DA\u30A2\u30BB\u30C3\u30C8
connector.add=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C
connector.endpoint=\u3053\u306E http-connector \u306E\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3068\u3057\u3066\u52D5\u4F5C\u3059\u308B http-acceptor\u3002
connector.server-name=\u30EA\u30E2\u30FC\u30C8\u30B5\u30FC\u30D0\u30FC\u3067\u63A5\u7D9A\u3055\u308C\u308B ActiveMQ Artemis \u30B5\u30FC\u30D0\u30FC\u306E\u540D\u524D\u3002\u5B9A\u7FA9\u3055\u308C\u306A\u3044\u3068\u3001\u89AA ActiveMQ Artemis \u30B5\u30FC\u30D0\u30FC\u306E\u540D\u524D\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059 (\u89AA\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u306B http-connector \u304C\u4F7F\u7528\u3055\u308C\u308B\u5834\u5408\u306B\u9069\u3057\u3066\u3044\u307E\u3059)\u3002
connector.factory-class=\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3067\u304D\u308B\u30D5\u30A1\u30AF\u30C8\u30EA\u30AF\u30E9\u30B9\u306E\u30AF\u30E9\u30B9\u540D\u3002
connector.params=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E factory-class \u304C\u7406\u89E3\u3057\u3001\u8A2D\u5B9A\u306B\u5229\u7528\u3059\u308B key-value \u30DA\u30A2
connector.remove=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u524A\u9664\u64CD\u4F5C
connector.server-id=\u30B5\u30FC\u30D0\u30FC ID
connector.socket-binding=\u63A5\u7D9A\u3092\u4F5C\u6210\u3059\u308B\u305F\u3081\u30B3\u30CD\u30AF\u30BF\u30FC\u304C\u4F7F\u7528\u3059\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3002
connector=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u4F7F\u3044\u3001\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
core-address.binding-names=\u3053\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u308B\u5168\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0 (\u30AD\u30E5\u30FC\u3068\u8FC2\u56DE) \u306E\u540D\u524D
core-address.get-roles-as-json.reply=\u6587\u5B57\u5217\u306E JSON \u5F62\u5F0F
core-address.get-roles-as-json=JSON \u30B7\u30EA\u30A2\u30EB\u5316\u3092\u4F7F\u3044\u3001\u3053\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u308B\u30ED\u30FC\u30EB (\u540D\u524D\u3068\u6A29\u9650) \u3092\u8FD4\u3057\u307E\u3059\u3002
core-address.number-of-bytes-per-page=\u3053\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u5BFE\u3057\u3066\u5404\u30DA\u30FC\u30B8\u3067\u5229\u7528\u3055\u308C\u308B\u30D0\u30A4\u30C8\u6570
core-address.number-of-pages=\u3053\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u5229\u7528\u3055\u308C\u308B\u30DA\u30FC\u30B8\u6570
core-address.queue-names=\u30A2\u30C9\u30EC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u30AD\u30E5\u30FC\u306E\u540D\u524D
core-address.roles.consume=\u30A2\u30C9\u30EC\u30B9\u304B\u3089\u6D88\u8CBB\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3002
core-address.roles.create-durable-queue=\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u4F5C\u6210\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3002
core-address.roles.create-non-durable-queue=\u975E\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u4F5C\u6210\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3002
core-address.roles.delete-durable-queue=\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u524A\u9664\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3002
core-address.roles.delete-non-durable-queue=\u975E\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u524A\u9664\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3002
core-address.roles.deprecated=xyz (todo \u306E\u771F\u306E\u7406\u7531) \u304C\u5C0E\u5165\u3055\u308C\u305F\u305F\u3081\u5C5E\u6027\u306F\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F\u3002
core-address.roles.manage=\u30A2\u30C9\u30EC\u30B9\u3092\u7BA1\u7406\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3002
core-address.roles.name=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u306E\u540D\u524D\u3002
core-address.roles.role=\u30A2\u30C9\u30EC\u30B9\u306B\u95A2\u9023\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u3002
core-address.roles.send=\u30A2\u30C9\u30EC\u30B9\u3092\u9001\u4FE1\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3002
core-address.roles=\u5EC3\u6B62\u6E08\u307F (\u4EE3\u308F\u308A\u306B\u30ED\u30FC\u30EB\u306E\u5B50\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044)\u3002\u30A2\u30C9\u30EC\u30B9\u306B\u95A2\u9023\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB (\u540D\u524D\u3068\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3) \u306E\u30EA\u30B9\u30C8\u3002
core-address=ActiveMQ "address" \u3092\u793A\u3059\u30E9\u30F3\u30BF\u30A4\u30E0\u306E\u307F\u306E\u30EA\u30BD\u30FC\u30B9\u30021 \u3064\u306E\u30A2\u30C9\u30EC\u30B9\u306B 0 \u500B\u4EE5\u4E0A\u306E\u30AD\u30E5\u30FC\u3092\u30D0\u30A4\u30F3\u30C9\u3067\u304D\u307E\u3059\u3002\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3059\u308B\u969B\u3001\u305D\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u30AD\u30E5\u30FC\u306E\u30BB\u30C3\u30C8\u306B\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3057\u307E\u3059\u3002
deployed=\u3053\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u542B\u307E\u308C\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30EA\u30BD\u30FC\u30B9\u306B\u3088\u308A\u516C\u958B\u3055\u308C\u308B\u30E9\u30F3\u30BF\u30A4\u30E0\u30EA\u30BD\u30FC\u30B9
discovery-group.add=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u306E\u8FFD\u52A0
discovery-group.group-address.deprecated=\u4EE3\u308F\u308A\u306B socket-binding \u3092\u4F7F\u7528\u3057\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u306E\u30B0\u30EB\u30FC\u30D7\u30A2\u30C9\u30EC\u30B9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
discovery-group.group-address=(\u5EC3\u6B62\u6E08\u307F) \u30EA\u30C3\u30B9\u30F3\u3059\u308B\u30B0\u30EB\u30FC\u30D7\u306E\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8 IP \u30A2\u30C9\u30EC\u30B9
discovery-group.group-port.deprecated=\u4EE3\u308F\u308A\u306B socket-binding \u3092\u4F7F\u7528\u3057\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u306E\u30B0\u30EB\u30FC\u30D7\u30DD\u30FC\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
discovery-group.group-port=(\u5EC3\u6B62\u6E08\u307F) \u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E UDP \u30DD\u30FC\u30C8
discovery-group.initial-wait-timeout=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u304C\u59CB\u3081\u3066\u30AF\u30E9\u30B9\u30BF\u30FC\u306B1\u3064\u4EE5\u4E0A\u306E\u30CE\u30FC\u30C9\u3092\u63D0\u4F9B\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3059\u308B\u671F\u9593 (\u30DF\u30EA\u79D2)
discovery-group.jgroups-cluster=\u8AD6\u7406\u30AF\u30E9\u30B9\u30BF\u30FC\u540D\u3002
discovery-group.jgroups-channel=JGroups \u30C1\u30E3\u30CD\u30EB\u306E\u540D\u524D\u3092\u53C2\u7167\u3057\u307E\u3059\u3002\u672A\u5B9A\u7FA9\u306E\u5834\u5408\u306F\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30C1\u30E3\u30CD\u30EB\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
discovery-group.jgroups-stack=JGroups \u30C1\u30E3\u30CD\u30EB\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u540D\u524D\u3092\u53C2\u7167\u3057\u307E\u3059\u3002
discovery-group.jgroups-stack.deprecated=\u975E\u63A8\u5968\u3002\u4EE3\u308F\u308A\u306B groups-channel \u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
discovery-group.local-bind-address.deprecated=\u4EE3\u308F\u308A\u306B socket-binding \u3092\u4F7F\u7528\u3057\u3066\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u306E\u30ED\u30FC\u30AB\u30EB\u30D0\u30A4\u30F3\u30C9\u30A2\u30C9\u30EC\u30B9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
discovery-group.local-bind-address=(\u5EC3\u6B62\u6E08\u307F) \u30C7\u30FC\u30BF\u30B0\u30E9\u30E0\u30BD\u30B1\u30C3\u30C8\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3067\u3042\u308B\u30ED\u30FC\u30AB\u30EB\u306E\u30D0\u30A4\u30F3\u30C9\u30A2\u30C9\u30EC\u30B9
discovery-group.refresh-timeout=\u7279\u5B9A\u306E\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u6700\u5F8C\u306E\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3092\u53D7\u4FE1\u3057\u3066\u304B\u3089\u4E00\u89A7\u304B\u3089\u30B5\u30FC\u30D0\u30FC\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u30DA\u30A2\u30A8\u30F3\u30C8\u30EA\u3092\u524A\u9664\u3059\u308B\u307E\u3067\u30C7\u30A3\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u304C\u5F85\u6A5F\u3059\u308B\u6642\u9593
discovery-group.remove=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u306E\u524A\u9664
discovery-group.socket-binding=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
discovery-group=\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u30A2\u30CA\u30A6\u30F3\u30B9\u3059\u308B\u4ED6\u306E\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3092\u53D7\u4FE1\u3059\u308B\u305F\u3081\u306B\u30EA\u30C3\u30B9\u30F3\u3059\u308B\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7
divert.add=\u8FC2\u56DE\u306E\u8FFD\u52A0\u64CD\u4F5C
divert.divert-address=\u8FC2\u56DE\u5143\u306E\u30A2\u30C9\u30EC\u30B9
divert.exclusive=\u8FC2\u56DE\u304C\u6392\u4ED6\u7684\u304B\u3069\u3046\u304B\u3002\u3064\u307E\u308A\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u65B0\u898F\u30A2\u30C9\u30EC\u30B9\u306B\u8FC2\u56DE\u3055\u308C\u3001\u53E4\u3044\u30A2\u30C9\u30EC\u30B9\u306B\u306F\u9032\u307E\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
divert.filter=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u6587\u5B57\u5217\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30D5\u30A3\u30EB\u30BF\u30FC\u5F0F\u306B\u4E00\u81F4\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u307F\u304C\u8FC2\u56DE\u3055\u308C\u307E\u3059\u3002\u30D5\u30A3\u30EB\u30BF\u30FC\u6587\u5B57\u5217\u306F ActiveMQ \u6587\u66F8\u3067\u8AAC\u660E\u3055\u308C\u3066\u3044\u308B ActiveMQ \u30D5\u30A3\u30EB\u30BF\u30FC\u5F0F\u306E\u69CB\u6587\u306B\u5F93\u3044\u307E\u3059\u3002
divert.forwarding-address=\u8FC2\u56DE\u5148\u306E\u30A2\u30C9\u30EC\u30B9
divert.remove=\u8FC2\u56DE\u306E\u524A\u9664\u64CD\u4F5C
divert.routing-name=\u8FC2\u56DE\u306E\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u540D
divert.transformer-class-name=\u8FC2\u56DE\u524D\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30DC\u30C7\u30A3\u3042\u308B\u3044\u306F\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u5909\u63DB\u3059\u308B\u306E\u306B\u5229\u7528\u3059\u308B\u30AF\u30E9\u30B9\u540D
divert=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30ED\u30B8\u30C3\u30AF\u306B\u5909\u66F4\u3092\u52A0\u3048\u308B\u3053\u3068\u306A\u304F\u3001\u3042\u308B\u30A2\u30C9\u30EC\u30B9\u3092\u5225\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3059\u308B\u3088\u3046\u900F\u660E\u7684\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8FC2\u56DE\u53EF\u80FD\u306B\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30EA\u30BD\u30FC\u30B9\u3002
factory-class=\u30D5\u30A1\u30AF\u30C8\u30EA\u30AF\u30E9\u30B9
grouping-handler.add=\u30B0\u30EB\u30FC\u30D7\u5316\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002\u30B0\u30EB\u30FC\u30D7\u5316\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u307F\u3092\u5229\u7528\u53EF\u80FD\u3067\u3059\u3002
grouping-handler.group-timeout=\u30B0\u30EB\u30FC\u30D7\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u4F7F\u7528\u3059\u308B\u6642\u9593\u3002-1 \u306F\u6C38\u9060\u3092\u610F\u5473\u3057\u307E\u3059\u3002\u3053\u306E\u5F85\u6A5F\u6642\u9593\u304C\u7D4C\u904E\u3059\u308B\u3068\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u304C\u524A\u9664\u3055\u308C\u307E\u3059 (LOCAL \u30CF\u30F3\u30C9\u30E9\u30FC\u3068 REMOTE \u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u5BFE\u3057\u3066\u6709\u52B9)\u3002
grouping-handler.grouping-handler-address=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3078\u306E\u53C2\u7167\u3068\u30AF\u30E9\u30B9\u30BF\u30FC\u304C\u4F7F\u3046\u30A2\u30C9\u30EC\u30B9
grouping-handler.reaper-period=\u30B0\u30EB\u30FC\u30D7\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u30C1\u30A7\u30C3\u30AF\u3059\u308B\u305F\u3081\u306B reaper \u3092\u5B9F\u884C\u3059\u308B\u983B\u5EA6 (LOCAL \u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u5BFE\u3057\u3066\u306E\u307F\u6709\u52B9)\u3002
grouping-handler.remove=\u30B0\u30EB\u30FC\u30D7\u5316\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u524A\u9664\u64CD\u4F5C
grouping-handler.timeout=\u51E6\u7406\u6C7A\u5B9A\u3092\u4E0B\u3059\u307E\u3067\u306E\u5F85\u6A5F\u6642\u9593\u3002\u3053\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u6642\u9593\u306B\u9054\u3059\u308B\u3068\u9001\u4FE1\u4E2D\u306B\u4F8B\u5916\u304C\u767A\u884C\u3055\u308C\u3001\u53B3\u5BC6\u306A\u9806\u4F4D\u4ED8\u3051\u304C\u4FDD\u305F\u308C\u308B\u3088\u3046\u306B\u3057\u307E\u3059\u3002
grouping-handler.type=\u30CF\u30F3\u30C9\u30E9\u30FC\u304C\u51E6\u7406\u306E\u6C7A\u5B9A\u3092\u4E0B\u3059\u30AF\u30E9\u30B9\u30BF\u30FC\u3067\u5358\u4E00\u306E 'Local' \u30CF\u30F3\u30C9\u30E9\u30FC\u3067\u3042\u308B\u304B\u3001\u30ED\u30FC\u30AB\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u3068\u3084\u308A\u53D6\u308A\u3092\u884C\u3046 'Remote' \u30CF\u30F3\u30C9\u30E9\u30FC\u304B
grouping-handler=\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u3069\u306E\u30CE\u30FC\u30C9\u304C\u5272\u308A\u5F53\u3066\u6E08\u307F\u306E\u30B0\u30EB\u30FC\u30D7 id \u3092\u6301\u3064\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u51E6\u7406\u3059\u3079\u304D\u304B\u3001\u610F\u601D\u6C7A\u5B9A\u3092\u884C\u3044\u307E\u3059\u3002
ha-policy.add=\u3053\u306E ActiveMQ \u30B5\u30FC\u30D0\u30FC\u306E\u9AD8\u53EF\u7528\u6027\u3092\u8A2D\u5B9A\u3059\u308B\u305F\u3081\u306B HA \u30DD\u30EA\u30B7\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
ha-policy.allow-failback=\u5225\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u5F15\u304D\u7D99\u304E\u306E\u8981\u6C42\u3092\u884C\u3063\u305F\u5834\u5408\u306B\u30B5\u30FC\u30D0\u30FC\u3092\u81EA\u52D5\u7684\u306B\u505C\u6B62\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30E6\u30FC\u30B9\u30B1\u30FC\u30B9\u3067\u306F\u3001\u901A\u5E38\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u505C\u6B62\u3057\u3001\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u304C\u51E6\u7406\u3092\u5F15\u304D\u7D99\u304E\u3001\u5F8C\u3067\u30E1\u30A4\u30F3\u30B5\u30FC\u30D0\u30FC\u304C\u518D\u8D77\u52D5\u3057\u3001\u30B5\u30FC\u30D0\u30FC (\u524D\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7) \u304C\u51E6\u7406\u3092\u505C\u6B62\u3059\u308B\u3088\u3046\u8981\u6C42\u3057\u307E\u3059\u3002
ha-policy.backup-port-offset=\u65B0\u3057\u3044\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u3092\u4F5C\u6210\u3059\u308B\u3068\u304D\u306B\u30B3\u30CD\u30AF\u30BF\u30FC\u3068\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u306B\u4F7F\u7528\u3059\u308B\u30AA\u30D5\u30BB\u30C3\u30C8\u3002
ha-policy.backup-request-retries=\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u304C\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u306E\u8981\u6C42\u3092\u8A66\u884C\u3059\u308B\u56DE\u6570 (-1 \u306F\u7121\u5236\u9650)\u3002
ha-policy.backup-request-retry-interval=\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u306E\u8981\u6C42\u3092\u518D\u8A66\u884C\u3059\u308B\u9593\u9694 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002
ha-policy.check-for-live-server=\u8D77\u52D5\u6642\u306B\u540C\u3058\u30B5\u30FC\u30D0\u30FC ID \u3092\u4F7F\u7528\u3057\u3066\u5225\u306E\u30B5\u30FC\u30D0\u30FC\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u3092\u30C1\u30A7\u30C3\u30AF\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
ha-policy.cluster-name=\u30EC\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u4F7F\u7528\u3059\u308B\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u540D\u524D\u3002\u3053\u308C\u304C\u5B9A\u7FA9\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u8A2D\u5B9A\u3067\u6700\u521D\u306B\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306E\u540D\u524D\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
ha-policy.excluded-connectors=\u30DD\u30FC\u30C8\u30AA\u30D5\u30BB\u30C3\u30C8\u3092\u542B\u3081\u306A\u3044\u30B3\u30CD\u30AF\u30BF\u30FC\u3002
ha-policy.failover-on-server-shutdown=\u901A\u5E38\u306E\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u6642\u306B\u30B5\u30FC\u30D0\u30FC\u3092\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
ha-policy.group-name=\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u306F\u30B0\u30EB\u30FC\u30D7\u540D\u304C\u4E00\u81F4\u3059\u308B\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u3068\u306E\u307F\u30DA\u30A2\u3092\u5F62\u6210\u3057\u307E\u3059\u3002
ha-policy.initial-replication-sync-timeout=\u958B\u59CB\u30EC\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u540C\u671F\u3055\u308C\u308B\u307E\u3067\u5F85\u6A5F\u3059\u308B\u6642\u9593\u3002
ha-policy.max-backups=\u3053\u306E\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u304C\u4ED6\u306E\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u8981\u6C42\u3092\u53D7\u3051\u5165\u308C\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
ha-policy.max-saved-replicated-journal-size=\u3053\u308C\u306B\u3088\u308A\u3001\u8D77\u52D5\u6642\u306B\u30D5\u30A1\u30A4\u30EB\u3092\u79FB\u52D5\u3057\u305F\u5F8C\u306B\u3001\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3055\u308C\u305F\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u304C\u518D\u8D77\u52D5\u3067\u304D\u308B\u56DE\u6570\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B8\u30E3\u30FC\u30CA\u30EB\u30D5\u30A1\u30A4\u30EB\u306E\u6570\u304C\u3053\u306E\u6570\u306B\u306A\u308B\u3068\u3001\u30D5\u30A7\u30FC\u30EB\u30D0\u30C3\u30AF\u5F8C\u306B\u30B5\u30FC\u30D0\u30FC\u304C\u6C38\u4E45\u7684\u306B\u505C\u6B62\u3057\u307E\u3059\u3002
ha-policy.remove=HA \u30DD\u30EA\u30B7\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
ha-policy.request-backup=true \u306E\u5834\u5408\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u304C\u5225\u306E\u30CE\u30FC\u30C9\u3067\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3092\u8981\u6C42\u3057\u307E\u3059\u3002
ha-policy.restart-backup=\u30D5\u30A7\u30FC\u30EB\u30D0\u30C3\u30AF\u307E\u305F\u306F\u30B9\u30B1\u30FC\u30EA\u30F3\u30B0\u30C0\u30A6\u30F3\u306E\u305F\u3081\u30B5\u30FC\u30D0\u30FC\u304C\u505C\u6B62\u3057\u305F\u5834\u5408\u306B\u30B5\u30FC\u30D0\u30FC (\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7) \u304C\u518D\u8D77\u52D5\u3057\u307E\u3059\u3002
ha-policy.scale-down-cluster-name=\u30B9\u30B1\u30FC\u30EB\u30C0\u30A6\u30F3\u306B\u4F7F\u7528\u3055\u308C\u308B\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u540D\u524D\u3002
ha-policy.scale-down-connectors=\u30B9\u30B1\u30FC\u30EB\u30C0\u30A6\u30F3\u30AF\u30E9\u30B9\u30BF\u30FC\u3092\u5F62\u6210\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u30EA\u30B9\u30C8\u3002
ha-policy.scale-down-discovery-group=\u30B9\u30B1\u30FC\u30EB\u30C0\u30A6\u30F3\u30AF\u30E9\u30B9\u30BF\u30FC\u3092\u69CB\u7BC9\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u691C\u51FA\u30B0\u30EB\u30FC\u30D7\u306E\u540D\u524D
ha-policy.scale-down-group-name=\u30B9\u30B1\u30FC\u30EB\u30C0\u30A6\u30F3\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B0\u30EB\u30FC\u30D7\u306E\u540D\u524D\u3002
ha-policy.scale-down=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u30AF\u30EA\u30FC\u30F3\u306B\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3055\u308C\u305F\u3068\u304D\u306B\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u30B9\u30B1\u30FC\u30EB\u30C0\u30A6\u30F3\u306E\u5225\u306E\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u9001\u4FE1\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
ha-policy.synchronized-with-backup=\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u3068\u306E\u30EC\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u540C\u671F\u30D7\u30ED\u30BB\u30B9\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002
ha-policy.synchronized-with-live=\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u3068\u306E\u30EC\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u540C\u671F\u30D7\u30ED\u30BB\u30B9\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002
ha-policy=ActiveMQ \u30B5\u30FC\u30D0\u30FC\u306E\u9AD8\u53EF\u7528\u6027\u3092\u8A2D\u5B9A\u53EF\u80FD\u306B\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30EA\u30BD\u30FC\u30B9 (ha-policy \u306E\u5024\u306F\u3001live-only\u3001replication-master\u3001replication-slave\u3001replication-colocated\u3001shared-store-master\u3001shared-store-slave\u3001\u307E\u305F\u306F shared-store-colocated \u306B\u306A\u308A\u307E\u3059)\u3002
legacy-connection-factory=messaging-activemq \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306B\u63A5\u7D9A\u3059\u308B\u305F\u3081\u306B\u30EC\u30AC\u30B7\u30FC HornetQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u30EA\u30BD\u30FC\u30B9\u3002
messaging-activemq.global-client-scheduled-thread-pool-keepalive-time=\u30A2\u30A4\u30C9\u30EB\u6642\u306B\u30D7\u30FC\u30EB\u30B9\u30EC\u30C3\u30C9\u3092\u7A3C\u50CD\u3057\u7D9A\u3051\u308B\u671F\u9593\u3002
messaging-activemq.global-client-scheduled-thread-pool-max-size=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u5185\u3067\u7A3C\u50CD\u4E2D\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u4F7F\u7528\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u306E\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B5\u30A4\u30BA\u3002\u3053\u306E\u5C5E\u6027\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408 (\u30C7\u30D5\u30A9\u30EB\u30C8)\u3001\u5229\u7528\u53EF\u80FD\u306A\u30D7\u30ED\u30BB\u30C3\u30B5\u30FC\u306E\u6570\u306E 8 \u500D\u306B\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
messaging-activemq.global-client-scheduled-thread-pool-active-count=\u30A2\u30AF\u30C6\u30A3\u30D6\u306B\u30BF\u30B9\u30AF\u3092\u5B9F\u884C\u3057\u3066\u3044\u308B \u3059\u3079\u3066\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u306E\u6982\u6570\u3002
messaging-activemq.global-client-scheduled-thread-pool-completed-task-count=\u3059\u3079\u3066\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u305F\u30BF\u30B9\u30AF\u306E\u6982\u6570\u3002
messaging-activemq.global-client-scheduled-thread-pool-current-thread-count=\u3059\u3079\u3066\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30FC\u30EB\u306E\u73FE\u5728\u306E\u30B9\u30EC\u30C3\u30C9\u6570\u3002
messaging-activemq.global-client-scheduled-thread-pool-largest-thread-count=\u3059\u3079\u3066\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30FC\u30EB\u3067\u540C\u6642\u306B\u5B58\u5728\u3057\u305F\u30B9\u30EC\u30C3\u30C9\u306E\u6700\u5927\u6570\u3002
messaging-activemq.global-client-scheduled-thread-pool-task-count=\u3059\u3079\u3066\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30BF\u30B9\u30AF\u306E\u6982\u7B97\u7DCF\u6570
messaging-activemq.global-client-thread-pool-keepalive-time=\u30A2\u30A4\u30C9\u30EB\u6642\u306B\u30D7\u30FC\u30EB\u30B9\u30EC\u30C3\u30C9\u3092\u7A3C\u50CD\u3057\u7D9A\u3051\u308B\u671F\u9593\u3002
messaging-activemq.global-client-thread-pool-max-size=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u5185\u3067\u7A3C\u50CD\u4E2D\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u4F7F\u7528\u3059\u308B\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u306E\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B5\u30A4\u30BA\u3002
messaging-activemq.global-client-thread-pool-active-count=\u30A2\u30AF\u30C6\u30A3\u30D6\u306B\u30BF\u30B9\u30AF\u3092\u5B9F\u884C\u3057\u3066\u3044\u308B \u3059\u3079\u3066\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u306E\u6982\u6570\u3002
messaging-activemq.global-client-thread-pool-completed-task-count=\u3059\u3079\u3066\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u305F\u30BF\u30B9\u30AF\u306E\u6982\u6570\u3002
messaging-activemq.global-client-thread-pool-current-thread-count=\u3059\u3079\u3066\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30FC\u30EB\u306E\u73FE\u5728\u306E\u30B9\u30EC\u30C3\u30C9\u6570\u3002
messaging-activemq.global-client-thread-pool-largest-thread-count=\u3059\u3079\u3066\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30FC\u30EB\u3067\u540C\u6642\u306B\u5B58\u5728\u3057\u305F\u30B9\u30EC\u30C3\u30C9\u306E\u6700\u5927\u6570\u3002
messaging-activemq.global-client-thread-pool-task-count=\u3059\u3079\u3066\u306E ActiveMQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30BF\u30B9\u30AF\u306E\u6982\u7B97\u7DCF\u6570
server.active=\u30B5\u30FC\u30D0\u30FC\u304C\u30A2\u30AF\u30C6\u30A3\u30D6 (\u63A5\u7D9A\u3092\u8A31\u53EF\u3059\u308B) \u307E\u305F\u306F\u30D1\u30C3\u30B7\u30D6 (\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30E2\u30FC\u30C9\u3067\u3001\u30D5\u30A7\u30A4\u30EB\u30AA\u30FC\u30D0\u30FC\u5F85\u3061) \u3067\u3042\u308B\u304B\u3069\u3046\u304B\u3002
server.add=ActiveMQ \u30B5\u30FC\u30D0\u30FC\u3092\u8FFD\u52A0\u3059\u308B\u64CD\u4F5C\u3002
server.allow-failback=\u5143\u306E\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u304C\u5FA9\u6D3B\u3057\u305F\u5834\u5408\u3001\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u81EA\u52D5\u3067\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3059\u308B\u304B\u3069\u3046\u304B
server.async-connection-execution-enabled=\u30B5\u30FC\u30D0\u30FC\u306E\u53D7\u4FE1\u30D1\u30B1\u30C3\u30C8\u304C\u51E6\u7406\u306E\u305F\u3081\u306B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u304B\u3089\u30B9\u30EC\u30C3\u30C9\u306E 1 \u3064\u306B\u79FB\u52D5\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30B9\u30EC\u30C3\u30C9\u3067\u51E6\u7406\u3057\u305F\u307B\u3046\u304C\u3044\u3044\u5834\u5408\u306F false\u3002
server.backup-group-name=\u304A\u4E92\u3044\u3092\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3059\u308B\u30E9\u30A4\u30D6\u3068\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u306E\u30BB\u30C3\u30C8\u306E\u540D\u524D\u3002
server.backup=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u304B\u3069\u3046\u304B
server.check-for-live-server=\u540C\u3058\u30CE\u30FC\u30C9 ID \u3092\u6301\u3064\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u304C\u3059\u3067\u306B\u5B58\u5728\u3059\u308B\u304B\u78BA\u8A8D\u3059\u308B\u305F\u3081\u3001\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3055\u308C\u305F\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u304C\u73FE\u5728\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u3092\u30C1\u30A7\u30C3\u30AF\u3059\u308B\u3079\u304D\u3067\u3042\u308B\u304B\u3002
server.close-connections-for-address.ip-address=\u6587\u5B57\u5217\u5F62\u5F0F\u306E IP \u30A2\u30C9\u30EC\u30B9
server.close-connections-for-address.reply=\u63A5\u7D9A\u306E\u3044\u305A\u308C\u304B\u304C\u9589\u3058\u3089\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u308C\u4EE5\u5916\u306E\u5834\u5408\u306F false\u3002
server.close-connections-for-address=\u30EA\u30E2\u30FC\u30C8\u30A2\u30C9\u30EC\u30B9\u306B\u6307\u5B9A\u306E IP \u30A2\u30C9\u30EC\u30B9\u3092\u542B\u3080\u30B5\u30FC\u30D0\u30FC\u306B\u63A5\u7D9A\u3057\u3066\u3044\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u63A5\u7D9A\u3092\u3059\u3079\u3066\u9589\u3058\u307E\u3059\u3002
server.close-connections-for-user=\u6307\u5B9A\u3055\u308C\u305F\u30E6\u30FC\u30B6\u30FC\u540D\u3067\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u63A5\u7D9A\u3057\u305F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u3059\u3079\u3066\u306E\u63A5\u7D9A\u3092\u9589\u3058\u307E\u3059\u3002
server.close-connections-for-user.reply=\u63A5\u7D9A\u306E\u3044\u305A\u308C\u304B\u304C\u9589\u3058\u3089\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u308C\u4EE5\u5916\u306E\u5834\u5408\u306F false\u3002
server.close-connections-for-user.user=\u30E6\u30FC\u30B6\u30FC\u540D\u3002
server.close-consumer-connections-for-address=\u6307\u5B9A\u3055\u308C\u305F\u30A2\u30C9\u30EC\u30B9\u306B\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u305F\u30AD\u30E5\u30FC\u304B\u3089\u6D88\u8CBB\u3059\u308B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u3059\u3079\u3066\u306E\u63A5\u7D9A\u3092\u9589\u3058\u307E\u3059\u3002
server.close-consumer-connections-for-address.reply=\u63A5\u7D9A\u306E\u3044\u305A\u308C\u304B\u304C\u9589\u3058\u3089\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u308C\u4EE5\u5916\u306E\u5834\u5408\u306F false\u3002
server.close-consumer-connections-for-address.address-match=\u4E00\u81F4\u3059\u308B ActiveMQ \u30A2\u30C9\u30EC\u30B9\u3002
server.cluster-password=\u30AF\u30E9\u30B9\u30BF\u30FC\u5316\u30CE\u30FC\u30C9\u306E\u9593\u3067\u901A\u4FE1\u3092\u884C\u3046\u305F\u3081\u306B\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3067\u5229\u7528\u3059\u308B\u30D1\u30B9\u30EF\u30FC\u30C9
server.cluster-user=\u30AF\u30E9\u30B9\u30BF\u30FC\u5316\u30CE\u30FC\u30C9\u306E\u9593\u3067\u901A\u4FE1\u3092\u884C\u3046\u305F\u3081\u306B\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3067\u5229\u7528\u3059\u308B\u30E6\u30FC\u30B6\u30FC
server.cluster-credential-reference=\u30AF\u30E9\u30B9\u30BF\u30FC\u3078\u8A8D\u8A3C\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB (\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304B\u3089\u306E)
server.cluster-credential-reference.store=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3078\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D
server.cluster-credential-reference.type=\u3053\u306E\u53C2\u7167\u304C\u610F\u5473\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30BF\u30A4\u30D7
server.cluster-credential-reference.alias=\u4FDD\u5B58\u3055\u308C\u305F\u79D8\u5BC6\u307E\u305F\u306F\u30B9\u30C8\u30A2\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u610F\u5473\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9
server.cluster-credential-reference.clear-text=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u79D8\u5BC6 (\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB/ \u79D8\u5BC6\u3092\u30B5\u30FC\u30D3\u30B9\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044)
server.clustered.deprecated=\u30AF\u30E9\u30B9\u30BF\u30FC\u5316\u3055\u308C\u305F ActiveMQ \u30B5\u30FC\u30D0\u30FC\u3092\u4F5C\u6210\u3059\u308B\u306B\u306F\u3001\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3092 1 \u3064\u4EE5\u4E0A\u5B9A\u7FA9\u3057\u307E\u3059\u3002
server.clustered=\u30B5\u30FC\u30D0\u30FC\u304C\u30AF\u30E9\u30B9\u30BF\u30FC\u5316\u3055\u308C\u3066\u3044\u308B\u304B\u3069\u3046\u304B
server.commit-prepared-transaction.reply=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u6B63\u5E38\u306B\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u305F\u5834\u5408\u306F True\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false\u3002
server.commit-prepared-transaction.transaction-as-base-64=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 XID \u306E Base64 \u8868\u73FE
server.commit-prepared-transaction=\u6E96\u5099\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306B\u30B3\u30DF\u30C3\u30C8\u3057\u307E\u3059\u3002
server.connection-ttl-override=\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001ping \u306E\u53D7\u4FE1\u306A\u3057\u306B\u63A5\u7D9A\u3092\u4FDD\u6301\u3059\u308B\u6642\u9593 (\u30DF\u30EA\u79D2) \u3092\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3057\u307E\u3059\u3002
server.create-bindings-dir=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u8D77\u52D5\u6642\u306B bindings \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3059\u308B\u3079\u304D\u304B\u3069\u3046\u304B
server.create-journal-dir=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u8D77\u52D5\u6642\u306B journal \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3059\u308B\u3079\u304D\u304B\u3069\u3046\u304B
server.disk-scan-period=\u4F7F\u7528\u7387\u306E\u305F\u3081\u306B\u30C7\u30A3\u30B9\u30AF\u304C\u30B9\u30AD\u30E3\u30F3\u3055\u308C\u308B\u9593\u9694\u3002
server.export-journal=XML \u30D5\u30A1\u30A4\u30EB\u3078\u306E\u30B8\u30E3\u30FC\u30CA\u30EB\u306E\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8
server.failback-delay=\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u3067\u30D5\u30A7\u30FC\u30EB\u30D0\u30C3\u30AF\u304C\u767A\u751F\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3059\u308B\u6642\u9593
server.failover-on-shutdown=\u3053\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u304C\u901A\u5E38\u306E\u30B5\u30FC\u30D0\u30FC\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u6642\u306B\u30E9\u30A4\u30D6\u3068\u306A\u308B\u3079\u304D\u304B (\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u306E\u5834\u5408)
server.force-failover=\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30FC\u30D0\u30FC\u3092\u5F37\u5236\u7D42\u4E86\u3057\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u306E\u901A\u77E5\u3092\u51FA\u3057\u307E\u3059\u3002
server.get-address-settings-as-json.address-match=\u30A2\u30C9\u30EC\u30B9\u30DE\u30C3\u30C1
server.get-address-settings-as-json.reply=\u30A2\u30C9\u30EC\u30B9\u8A2D\u5B9A\u8A73\u7D30\u306E\u30A2\u30EC\u30A4\u3092\u542B\u3080 JSON \u6587\u5B57\u5217\u3002
server.get-address-settings-as-json=\u3042\u308B\u30A2\u30C9\u30EC\u30B9\u30DE\u30C3\u30C1\u306B\u5BFE\u3057\u3001JSON \u6587\u5B57\u5217\u3068\u3057\u3066\u30A2\u30C9\u30EC\u30B9\u8A2D\u5B9A\u3092\u8FD4\u3057\u307E\u3059\u3002
server.get-connectors-as-json.reply=\u30B3\u30CD\u30AF\u30BF\u30FC\u60C5\u5831\u3092\u542B\u3080 JSON \u6587\u5B57\u5217\u3002
server.get-connectors-as-json=\u30B3\u30CD\u30AF\u30BF\u30FC\u60C5\u5831\u3092\u542B\u3080 JSON \u6587\u5B57\u5217\u3067\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u8A2D\u5B9A\u3055\u308C\u305F\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u8FD4\u3057\u307E\u3059\u3002
server.get-last-sent-message-id.address-name=\u30A2\u30C9\u30EC\u30B9\u306E\u540D\u524D\u3002
server.get-last-sent-message-id.reply=\u30E1\u30C3\u30BB\u30FC\u30B8 id
server.get-last-sent-message-id.session-id=\u30BB\u30C3\u30B7\u30E7\u30F3 id
server.get-last-sent-message-id=\u6307\u5B9A\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u304B\u3089\u6307\u5B9A\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3057\u305F\u6700\u5F8C\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E ID \u3092\u8FD4\u3057\u307E\u3059\u3002
server.get-roles-as-json.address-match=\u30A2\u30C9\u30EC\u30B9\u30DE\u30C3\u30C1
server.get-roles-as-json.reply=\u30EA\u30B9\u30C8\u3092\u542B\u3080 JSON \u6587\u5B57\u5217\u3002\u5404\u8981\u7D20\u306F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u3092\u5B9A\u7FA9\u3059\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30BB\u30C3\u30C8\u3067\u3059\u3002
server.get-roles-as-json=\u4E00\u81F4\u3059\u308B\u7279\u5B9A\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u95A2\u3059\u308B\u30ED\u30FC\u30EB (JSON \u6587\u5B57\u5217\u3068\u3057\u3066) \u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
server.get-roles.address-match=\u30A2\u30C9\u30EC\u30B9\u30DE\u30C3\u30C1
server.get-roles.consume=\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u304B\u3089\u6D88\u8CBB\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
server.get-roles.create-durable-queue=\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u306E\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u4F5C\u6210\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
server.get-roles.create-non-durable-queue=\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u306E\u975E\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u4F5C\u6210\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
server.get-roles.delete-durable-queue=\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u306E\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u524A\u9664\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
server.get-roles.delete-non-durable-queue=\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u306E\u975E\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u524A\u9664\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
server.get-roles.manage=\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u3092\u7BA1\u7406\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
server.get-roles.name=\u30ED\u30FC\u30EB\u306E\u540D\u524D\u3002
server.get-roles.reply=\u5404\u8981\u7D20\u306E\u4E00\u89A7\u3002\u5404\u8981\u7D20\u306F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u306B\u3064\u3044\u3066\u8AAC\u660E\u3059\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30BB\u30C3\u30C8\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
server.get-roles.send=\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30EB\u304C\u6301\u3064\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
server.get-roles=\u7279\u5B9A\u306E\u30A2\u30C9\u30EC\u30B9\u30DE\u30C3\u30C1\u306B\u95A2\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
server.get-session-creation-time.reply=\u30A8\u30DD\u30C3\u30AF\u304B\u3089\u306E\u4F5C\u6210\u6642\u9593\u3002\u30DF\u30EA\u79D2\u6570\u3092\u8868\u793A\u3059\u308B\u6587\u5B57\u5217\u3068\u3057\u3066\u8868\u793A\u3057\u307E\u3059\u3002
server.get-session-creation-time.session-id=\u30BB\u30C3\u30B7\u30E7\u30F3 id
server.get-session-creation-time=\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u4F5C\u6210\u6642\u9593\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
server.global-max-disk-usage=\u30C7\u30A3\u30B9\u30AF\u304B\u3089\u4F7F\u7528\u3059\u308B\u30C7\u30FC\u30BF\u306E\u6700\u5927\u7387 (\u30D1\u30FC\u30BB\u30F3\u30C8)\u3002\u30C7\u30A3\u30B9\u30AF\u304C\u6E80\u676F\u306E\u9593\u306F\u30B7\u30B9\u30C6\u30E0\u304C\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u307E\u3059\u3002
server.global-max-memory-size=\u30E1\u30C3\u30BB\u30FC\u30B8\u30C7\u30FC\u30BF\u304C\u6D88\u8CBB\u3067\u304D\u308B\u6700\u5927\u30E1\u30E2\u30EA\u30FC\u91CF\u3002
server.id-cache-size=\u30E1\u30C3\u30BB\u30FC\u30B8 ID \u4F5C\u6210\u524D\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B5\u30A4\u30BA
server.import-journal=\u30B8\u30E3\u30FC\u30CA\u30EB\u3078\u306E XML \u30D5\u30A1\u30A4\u30EB\u306E\u30A4\u30F3\u30DD\u30FC\u30C8
server.import-journal.file=\u30B8\u30E3\u30FC\u30CA\u30EB\u306B\u30A4\u30F3\u30DD\u30FC\u30C8\u3059\u308B XML \u30D5\u30A1\u30A4\u30EB
server.import-journal.legacy-prefixes=\u30EC\u30AC\u30B7\u30FC (Artemis 1.x) \u30A4\u30F3\u30DD\u30FC\u30C8\u304B\u3089\u63A5\u982D\u8F9E\u3092\u524A\u9664\u3057\u306A\u3044
server.incoming-interceptors=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u53D7\u4FE1\u30A4\u30F3\u30BF\u30FC\u30BB\u30D7\u30BF\u30FC\u30AF\u30E9\u30B9\u306E\u30EA\u30B9\u30C8\u3002
server.incoming-interceptors.name=\u30A4\u30F3\u30BF\u30FC\u30BB\u30D7\u30BF\u30FC\u30AF\u30E9\u30B9\u306E\u540D\u524D\u3002
server.incoming-interceptors.module=\u30A4\u30F3\u30BF\u30FC\u30BB\u30D7\u30BF\u30FC\u30AF\u30E9\u30B9\u3092\u63D0\u4F9B\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D\u3002
server.jmx-domain=MBeanServer \u306B\u5185\u90E8 ActiveMQ MBean \u3092\u767B\u9332\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3059\u308B JMX \u30C9\u30E1\u30A4\u30F3\u3002
server.jmx-management-enabled=ActiveMQ \u304C\u5185\u90E8\u7BA1\u7406 API \u3092 JMX \u7D4C\u7531\u3067\u516C\u958B\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u308C\u3089\u306E MBean \u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u3068\u8A2D\u5B9A\u306B\u4E00\u8CAB\u6027\u304C\u306A\u304F\u306A\u308B\u53EF\u80FD\u6027\u304C\u3042\u308B\u305F\u3081\u304A\u52E7\u3081\u3057\u3066\u3044\u307E\u305B\u3093\u3002
server.journal-bindings-table=\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u4FDD\u5B58\u3059\u308B JDBC \u30C6\u30FC\u30D6\u30EB\u306E\u540D\u524D
server.journal-jms-bindings-table=JMS \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u4FDD\u5B58\u3059\u308B JDBC \u30C6\u30FC\u30D6\u30EB\u306E\u540D\u524D\u3002
server.journal-jms-bindings-table.deprecated=Artemis 2 \u306F JMS \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u305D\u306E\u30B8\u30E3\u30FC\u30CA\u30EB\u306B\u683C\u7D0D\u3057\u306A\u3044\u3088\u3046\u306B\u306A\u308A\u307E\u3057\u305F\u3002
server.journal-buffer-size=\u30B8\u30E3\u30FC\u30CA\u30EB\u4E0A\u306E\u5185\u90E8\u30D0\u30C3\u30D5\u30A1\u30FC\u30B5\u30A4\u30BA
server.journal-buffer-timeout=\u30B8\u30E3\u30FC\u30CA\u30EB\u3067\u5185\u90E8\u30D0\u30C3\u30D5\u30A1\u30FC\u3092\u30D5\u30E9\u30C3\u30B7\u30E5\u3059\u308B\u306E\u306B\u5229\u7528\u3059\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u30CA\u30CE\u79D2)
server.journal-compact-min-files=\u5727\u7E2E\u958B\u59CB\u524D\u306E\u30B8\u30E3\u30FC\u30CA\u30EB\u30C7\u30FC\u30BF\u30D5\u30A1\u30A4\u30EB\u6700\u5C0F\u6570
server.journal-compact-percentage=\u30B8\u30E3\u30FC\u30CA\u30EB\u306E\u5727\u7E2E\u3092\u691C\u8A0E\u3059\u308B\u30E9\u30A4\u30D6\u30C7\u30FC\u30BF\u306E\u5272\u5408
server.journal-datasource=JDBC \u30B9\u30C8\u30A2\u306E DataSource \u306E\u540D\u524D
server.journal-database=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u30BF\u30A4\u30D7 (SQL \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306E\u30AB\u30B9\u30BF\u30DE\u30A4\u30BA\u306B\u4F7F\u7528\u53EF\u80FD)\u3002\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3055\u308C\u306A\u3044\u5834\u5408\u306F\u3001DataSource \u30E1\u30BF\u30C7\u30FC\u30BF\u306B\u57FA\u3065\u3044\u3066\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u30BF\u30A4\u30D7\u304C\u5224\u65AD\u3055\u308C\u307E\u3059\u3002
server.journal-file-size=\u5404\u30B8\u30E3\u30FC\u30CA\u30EB\u30D5\u30A1\u30A4\u30EB\u306E\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8)
server.journal-jdbc-lock-expiration=\u5B58\u7D9A\u3057\u306A\u304F\u3066\u3082 HA \u30ED\u30C3\u30AF\u304C\u6709\u52B9\u3067\u3042\u308B\u3068\u898B\u306A\u3055\u308C\u308B\u6642\u9593\u3002
server.journal-jdbc-lock-renew-period=HA \u30ED\u30C3\u30AF\u3092\u5B58\u7D9A\u3059\u308B\u305F\u3081\u306E\u66F4\u65B0\u671F\u9593\u3002
server.journal-jdbc-network-timeout=\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u554F\u984C\u306E\u691C\u51FA\u3059\u308B\u305F\u3081\u306B JDBC \u63A5\u7D9A\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002
server.journal-large-messages-table=\u5927\u898F\u6A21\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u4FDD\u5B58\u3059\u308B JDBC \u30C6\u30FC\u30D6\u30EB\u306E\u540D\u524D
server.journal-max-io=\u3044\u3064\u3067\u3082 AIO \u30AD\u30E5\u30FC\u306B\u5165\u308C\u308B\u3053\u3068\u306E\u53EF\u80FD\u306A\u66F8\u304D\u8FBC\u307F\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6700\u5927\u6570
server.journal-messages-table=\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u4FDD\u5B58\u3059\u308B JDBC \u30C6\u30FC\u30D6\u30EB\u306E\u540D\u524D
server.journal-min-files=\u4E8B\u524D\u306B\u4F5C\u6210\u3059\u3079\u304D\u30B8\u30E3\u30FC\u30CA\u30EB\u30D5\u30A1\u30A4\u30EB\u306E\u6570
server.journal-node-manager-store-table=\u30CE\u30FC\u30C9\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u3092\u683C\u7D0D\u3059\u308B JDBC \u30C6\u30FC\u30D6\u30EB\u306E\u540D\u524D\u3002
server.journal-page-store-table=\u30DA\u30FC\u30B8\u3092\u4FDD\u5B58\u3059\u308B JDBC \u30C6\u30FC\u30D6\u30EB\u306E\u540D\u524D\u3002
server.journal-pool-files=\u518D\u5229\u7528\u53EF\u80FD\u306A\u30B8\u30E3\u30FC\u30CA\u30EB\u30D5\u30A1\u30A4\u30EB\u306E\u6570\u3002ActiveMQ \u306F\u5FC5\u8981\u306A\u6570\u306E\u30D5\u30A1\u30A4\u30EB\u3092\u4F5C\u88FD\u3067\u304D\u307E\u3059\u3002\u305F\u3060\u3057\u3001\u30D5\u30A1\u30A4\u30EB\u3092\u56DE\u53CE\u3059\u308B\u5834\u5408\u306F\u3001\u305D\u306E\u5024\u306B\u524A\u6E1B\u3055\u308C\u307E\u3059 (-1 \u306F\u7121\u5236\u9650)\u3002
server.journal-file-open-timeout=\u30B8\u30E3\u30FC\u30CA\u30EB\u30D5\u30A1\u30A4\u30EB\u3092\u958B\u304F\u3068\u304D\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u5024 (\u79D2\u5358\u4F4D)\u3002\u5024\u304C 0 \u4EE5\u4E0B\u306E\u5834\u5408\u306F\u5373\u5EA7\u306B\u5931\u6557\u3057\u307E\u3059\u3002
server.journal-sync-non-transactional=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u8FD4\u3059\u307E\u3067\u3001\u975E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30C7\u30FC\u30BF\u304C\u30B8\u30E3\u30FC\u30CA\u30EB\u3078\u3068\u540C\u671F\u3059\u308B\u306E\u3092\u5F85\u3064\u304B\u3069\u3046\u304B
server.journal-sync-transactional=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u8FD4\u3059\u307E\u3067\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30C7\u30FC\u30BF\u304C\u30B8\u30E3\u30FC\u30CA\u30EB\u3078\u3068\u540C\u671F\u3059\u308B\u306E\u3092\u5F85\u3064\u304B\u3069\u3046\u304B
server.journal-type=\u5229\u7528\u3059\u308B\u30B8\u30E3\u30FC\u30CA\u30EB\u306E\u30BF\u30A4\u30D7
server.list-all-consumers-as-json.reply=JMSConsumerInfo \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30A2\u30EC\u30A4\u3092\u542B\u3080 JSON \u6587\u5B57\u5217\u3002
server.list-all-consumers-as-json=\u5168\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3092\u4E00\u89A7\u8868\u793A
server.list-connection-ids.reply=\u5404\u6587\u5B57\u5217\u304C\u63A5\u7D9A ID \u3068\u306A\u3063\u3066\u3044\u308B\u6587\u5B57\u5217\u4E00\u89A7
server.list-connection-ids=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u63A5\u7D9A\u3059\u308B\u63A5\u7D9A ID \u3059\u3079\u3066\u3092\u4E00\u89A7\u8868\u793A
server.list-connections-as-json.reply=JMSConnectionInfo \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30A2\u30EC\u30A4\u3092\u542B\u3080 JSON \u6587\u5B57\u5217\u3002
server.list-connections-as-json=JMS \u63A5\u7D9A\u3092\u3059\u3079\u3066\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
server.list-consumers-as-json.connection-id=\u63A5\u7D9A id
server.list-consumers-as-json.reply=JMSConsumerInfo \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30A2\u30EC\u30A4\u3092\u542B\u3080 JSON \u6587\u5B57\u5217\u3002
server.list-consumers-as-json=connection-id \u3067\u6307\u5B9A\u3055\u308C\u305F JMS \u63A5\u7D9A\u306B\u5C5E\u3059\u308B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3092\u3059\u3079\u3066\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
server.list-heuristic-committed-transactions.reply=\u6587\u5B57\u5217\u4E00\u89A7\u3002\u6587\u5B57\u5217\u306F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 XID \u306E Base-64 \u8868\u73FE\u3067\u3059\u3002
server.list-heuristic-committed-transactions=\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306B\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u4E00\u89A7\u8868\u793A
server.list-heuristic-rolled-back-transactions.reply=\u6587\u5B57\u5217\u4E00\u89A7\u3002\u6587\u5B57\u5217\u306F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 XID \u306E Base-64 \u8868\u73FE\u3067\u3059\u3002
server.list-heuristic-rolled-back-transactions=\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306B\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u4E00\u89A7\u8868\u793A
server.list-prepared-transaction-details-as-html.reply=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u8A73\u7D30\u306E\u30C6\u30FC\u30D6\u30EB\u3092\u542B\u3080 HTML \u6587\u5B57\u5217\u3002
server.list-prepared-transaction-details-as-html=\u6E96\u5099\u306E\u3067\u304D\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u3001\u65E5\u4ED8\u5225\u306B\u5206\u985E\u3057\u6700\u3082\u53E4\u3044\u3082\u306E\u304B\u3089\u9806\u756A\u306B HTML \u5F62\u5F0F\u3067\u8A73\u7D30\u3068\u3068\u3082\u306B\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
server.list-prepared-transaction-details-as-json.reply=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u8A73\u7D30\u306E\u30A2\u30EC\u30A4\u3092\u542B\u3080 JSON \u6587\u5B57\u5217\u3002
server.list-prepared-transaction-details-as-json=\u6E96\u5099\u306E\u3067\u304D\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u3001\u65E5\u4ED8\u5225\u306B\u5206\u985E\u3057\u6700\u3082\u53E4\u3044\u3082\u306E\u304B\u3089\u9806\u756A\u306B JSON \u5F62\u5F0F\u3067\u8A73\u7D30\u3068\u3068\u3082\u306B\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
server.list-prepared-transaction-jms-details-as-html.reply=\u8FD4\u3055\u308C\u305F\u6587\u5B57\u5217\u306F HTML \u6587\u5B57\u5217\u3067\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u8A73\u7D30\u306E\u30C6\u30FC\u30D6\u30EB\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
server.list-prepared-transaction-jms-details-as-html=\u6E96\u5099\u306E\u3067\u304D\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u3001\u65E5\u4ED8\u5225\u306B\u5206\u985E\u3057\u6700\u3082\u53E4\u3044\u3082\u306E\u304B\u3089\u9806\u756A\u306B HTML \u5F62\u5F0F\u3067\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
server.list-prepared-transaction-jms-details-as-json.reply=\u8FD4\u3055\u308C\u305F\u6587\u5B57\u5217\u306F JSON \u6587\u5B57\u5217\u3067\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u8A73\u7D30\u306E\u30A2\u30EC\u30A4\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
server.list-prepared-transaction-jms-details-as-json=\u6E96\u5099\u306E\u3067\u304D\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u3001\u65E5\u4ED8\u5225\u306B\u5206\u985E\u3057\u6700\u3082\u53E4\u3044\u3082\u306E\u304B\u3089\u9806\u756A\u306B JSON \u5F62\u5F0F\u3067\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
server.list-prepared-transactions.reply=\u6587\u5B57\u5217\u4E00\u89A7\u3002\u6587\u5B57\u5217\u306F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 XID \u306E Base-64 \u8868\u73FE\u3067\u3001\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306B\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30B3\u30DF\u30C3\u30C8\u3042\u308B\u3044\u306F\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3059\u308B\u969B\u306B\u5229\u7528\u53EF\u80FD\u3067\u3059\u3002
server.list-prepared-transactions=\u6E96\u5099\u306E\u3067\u304D\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u3001\u65E5\u4ED8\u5225\u306B\u5206\u985E\u3057\u6700\u3082\u53E4\u3044\u3082\u306E\u304B\u3089\u9806\u756A\u306B\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
server.list-producers-info-as-json.reply=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u8A73\u7D30\u306E\u30A2\u30EC\u30A4\u3092\u542B\u3080 JSON \u6587\u5B57\u5217\u3002
server.list-producers-info-as-json=\u5168\u30BB\u30C3\u30B7\u30E7\u30F3\u306B\u5BFE\u3057\u3066\u3001JSON \u30B7\u30EA\u30A2\u30EB\u5316\u3092\u4F7F\u3044\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306B\u95A2\u3059\u308B\u60C5\u5831\u3092\u4E00\u89A7\u8868\u793A
server.list-remote-addresses.ip-address=\u6587\u5B57\u5217\u5F62\u5F0F\u306E IP \u30A2\u30C9\u30EC\u30B9
server.list-remote-addresses.reply=\u6587\u5B57\u5217\u304C\u30EA\u30E2\u30FC\u30C8\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30A2\u30C9\u30EC\u30B9\u3068\u306A\u3063\u3066\u3044\u308B\u3001\u6587\u5B57\u5217\u306E\u4E00\u89A7
server.list-remote-addresses=\u6307\u5B9A\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u63A5\u7D9A\u3057\u305F\u5168\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30A2\u30C9\u30EC\u30B9\u3092\u4E00\u89A7\u8868\u793A\u3002ip-address \u306E\u5F15\u6570\u304C\u63D0\u793A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u30EA\u30E2\u30FC\u30C8\u30A2\u30C9\u30EC\u30B9\u306E\u6587\u5B57\u5217\u306B ip-address \u306E\u6587\u5B57\u5217\u3092\u542B\u3080\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u307F\u3092\u8FD4\u3057\u307E\u3059\u3002
server.list-sessions-as-json.connection-id=\u63A5\u7D9A id
server.list-sessions-as-json.reply=\u30BB\u30C3\u30B7\u30E7\u30F3 id \u306E\u30A2\u30EC\u30A4\u3092\u542B\u3080 JSON \u6587\u5B57\u5217\u3002
server.list-sessions-as-json=\u6307\u5B9A\u3055\u308C\u305F\u63A5\u7D9A ID \u306E\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u3092\u3059\u3079\u3066\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
server.list-sessions.connection-id=\u63A5\u7D9A id
server.list-sessions.reply=\u5404\u6587\u5B57\u5217\u304C\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u3068\u306A\u3063\u3066\u3044\u308B\u6587\u5B57\u5217\u4E00\u89A7
server.list-sessions=\u6307\u5B9A\u306E\u63A5\u7D9A ID \u306E\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
server.list-target-destinations.reply=\u30A2\u30C9\u30EC\u30B9\u540D\u306E\u30A2\u30EC\u30A4\u3092\u542B\u3080 JSON \u6587\u5B57\u5217\u3002
server.list-target-destinations.session-id=\u30BB\u30C3\u30B7\u30E7\u30F3 id
server.list-target-destinations=\u6307\u5B9A\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u9001\u4FE1\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
server.live-connector-ref.deprecated=\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u5F71\u97FF\u306F\u306A\u304F\u3001\u3053\u306E\u5C5E\u6027\u306E\u5024\u3092\u8A2D\u5B9A\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u8B66\u544A\u304C\u51FA\u3055\u308C\u307E\u3059\u3002
server.live-connector-ref=\u30E9\u30A4\u30D6\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u3078\u63A5\u7D9A\u3059\u308B\u305F\u3081\u306B\u5229\u7528\u3059\u308B\u30B3\u30CD\u30AF\u30BF\u30FC\u540D\u3002\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u975E\u5171\u6709\u578B\u306EHA \u3092\u4F7F\u3046\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3067\u306A\u3044\u5834\u5408\u3001\u305D\u306E\u5024\u306F "undefined" \u3068\u3057\u307E\u3059\u3002
server.log-journal-write-rate=\u5B9A\u671F\u7684\u306B\u30B8\u30E3\u30FC\u30CA\u30EB\u306E\u66F8\u304D\u8FBC\u307F\u30EC\u30FC\u30C8\u3068\u30D5\u30E9\u30C3\u30B7\u30E5\u30EC\u30FC\u30C8\u3092\u30ED\u30B0\u3059\u308B\u304B\u3069\u3046\u304B
server.management-address=\u7BA1\u7406\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u30A2\u30C9\u30EC\u30B9
server.management-notification-address=\u7BA1\u7406\u901A\u77E5\u3092\u53D7\u4FE1\u3059\u308B\u305F\u3081\u306B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u540D
server.max-saved-replicated-journal-size=\u30D5\u30A7\u30A4\u30EB\u30D0\u30C3\u30AF\u306E\u767A\u751F\u5F8C\u306B\u4FDD\u6301\u3059\u308B\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B8\u30E3\u30FC\u30CA\u30EB\u306E\u6700\u5927\u6570\u3002
server.memory-measure-interval=\u30B5\u30F3\u30D7\u30EB JVM \u30E1\u30E2\u30EA\u306E\u983B\u5EA6 (\u30DF\u30EA\u79D2) \u3002-1 \u306F\u30E1\u30E2\u30EA\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3092\u7121\u52B9\u306B\u3057\u307E\u3059\u3002
server.memory-warning-threshold=\u5229\u7528\u53EF\u80FD\u306A\u30E1\u30E2\u30EA\u306E\u5272\u5408\u3002\u3053\u306E\u91CF\u3092\u8D85\u3048\u308B\u3068\u3001\u8B66\u544A\u30ED\u30B0\u3092\u767A\u884C\u3057\u307E\u3059\u3002
server.message-counter-enabled.deprecated=\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F\u3002statistics-enabled \u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
server.message-counter-enabled=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B
server.message-counter-max-day-history=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u5C65\u6B74\u3092\u4FDD\u6301\u3059\u308B\u65E5\u6570
server.message-counter-sample-period=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u306B\u5229\u7528\u3059\u308B\u30B5\u30F3\u30D7\u30EB\u671F\u9593 (\u30DF\u30EA\u79D2)
server.message-expiry-scan-period=\u6709\u52B9\u671F\u9650\u306E\u5207\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3069\u306E\u3088\u3046\u306A\u983B\u5EA6\u3067\u30B9\u30AD\u30E3\u30F3\u3059\u308B\u304B (\u30DF\u30EA\u79D2)
server.message-expiry-thread-priority=\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u671F\u9650\u5207\u308C\u306B\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u306E\u512A\u5148\u9806\u4F4D
server.name=\u4F7F\u308F\u308C\u3066\u3044\u307E\u305B\u3093\u3002
server.override-in-vm-security=ActiveMQ \u30B5\u30FC\u30D0\u30FC\u304C in-vm \u63A5\u7D9A\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u4E0A\u66F8\u304D\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
server.outgoing-interceptors=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u9001\u4FE1\u30A4\u30F3\u30BF\u30FC\u30BB\u30D7\u30BF\u30FC\u30AF\u30E9\u30B9\u306E\u30EA\u30B9\u30C8\u3002
server.outgoing-interceptors.name=\u30A4\u30F3\u30BF\u30FC\u30BB\u30D7\u30BF\u30FC\u30AF\u30E9\u30B9\u306E\u540D\u524D\u3002
server.outgoing-interceptors.module=\u30A4\u30F3\u30BF\u30FC\u30BB\u30D7\u30BF\u30FC\u30AF\u30E9\u30B9\u3092\u63D0\u4F9B\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D\u3002
server.page-max-concurrent-io=\u30DA\u30FC\u30B8\u30F3\u30B0\u3067\u540C\u6642\u306B\u8AAD\u307F\u53D6\u308A\u304C\u53EF\u80FD\u306A\u6700\u5927\u6570
server.perf-blast-pages=\u30B8\u30E3\u30FC\u30CA\u30EB\u306E\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u3092\u30C1\u30A7\u30C3\u30AF\u3059\u308B\u305F\u3081\u306B\u8FFD\u52A0\u3059\u308B\u30DA\u30FC\u30B8\u6570 (\u30DA\u30FC\u30B8\u306E\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306E\u30C6\u30B9\u30C8\u306E\u307F\u306B\u4F7F\u7528)\u3002
server.perf-blast-pages.deprecated=Artemis 2 \u306F\u3053\u306E\u5C5E\u6027\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u306A\u3044\u3088\u3046\u306B\u306A\u308A\u307E\u3057\u305F\u3002
server.persist-delivery-count-before-delivery=\u30C7\u30EA\u30D0\u30EA\u30FC\u524D\u306B\u30C7\u30EA\u30D0\u30EA\u30FC\u30AB\u30A6\u30F3\u30C8\u3092\u6C38\u7D9A\u5316\u3059\u308B\u304B\u3069\u3046\u304B\u3002False \u306F\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u30AD\u30E3\u30F3\u30BB\u30EB\u3055\u308C\u305F\u5F8C\u306B\u306E\u307F\u767A\u751F\u3059\u308B\u3053\u3068\u306B\u306A\u308A\u307E\u3059\u3002
server.persist-id-cache=ID \u3092\u6C38\u7D9A\u5316\u3057\u30B8\u30E3\u30FC\u30CA\u30EB\u306B\u5165\u308C\u308B\u304B\u3069\u3046\u304B
server.persistence-enabled=\u6C38\u7D9A\u5316\u3067\u304D\u308B\u3088\u3046\u30B5\u30FC\u30D0\u30FC\u304C\u30D5\u30A1\u30A4\u30EB\u30D9\u30FC\u30B9\u306E\u30B8\u30E3\u30FC\u30CA\u30EB\u3092\u4F7F\u3046\u304B\u3069\u3046\u304B
server.runtime-journal-type=\u6709\u52B9\u306B\u4F7F\u7528\u3055\u308C\u30B8\u30E3\u30FC\u30CA\u30EB\u30BF\u30A4\u30D7 (\u8A2D\u5B9A\u3055\u308C\u305F\u30BF\u30A4\u30D7\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u3044\u5834\u5408\u306F\u8A2D\u5B9A\u3068\u306F\u7570\u306A\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059)\u3002
server.remove=ActiveMQ \u30B5\u30FC\u30D0\u30FC\u524A\u9664\u64CD\u4F5C\u3002
server.replication-clustername=\u8907\u6570\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u30EC\u30D7\u30EA\u30B1\u30FC\u30C8\u3059\u308B\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306E\u540D\u524D\u3002
server.reset-all-message-counter-histories=\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u5C65\u6B74\u3092\u30EA\u30BB\u30C3\u30C8\u3057\u307E\u3059\u3002
server.reset-all-message-counters=\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u3092\u30EA\u30BB\u30C3\u30C8\u3057\u307E\u3059\u3002
server.resolve-address-setting.address-full-policy=max-size-bytes \u3092\u6307\u5B9A\u3057\u305F\u30A2\u30C9\u30EC\u30B9\u304C\u3044\u3063\u3071\u3044\u306B\u306A\u3063\u305F\u5834\u5408\u306B\u3069\u3046\u3059\u308B\u304B\u6C7A\u5B9A (PAGE\u3001DROP\u3001BLOCK)
server.resolve-address-setting.auto-create-jms-queues=JMS \u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u307E\u305F\u306F\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u3053\u306E\u3088\u3046\u306A\u30AD\u30E5\u30FC\u3092\u4F7F\u7528\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u304D\u306B\u4E00\u81F4\u3059\u308B address-settings \u306B\u5BFE\u5FDC\u3059\u308B JMS \u30AD\u30E5\u30FC\u3092 ActiveMQ \u306B\u3088\u3063\u3066\u81EA\u52D5\u7684\u306B\u4F5C\u6210\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
server.resolve-address-setting.auto-create-jms-queues.deprecated=\u3053\u306E\u5C5E\u6027\u306F ActiveMQ \u306E\u30B5\u30DD\u30FC\u30C8\u5BFE\u8C61\u5916\u3068\u306A\u308A\u307E\u3057\u305F\u3002
server.resolve-address-setting.auto-delete-jms-queues=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3084\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u306A\u3044\u5834\u5408\u306B\u3001ActiveMQ \u304C\u81EA\u52D5\u4F5C\u6210\u3055\u308C\u305F JMS \u30AD\u30E5\u30FC\u3092\u81EA\u52D5\u7684\u306B\u524A\u9664\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
server.resolve-address-setting.auto-delete-jms-queues.deprecated=\u3053\u306E\u5C5E\u6027\u306F ActiveMQ \u306E\u30B5\u30DD\u30FC\u30C8\u5BFE\u8C61\u5916\u3068\u306A\u308A\u307E\u3057\u305F\u3002
server.resolve-address-setting.auto-create-addresses=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u307E\u305F\u306F\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u3053\u306E\u3088\u3046\u306A\u30AD\u30E5\u30FC\u306E\u4F7F\u7528\u3092\u8A66\u307F\u308B\u3068\u304D\u306B\u4E00\u81F4\u3059\u308B address-settings \u306B\u5BFE\u5FDC\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u3092 ActiveMQ \u304C\u81EA\u52D5\u7684\u306B\u4F5C\u6210\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
server.resolve-address-setting.auto-delete-addresses=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3084\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u306A\u3044\u5834\u5408\u306B\u3001\u81EA\u52D5\u4F5C\u6210\u3055\u308C\u305F\u30A2\u30C9\u30EC\u30B9\u3092\u81EA\u52D5\u7684\u306B\u524A\u9664\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
server.resolve-address-setting.auto-create-queues=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u307E\u305F\u306F\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u3053\u306E\u3088\u3046\u306A\u30AD\u30E5\u30FC\u306E\u4F7F\u7528\u3092\u8A66\u307F\u308B\u3068\u304D\u306B\u4E00\u81F4\u3059\u308B address-settings \u306B\u5BFE\u5FDC\u3059\u308B\u30AD\u30E5\u30FC\u3092 ActiveMQ \u304C\u81EA\u52D5\u7684\u306B\u4F5C\u6210\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
server.resolve-address-setting.auto-delete-queues=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3084\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u306A\u3044\u5834\u5408\u306B\u3001\u81EA\u52D5\u4F5C\u6210\u3055\u308C\u305F\u30AD\u30E5\u30FC\u3092\u81EA\u52D5\u7684\u306B\u524A\u9664\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
server.resolve-address-setting.activemq-address=\u89E3\u6C7A\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u3002
server.resolve-address-setting.dead-letter-address=\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9
server.resolve-address-setting.expiry-address=\u6709\u52B9\u671F\u9650\u306E\u5207\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
server.resolve-address-setting.expiry-delay=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u6709\u52B9\u671F\u9650\u3092\u4F7F\u7528\u3057\u3066\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u4F7F\u7528\u3059\u308B\u6709\u52B9\u671F\u9650\u3092\u5B9A\u7FA9\u3057\u307E\u3059
server.resolve-address-setting.last-value-queue=\u30AD\u30E5\u30FC\u304C\u6700\u5F8C\u306E\u5024\u3092\u5229\u7528\u3059\u308B\u304B\u5426\u304B\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
server.resolve-address-setting.max-delivery-attempts=dead-letter-address \u306B\u9001\u4FE1\u3059\u308B\u524D\u306B\u3001\u30AD\u30E3\u30F3\u30BB\u30EB\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u518D\u9001\u3059\u308B\u56DE\u6570\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
server.resolve-address-setting.max-redelivery-delay=redelivery-delay \u306E\u6700\u5927\u5024 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002
server.resolve-address-setting.max-size-bytes=\u6700\u5927\u30D0\u30A4\u30C8\u30B5\u30A4\u30BA
server.resolve-address-setting.message-counter-history-day-limit=1\u65E5\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u5C65\u6B74\u306E\u5236\u9650
server.resolve-address-setting.page-max-cache-size=\u30DA\u30FC\u30B8\u30F3\u30B0\u306E\u30CA\u30D3\u30B2\u30FC\u30B7\u30E7\u30F3\u6642\u306E IO \u3092\u6700\u9069\u5316\u3059\u308B\u305F\u3081\u306B\u3001\u30E1\u30E2\u30EA\u5185\u306B\u4FDD\u6301\u3059\u308B\u30DA\u30FC\u30B8\u30D5\u30A1\u30A4\u30EB\u306E\u6570\u3002
server.resolve-address-setting.page-size-bytes=\u30DA\u30FC\u30B8\u30F3\u30B0\u30B5\u30A4\u30BA
server.resolve-address-setting.redelivery-delay=\u30AD\u30E3\u30F3\u30BB\u30EB\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u518D\u9001\u3092\u8A66\u884C\u3059\u308B\u524D\u306B\u5F85\u6A5F\u3059\u308B\u6642\u9593\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
server.resolve-address-setting.redelivery-multiplier=redelivery-delay \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306B\u9069\u7528\u3059\u308B\u4E57\u6570\u3002
server.resolve-address-setting.redistribution-delay=\u6700\u5F8C\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u30AD\u30E5\u30FC\u3067\u9589\u3058\u3089\u308C\u305F\u5834\u5408\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u518D\u9001\u3092\u884C\u3046\u524D\u306B\u5F85\u6A5F\u3059\u308B\u671F\u9593\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
server.resolve-address-setting.send-to-dla-on-no-route=\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u304C\u305D\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u5BFE\u3057\u3066 true \u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3067\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u3069\u306E\u30AD\u30E5\u30FC\u306B\u3082\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u305D\u306E\u30A2\u30C9\u30EC\u30B9\u306E\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9 (DLA) \u304C\u3042\u308C\u3070\u305D\u3061\u3089\u306B\u9001\u4FE1\u3055\u308C\u307E\u3059\u3002
server.resolve-address-setting.slow-consumer-check-period=\u7279\u5B9A\u30AD\u30E5\u30FC\u4E0A\u306E\u9045\u3044\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3092\u30C1\u30A7\u30C3\u30AF\u3059\u308B\u983B\u5EA6\u3002
server.resolve-address-setting.slow-consumer-policy=\u9045\u3044\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u7279\u5B9A\u3055\u308C\u305F\u3068\u304D\u306B\u4F55\u3092\u884C\u3046\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
server.resolve-address-setting.slow-consumer-threshold=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u9045\u3044\u3068\u5224\u65AD\u3055\u308C\u308B\u524D\u306B\u8A31\u53EF\u3055\u308C\u308B\u6700\u4F4E\u30E1\u30C3\u30BB\u30FC\u30B8\u6D88\u8CBB\u7387\u3002
server.resolve-address-setting=\u30A2\u30C9\u30EC\u30B9\u8A2D\u5B9A\u306E ActiveMQ \u968E\u5C64\u3092\u4F7F\u7528\u3057\u3066\u30A2\u30C9\u30EC\u30B9\u8A2D\u5B9A\u3092\u89E3\u6C7A\u3057\u307E\u3059\u3002
server.rollback-prepared-transaction.reply=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u6B63\u5E38\u306B\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F\u5834\u5408\u306F True\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false\u3002
server.rollback-prepared-transaction.transaction-as-base-64=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 XID \u306E Base64 \u8868\u73FE
server.rollback-prepared-transaction=\u6E96\u5099\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306B\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u307E\u3059\u3002
server.run-sync-speed-test=\u8D77\u52D5\u6642\u306B\u30C7\u30A3\u30B9\u30AF\u306E\u540C\u671F\u306E\u901F\u5EA6\u306B\u3064\u3044\u3066\u8A3A\u65AD\u30C6\u30B9\u30C8\u3092\u5B9F\u884C\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306E\u554F\u984C\u3092\u5224\u5225\u3059\u308B\u969B\u306B\u4FBF\u5229\u3002
server.run-sync-speed-test.deprecated=Artemis 2 \u306F\u3053\u306E\u5C5E\u6027\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u306A\u3044\u3088\u3046\u306B\u306A\u308A\u307E\u3057\u305F\u3002
server.scheduled-thread-pool-max-size=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u4E3B\u8981\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306B\u542B\u307E\u308C\u3066\u3044\u308B\u30B9\u30EC\u30C3\u30C9\u6570
server.elytron-domain=\u30E6\u30FC\u30B6\u30FC\u304A\u3088\u3073\u30ED\u30FC\u30EB\u306E\u60C5\u5831\u78BA\u8A8D\u306B\u4F7F\u7528\u3055\u308C\u308B Elytron \u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u306E\u540D\u524D
server.security-domain=\u30E6\u30FC\u30B6\u30FC\u3068\u30ED\u30FC\u30EB\u306E\u60C5\u5831\u78BA\u8A8D\u306B\u4F7F\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3
server.security-domain.deprecated=\u975E\u63A8\u5968\u3002Elytron \u30C9\u30E1\u30A4\u30F3\u306E\u5C5E\u6027\u3067\u7F6E\u304D\u63DB\u3048\u3089\u308C\u3001Elytron \u3067\u8A2D\u5B9A\u3055\u308C\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
server.security-enabled=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B
server.security-invalidation-interval=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u7121\u52B9\u306B\u3059\u308B\u307E\u3067\u306E\u5F85\u6A5F\u6642\u9593 (\u30DF\u30EA\u79D2)
server.server-dump-interval=\u57FA\u672C\u7684\u306A\u30E9\u30F3\u30BF\u30A4\u30E0\u60C5\u5831\u3092\u30B5\u30FC\u30D0\u30FC\u30ED\u30B0\u306B\u30C0\u30F3\u30D7\u3059\u308B\u983B\u5EA6\u30021 \u672A\u6E80\u306E\u5024\u306F\u3053\u306E\u6A5F\u80FD\u3092\u7121\u52B9\u306B\u3057\u307E\u3059\u3002
server.shared-store=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u7528\u306B\u5171\u6709\u30B9\u30C8\u30A2\u3092\u4F7F\u3046\u304B\u3069\u3046\u304B
server.started=\u3053\u306E\u30B5\u30FC\u30D3\u30B9\u3092\u958B\u59CB\u3059\u308B\u304B\u3069\u3046\u304B
server.statistics-enabled=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u306A\u3069\u306E\u7D71\u8A08\u60C5\u5831\u306E\u53CE\u96C6\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
server.thread-pool-max-size=\u4E3B\u8981\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306B\u542B\u307E\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u6570\u3002-1 \u306F\u5236\u9650\u306A\u3057\u3002
server.transaction-timeout-scan-period=\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3069\u306E\u3088\u3046\u306A\u983B\u5EA6\u3067\u30B9\u30AD\u30E3\u30F3\u3059\u308B\u304B (\u30DF\u30EA\u79D2)
server.transaction-timeout=\u4F5C\u6210\u6642\u9593\u5F8C\u306B\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u671F\u9593\u3002\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u4F7F\u7528\u3055\u308C\u305F\u5834\u5408\u3001\u3053\u306E\u5024\u306F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u5024\u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u307E\u3059\u3002
server.version=\u30B5\u30FC\u30D0\u30FC\u306E\u30D0\u30FC\u30B8\u30E7\u30F3
server.wild-card-routing-enabled=\u30B5\u30FC\u30D0\u30FC\u304C\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u306B\u5BFE\u5FDC\u3059\u308B\u304B\u3069\u3046\u304B
server=ActiveMQ \u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3002
statistics=\u3053\u306E pooled-connection-factory \u30EA\u30BD\u30FC\u30B9\u306E\u7D71\u8A08 (statistics-enabled \u304C true \u306E\u5834\u5408\u306B\u306E\u307F\u5229\u7528\u53EF\u80FD)\u3002
host=HTTP \u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u30DB\u30B9\u30C8\u3002
http-acceptor=HTTP \u4E0A\u306E ActiveMQ \u30B5\u30FC\u30D0\u30FC\u3078\u30EA\u30E2\u30FC\u30C8\u63A5\u7D9A\u3067\u304D\u308B\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
http-connector=HTTP \u4E0A\u306E\u30B5\u30FC\u30D0\u30FC\u3078\u63A5\u7D9A\u3059\u308B\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3059\u308B\u305F\u3081\u30EA\u30E2\u30FC\u30C8\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
http-listener=HTTP \u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u8981\u6C42\u3092\u51E6\u7406\u3059\u308B Undertow \u306E http-listener\u3002
in-vm-acceptor=HornetQ \u30B5\u30FC\u30D0\u30FC\u3078\u306E in-VM \u63A5\u7D9A\u306E\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
in-vm-connector=\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3059\u308B\u305F\u3081 in-VM \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
jms-bridge.aborted-message-count=\u505C\u6B62\u307E\u305F\u306F\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570\u3002
jms-bridge.add-messageID-in-header=true \u306E\u5834\u5408\u3001\u30D8\u30C3\u30C0\u30FC AMQ_BRIDGE_MSG_ID_LIST \u306E\u5B9B\u5148\u3078\u9001\u4FE1\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u5143\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30E1\u30C3\u30BB\u30FC\u30B8 ID \u304C\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u8907\u6570\u56DE\u30D6\u30EA\u30C3\u30B8\u3055\u308C\u305F\u5834\u5408\u3001\u5404\u30E1\u30C3\u30BB\u30FC\u30B8 ID \u304C\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
jms-bridge.add=\u65B0\u3057\u3044 JMS \u30D6\u30EA\u30C3\u30B8\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
jms-bridge.client-id=\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u304C\u6C38\u7D9A\u7684\u3067\u30BD\u30FC\u30B9\u306E\u5B9B\u5148\u304C\u30C8\u30D4\u30C3\u30AF\u306E\u5834\u5408\u3001\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u4F5C\u6210\u307E\u305F\u306F\u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B\u6642\u306B\u4F7F\u7528\u3059\u308B JMS \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 ID\u3002
jms-bridge.failure-retry-interval=\u30BD\u30FC\u30B9\u307E\u305F\u306F\u30BF\u30FC\u30B2\u30C3\u30C8\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u306E\u518D\u4F5C\u6210\u3092\u8A66\u884C\u3059\u308B\u30DF\u30EA\u79D2\u5358\u4F4D\u306E\u9593\u9694 (\u30D6\u30EA\u30C3\u30B8\u3067\u63A5\u7D9A\u306E\u5931\u6557\u304C\u691C\u51FA\u3055\u308C\u305F\u5834\u5408)\u3002
jms-bridge.max-batch-size=\u30BD\u30FC\u30B9\u5B9B\u5148\u304B\u3089\u6D88\u8CBB\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6700\u5927\u6570 (\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30D0\u30C3\u30C1\u3067\u30BF\u30FC\u30B2\u30C3\u30C8\u5B9B\u5148\u306B\u9001\u4FE1\u3059\u308B\u524D)\u3002\u5024\u306F >= 1 \u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
jms-bridge.max-batch-time=\u30D0\u30C3\u30C1\u3092\u30BF\u30FC\u30B2\u30C3\u30C8\u306B\u9001\u4FE1\u3059\u308B\u307E\u3067\u306E\u30DF\u30EA\u79D2\u5358\u4F4D\u306E\u5F85\u6A5F\u6700\u5927\u6642\u9593 (\u6D88\u8CBB\u3055\u308C\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570\u304C max-batch-size \u306B\u9054\u3057\u306A\u3044\u5834\u5408\u3067\u3082)\u3002\u5024\u304C -1 \u306E\u5834\u5408\u306F\u300C\u6C38\u7D9A\u7684\u306B\u5F85\u6A5F\u300D\u3092\u8868\u3057\u3001>= 1 \u306E\u5834\u5408\u306F\u5B9F\u969B\u306E\u6642\u9593\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
jms-bridge.max-retries=\u30BD\u30FC\u30B9\u307E\u305F\u306F\u30BF\u30FC\u30B2\u30C3\u30C8\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u306E\u518D\u4F5C\u6210\u306E\u8A66\u884C\u56DE\u6570 (\u30D6\u30EA\u30C3\u30B8\u3067\u63A5\u7D9A\u306E\u5931\u6557\u304C\u691C\u51FA\u3055\u308C\u305F\u5834\u5408)\u3002\u3053\u306E\u56DE\u6570\u306E\u8A66\u884C\u5F8C\u306B\u30D6\u30EA\u30C3\u30B8\u306F\u3042\u304D\u3089\u3081\u307E\u3059\u3002-1 \u306F\u300C\u6C38\u7D9A\u7684\u306B\u8A66\u884C\u300D\u3092\u8868\u3057\u307E\u3059\u3002
jms-bridge.message-count=\u6B63\u5E38\u306B\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570\u3002
jms-bridge.module=\u30BD\u30FC\u30B9\u306E\u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u306B\u5FC5\u8981\u306A\u30EA\u30BD\u30FC\u30B9\u3068\u30BF\u30FC\u30B2\u30C3\u30C8 JMS \u30EA\u30BD\u30FC\u30B9\u304C\u542B\u307E\u308C\u308B AS7 \u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D\u3002
jms-bridge.pause=JMS \u30D6\u30EA\u30C3\u30B8\u3092\u4E00\u6642\u505C\u6B62
jms-bridge.paused=JMS \u30D6\u30EA\u30C3\u30B8\u304C\u4E00\u6642\u505C\u6B62\u3055\u308C\u308B\u304B\u3069\u3046\u304B
jms-bridge.quality-of-service=\u30B5\u30FC\u30D3\u30B9\u30E2\u30FC\u30C9\u306E\u5E0C\u671B\u306E\u30AF\u30AA\u30EA\u30C6\u30A3\u30FC (AT_MOST_ONCE\u3001DUPLICATES_OK\u3001\u307E\u305F\u306F ONCE_AND_ONLY_ONCE)\u3002
jms-bridge.remove=\u65E2\u5B58\u306E JMS \u30D6\u30EA\u30C3\u30B8\u3092\u524A\u9664\u3057\u307E\u3059\u3002
jms-bridge.resume=JMS \u30D6\u30EA\u30C3\u30B8\u3092\u518D\u958B
jms-bridge.selector=\u30BD\u30FC\u30B9\u5B9B\u5148\u304B\u3089\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6D88\u8CBB\u306B\u4F7F\u7528\u3055\u308C\u308B JMS \u30BB\u30EC\u30AF\u30BF\u30FC\u5F0F\u3002\u30BB\u30EC\u30AF\u30BF\u30FC\u5F0F\u306B\u4E00\u81F4\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u307F\u304C\u30BD\u30FC\u30B9\u304B\u3089\u30BF\u30FC\u30B2\u30C3\u30C8\u5B9B\u5148\u306B\u30D6\u30EA\u30C3\u30B8\u3055\u308C\u307E\u3059\u3002
jms-bridge.source-connection-factory=\u30BD\u30FC\u30B9\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30FC\u30D0\u30FC\u3067\u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B\u30BD\u30FC\u30B9\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u540D\u524D\u3002
jms-bridge.source-context=\u30BD\u30FC\u30B9 JNDI \u521D\u671F\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u8A2D\u5B9A\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
jms-bridge.source-destination=\u30BD\u30FC\u30B9\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30FC\u30D0\u30FC\u3067\u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B\u30BD\u30FC\u30B9\u5B9B\u5148\u306E\u540D\u524D\u3002
jms-bridge.source-password=\u30BD\u30FC\u30B9\u63A5\u7D9A\u3092\u4F5C\u6210\u3059\u308B\u5834\u5408\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
jms-bridge.source-user=\u30BD\u30FC\u30B9\u63A5\u7D9A\u3092\u4F5C\u6210\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u306E\u540D\u524D\u3002
jms-bridge.source-credential-reference=\u30BD\u30FC\u30B9\u63A5\u7D9A\u3092\u8A8D\u8A3C\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB (\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304B\u3089\u306E)
jms-bridge.source-credential-reference.store=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3078\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D
jms-bridge.source-credential-reference.type=\u3053\u306E\u53C2\u7167\u304C\u610F\u5473\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30BF\u30A4\u30D7
jms-bridge.source-credential-reference.alias=\u4FDD\u5B58\u3055\u308C\u305F\u79D8\u5BC6\u307E\u305F\u306F\u30B9\u30C8\u30A2\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u610F\u5473\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9
jms-bridge.source-credential-reference.clear-text=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u79D8\u5BC6 (\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB/ \u79D8\u5BC6\u3092\u30B5\u30FC\u30D3\u30B9\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044)
jms-bridge.start=JMS \u30D6\u30EA\u30C3\u30B8\u3092\u958B\u59CB
jms-bridge.started=JMS \u30D6\u30EA\u30C3\u30B8\u304C\u958B\u59CB\u3055\u308C\u308B\u304B\u3069\u3046\u304B
jms-bridge.stop=JMS \u30D6\u30EA\u30C3\u30B8\u3092\u505C\u6B62
jms-bridge.subscription-name=\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306E\u540D\u524D (\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u304C\u6C38\u7D9A\u7684\u3067\u3042\u308A\u3001\u30BD\u30FC\u30B9\u5B9B\u5148\u304C\u30C8\u30D4\u30C3\u30AF\u306E\u5834\u5408)\u3002
jms-bridge.target-connection-factory=\u30BF\u30FC\u30B2\u30C3\u30C8\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30FC\u30D0\u30FC\u3067\u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B\u30BF\u30FC\u30B2\u30C3\u30C8\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u540D\u524D\u3002
jms-bridge.target-context=\u30BF\u30FC\u30B2\u30C3\u30C8 JNDI \u521D\u671F\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u8A2D\u5B9A\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
jms-bridge.target-destination=\u30BF\u30FC\u30B2\u30C3\u30C8\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30FC\u30D0\u30FC\u3067\u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B\u30BF\u30FC\u30B2\u30C3\u30C8\u5B9B\u5148\u306E\u540D\u524D\u3002
jms-bridge.target-password=\u30BF\u30FC\u30B2\u30C3\u30C8\u63A5\u7D9A\u3092\u4F5C\u6210\u3059\u308B\u5834\u5408\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
jms-bridge.target-user=\u30BF\u30FC\u30B2\u30C3\u30C8\u63A5\u7D9A\u3092\u4F5C\u6210\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u306E\u540D\u524D\u3002
jms-bridge.target-credential-reference=\u30BF\u30FC\u30B2\u30C3\u30C8\u63A5\u7D9A\u3092\u8A8D\u8A3C\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB (\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304B\u3089\u306E)
jms-bridge.target-credential-reference.store=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3078\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D
jms-bridge.target-credential-reference.type=\u3053\u306E\u53C2\u7167\u304C\u610F\u5473\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30BF\u30A4\u30D7
jms-bridge.target-credential-reference.alias=\u4FDD\u5B58\u3055\u308C\u305F\u79D8\u5BC6\u307E\u305F\u306F\u30B9\u30C8\u30A2\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u610F\u5473\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9
jms-bridge.target-credential-reference.clear-text=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u79D8\u5BC6 (\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB/ \u79D8\u5BC6\u3092\u30B5\u30FC\u30D3\u30B9\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044)
jms-bridge=JMS \u30D6\u30EA\u30C3\u30B8\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3002
jms-queue.add-jndi.jndi-binding=Jndi \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
jms-queue.add-jndi=\u30AD\u30E5\u30FC\u3092\u5225\u306E JNDI \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306B\u8FFD\u52A0
jms-queue.add=JMS \u30AD\u30E5\u30FC\u306E\u8FFD\u52A0
jms-queue.consumer-count=\u3053\u306E\u30AD\u30E5\u30FC\u3088\u308A\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u6D88\u8CBB\u3059\u308B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u6570
jms-queue.dead-letter-address=\u30C7\u30C3\u30C9\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u30A2\u30C9\u30EC\u30B9
jms-queue.delivering-count=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u914D\u4FE1\u3057\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-queue.durable=\u30AD\u30E5\u30FC\u304C\u6C38\u7D9A\u7684\u304B\u3069\u3046\u304B
jms-queue.elements.JMSPriority=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u5EA6\u3002
jms-queue.elements.JMSTimestamp=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3001\u30DF\u30EA\u79D2\u5358\u4F4D\u306E epoch \u304B\u3089\u306E\u6642\u9593\u3002
jms-queue.elements.JMSExpiration=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u671F\u9650\u5207\u308C\u6642\u9593\u3002
jms-queue.elements.JMSDeliveryMode=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u914D\u4FE1\u30E2\u30FC\u30C9\u3001PERSISTENT \u307E\u305F\u306F NON_PERSISTENT\u3002
jms-queue.elements.JMSMessageID=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E ID\u3002
jms-queue.entries=\u30AD\u30E5\u30FC\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B jndi \u540D
jms-queue.expiry-address=\u6709\u52B9\u671F\u9650\u306E\u5207\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u30A2\u30C9\u30EC\u30B9
jms-queue.legacy-entries=\u30AD\u30E5\u30FC\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B jndi \u540D
jms-queue.list-delivering-messages.consumerName=\u30E1\u30C3\u30BB\u30FC\u30B8\u914D\u4FE1\u5148\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u540D\u524D\u3002
jms-queue.list-delivering-messages.elements=\u914D\u4FE1\u4E2D\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3002
jms-queue.list-delivering-messages.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u304B\u3089\u305D\u308C\u3089\u306E\u5024\u3078\u306E\u30DE\u30C3\u30D7\u3067\u3042\u308B\u30EA\u30B9\u30C8\u3002
jms-queue.list-delivering-messages=\u73FE\u5728\u914D\u4FE1\u4E2D\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
jms-queue.list-delivering-messages-as-json.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u304B\u3089\u305D\u308C\u3089\u306E\u5024\u3078\u306E\u30DE\u30C3\u30D7\u3067\u3042\u308B\u30EA\u30B9\u30C8\u3092\u8868\u3059 JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3002
jms-queue.list-delivering-messages-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u73FE\u5728\u914D\u4FE1\u3055\u308C\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30EA\u30B9\u30C8
jms-queue.list-messages.JMSDeliveryMode=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u914D\u4FE1\u30E2\u30FC\u30C9\u3001PERSISTENT \u307E\u305F\u306F NON_PERSISTENT\u3002
jms-queue.list-messages.JMSExpiration=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u671F\u9650\u5207\u308C\u6642\u9593\u3002
jms-queue.list-messages.JMSMessageID=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
jms-queue.list-messages.JMSPriority=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u5EA6\u3002
jms-queue.list-messages.JMSTimestamp=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3001\u30DF\u30EA\u79D2\u5358\u4F4D\u306E epoch \u304B\u3089\u306E\u6642\u9593\u3002
jms-queue.list-messages.filter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
jms-queue.list-messages=\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u30DE\u30C3\u30C1\u3059\u308B\u30AD\u30E5\u30FC\u306E\u4E2D\u306B\u3042\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
jms-queue.list-scheduled-messages-as-json.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u304B\u3089\u305D\u308C\u3089\u306E\u5024\u3078\u306E\u30DE\u30C3\u30D7\u3067\u3042\u308B\u30EA\u30B9\u30C8\u3092\u8868\u3059 JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3002
jms-queue.list-scheduled-messages-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u914D\u4FE1\u304C\u4E88\u5B9A\u3055\u308C\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u4E00\u89A7\u8868\u793A
jms-queue.list-scheduled-messages.JMSDeliveryMode=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u914D\u4FE1\u30E2\u30FC\u30C9\u3001PERSISTENT \u307E\u305F\u306F NON_PERSISTENT\u3002
jms-queue.list-scheduled-messages.JMSExpiration=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u671F\u9650\u5207\u308C\u6642\u9593\u3002
jms-queue.list-scheduled-messages.JMSMessageID=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
jms-queue.list-scheduled-messages.JMSPriority=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u5EA6\u3002
jms-queue.list-scheduled-messages.JMSTimestamp=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3001\u30DF\u30EA\u79D2\u5358\u4F4D\u306E epoch \u304B\u3089\u306E\u6642\u9593\u3002
jms-queue.list-scheduled-messages.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u304B\u3089\u305D\u308C\u3089\u306E\u5024\u3078\u306E\u30DE\u30C3\u30D7\u3067\u3042\u308B\u30EA\u30B9\u30C8\u3002
jms-queue.list-scheduled-messages=\u914D\u4FE1\u304C\u4E88\u5B9A\u3055\u308C\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u4E00\u89A7
jms-queue.message-count=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u306B\u5B58\u5728\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-queue.message.JMSDeliveryMode=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u914D\u4FE1\u30E2\u30FC\u30C9\u3001PERSISTENT \u307E\u305F\u306F NON_PERSISTENT\u3002
jms-queue.message.JMSExpiration=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u671F\u9650\u5207\u308C\u6642\u9593\u3002
jms-queue.message.JMSMessageID=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
jms-queue.message.JMSPriority=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u5EA6\u3002
jms-queue.message.JMSTimestamp=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3001\u30DF\u30EA\u79D2\u5358\u4F4D\u306E epoch \u304B\u3089\u306E\u6642\u9593\u3002
jms-queue.messages-added=\u3053\u306E\u30AD\u30E5\u30FC\u304C\u4F5C\u6210\u3055\u308C\u3066\u304B\u3089\u8FFD\u52A0\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-queue.paused=\u30AD\u30E5\u30FC\u304C\u4E00\u6642\u505C\u6B62\u3055\u308C\u308B\u304B\u3069\u3046\u304B
jms-queue.queue-address=\u30AD\u30E5\u30FC\u30A2\u30C9\u30EC\u30B9\u306F\u3001\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u3069\u306E\u30A2\u30C9\u30EC\u30B9\u3092\u4F7F\u7528\u3059\u308B\u304B\u5B9A\u7FA9\u3057\u307E\u3059\u3002
jms-queue.remove-jndi.jndi-binding=Jndi \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
jms-queue.remove-jndi=JNDI \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u524A\u9664\u3057\u307E\u3059
jms-queue.remove=JMS \u30AD\u30E5\u30FC\u306E\u524A\u9664
jms-queue.reset-message-counter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u306E\u30EA\u30BB\u30C3\u30C8
jms-queue.scheduled-count=\u3053\u306E\u30AD\u30E5\u30FC\u306B\u5B58\u5728\u3059\u308B\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-queue.selector=\u30AD\u30E5\u30FC\u30BB\u30EC\u30AF\u30BF\u30FC
jms-queue.temporary=\u30AD\u30E5\u30FC\u304C\u4E00\u6642\u7684\u306A\u3082\u306E\u304B\u3069\u3046\u304B
jms-queue=JMS \u30AD\u30E5\u30FC\u306E\u5B9A\u7FA9
jms-topic.add-jndi.jndi-binding=Jndi \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
jms-topic.add-jndi=\u30AD\u30E5\u30FC\u3092\u5225\u306E JNDI \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306B\u8FFD\u52A0
jms-topic.add=JMS \u30C8\u30D4\u30C3\u30AF\u306E\u8FFD\u52A0
jms-topic.client-id=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 ID
jms-topic.consumers.browseOnly=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306F\u30AD\u30E5\u30FC\u306E\u53C2\u7167\u306E\u307F\u3092\u884C\u3046\u304B\u3069\u3046\u304B
jms-topic.consumers.connectionID= \u63A5\u7D9A id
jms-topic.consumers.consumerID=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC ID\u3002
jms-topic.consumers.creationTime=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u4F5C\u6210\u3055\u308C\u305F\u6642\u9593 (\u30A8\u30DD\u30C3\u30AF\u304B\u3089\u306E\u30DF\u30EA\u79D2)
jms-topic.consumers.sessionID=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u30BB\u30C3\u30B7\u30E7\u30F3 id
jms-topic.count-messages-for-subscription.client-id=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 ID
jms-topic.count-messages-for-subscription.filter==\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
jms-topic.count-messages-for-subscription.subscription-name=\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u540D
jms-topic.count-messages-for-subscription=\u6307\u5B9A\u306E\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306B\u5BFE\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u30DE\u30C3\u30C1\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u6570\u3092\u30AB\u30A6\u30F3\u30C8
jms-topic.delivering-count=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u914D\u4FE1\u3057\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-topic.drop-all-subscriptions=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u304B\u3089\u306E\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u505C\u6B62
jms-topic.drop-durable-subscription.client-id=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 ID
jms-topic.drop-durable-subscription.filter==\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
jms-topic.drop-durable-subscription.subscription-name=\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u540D
jms-topic.drop-durable-subscription=\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u505C\u6B62
jms-topic.durable-message-count=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u306E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30E9\u30A4\u30D0\u30FC\u3059\u3079\u3066\u306B\u5BFE\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-topic.durable-subscription-count=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u306E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30E9\u30A4\u30D0\u30FC\u6570
jms-topic.entries=\u30C8\u30D4\u30C3\u30AF\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B jndi \u540D
jms-topic.filter=JMS \u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC
jms-topic.legacy-entries=\u30C8\u30D4\u30C3\u30AF\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B\u30EC\u30AC\u30B7\u30FC jndi \u540D
jms-topic.list-all-subscriptions-as-json.reply=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217
jms-topic.list-all-subscriptions-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u5168\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-all-subscriptions.clientID=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 id
jms-topic.list-all-subscriptions.consumers=\u30AD\u30E5\u30FC\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC
jms-topic.list-all-subscriptions.deliveringCount=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u914D\u4FE1\u3057\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-topic.list-all-subscriptions.durable=\u30AD\u30E5\u30FC\u304C\u6C38\u7D9A\u7684\u304B\u3069\u3046\u304B
jms-topic.list-all-subscriptions.messageCount=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u306B\u5B58\u5728\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-topic.list-all-subscriptions.name=\u30AD\u30E5\u30FC\u306E\u540D\u524D
jms-topic.list-all-subscriptions.queueName=\u30AD\u30E5\u30FC\u306E\u30D5\u30EB\u30CD\u30FC\u30E0
jms-topic.list-all-subscriptions.reply=\u5358\u4E00\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u8AAC\u660E\u3059\u308B\u5404\u8981\u7D20\u306E\u4E00\u89A7\u3002
jms-topic.list-all-subscriptions.selector=\u30AD\u30E5\u30FC\u30BB\u30EC\u30AF\u30BF\u30FC
jms-topic.list-all-subscriptions=\u5168\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-durable-subscriptions-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306E\u307F\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-durable-subscriptions.clientID=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 id
jms-topic.list-durable-subscriptions.consumers=\u30AD\u30E5\u30FC\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC
jms-topic.list-durable-subscriptions.deliveringCount=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u914D\u4FE1\u3057\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-topic.list-durable-subscriptions.durable=\u30AD\u30E5\u30FC\u304C\u6C38\u7D9A\u7684\u304B\u3069\u3046\u304B
jms-topic.list-durable-subscriptions.messageCount=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u306B\u5B58\u5728\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-topic.list-durable-subscriptions.name=\u30AD\u30E5\u30FC\u306E\u540D\u524D
jms-topic.list-durable-subscriptions.queueName=\u30AD\u30E5\u30FC\u306E\u30D5\u30EB\u30CD\u30FC\u30E0
jms-topic.list-durable-subscriptions.reply=\u5358\u4E00\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u8AAC\u660E\u3059\u308B\u5404\u8981\u7D20\u306E\u4E00\u89A7\u3002
jms-topic.list-durable-subscriptions.selector=\u30AD\u30E5\u30FC\u30BB\u30EC\u30AF\u30BF\u30FC
jms-topic.list-durable-subscriptions=\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306E\u307F\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-messages-for-subscription-as-json.queue-name=\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u8868\u3059\u30AD\u30E5\u30FC\u306E\u540D\u524D
jms-topic.list-messages-for-subscription-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u6307\u5B9A\u306E\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
jms-topic.list-messages-for-subscription.JMSDeliveryMode=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u914D\u4FE1\u30E2\u30FC\u30C9\u3001PERSISTENT \u307E\u305F\u306F NON_PERSISTENT\u3002
jms-topic.list-messages-for-subscription.JMSExpiration=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u671F\u9650\u5207\u308C\u6642\u9593\u3002
jms-topic.list-messages-for-subscription.JMSMessageID=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
jms-topic.list-messages-for-subscription.JMSPriority=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u5EA6\u3002
jms-topic.list-messages-for-subscription.JMSTimestamp=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3001\u30DF\u30EA\u79D2\u5358\u4F4D\u306E epoch \u304B\u3089\u306E\u6642\u9593\u3002
jms-topic.list-messages-for-subscription.queue-name=\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u8868\u3059\u30AD\u30E5\u30FC\u306E\u540D\u524D
jms-topic.list-messages-for-subscription.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u304B\u3089\u305D\u308C\u3089\u306E\u5024\u3078\u306E\u30DE\u30C3\u30D7\u3067\u3042\u308B\u30EA\u30B9\u30C8\u3002
jms-topic.list-messages-for-subscription=\u6307\u5B9A\u306E\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306B\u95A2\u3059\u308B\u5168\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-non-durable-subscriptions-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u975E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306E\u307F\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-non-durable-subscriptions.clientID=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 id
jms-topic.list-non-durable-subscriptions.consumers=\u30AD\u30E5\u30FC\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC
jms-topic.list-non-durable-subscriptions.deliveringCount=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u914D\u4FE1\u3057\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-topic.list-non-durable-subscriptions.durable=\u30AD\u30E5\u30FC\u304C\u6C38\u7D9A\u7684\u304B\u3069\u3046\u304B
jms-topic.list-non-durable-subscriptions.messageCount=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u306B\u5B58\u5728\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-topic.list-non-durable-subscriptions.name=\u30AD\u30E5\u30FC\u306E\u540D\u524D
jms-topic.list-non-durable-subscriptions.queueName=\u30AD\u30E5\u30FC\u306E\u30D5\u30EB\u30CD\u30FC\u30E0
jms-topic.list-non-durable-subscriptions.reply=\u5358\u4E00\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u8AAC\u660E\u3059\u308B\u5404\u8981\u7D20\u306E\u4E00\u89A7\u3002
jms-topic.list-non-durable-subscriptions.selector=\u30AD\u30E5\u30FC\u30BB\u30EC\u30AF\u30BF\u30FC
jms-topic.list-non-durable-subscriptions=\u975E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306E\u307F\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-subscriptions.clientID=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 id
jms-topic.list-subscriptions.consumers=\u30AD\u30E5\u30FC\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC
jms-topic.list-subscriptions.deliveringCount=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u914D\u4FE1\u3057\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-topic.list-subscriptions.durable=\u30AD\u30E5\u30FC\u304C\u6C38\u7D9A\u7684\u304B\u3069\u3046\u304B
jms-topic.list-subscriptions.messageCount=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u306B\u5B58\u5728\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-topic.list-subscriptions.name=\u30AD\u30E5\u30FC\u306E\u540D\u524D
jms-topic.list-subscriptions.queueName=\u30AD\u30E5\u30FC\u306E\u30D5\u30EB\u30CD\u30FC\u30E0
jms-topic.list-subscriptions.selector=\u30AD\u30E5\u30FC\u30BB\u30EC\u30AF\u30BF\u30FC
jms-topic.message-count=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u306B\u5B58\u5728\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-topic.messages-added=\u3053\u306E\u30AD\u30E5\u30FC\u304C\u4F5C\u6210\u3055\u308C\u3066\u304B\u3089\u8FFD\u52A0\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
jms-topic.non-durable-message-count=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u306E\u975E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30E9\u30A4\u30D0\u30FC\u3059\u3079\u3066\u306B\u5BFE\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-topic.non-durable-subscription-count=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u306E\u975E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30E9\u30A4\u30D0\u30FC\u6570
jms-topic.remove-jndi.jndi-binding=Jndi \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
jms-topic.remove-jndi=JNDI \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u524A\u9664\u3057\u307E\u3059
jms-topic.remove-messages.filter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
jms-topic.remove-messages.reply=\u524A\u9664\u3057\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-topic.remove-messages=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u4E00\u81F4\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30C8\u30D4\u30C3\u30AF\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u3002
jms-topic.remove=JMS \u30C8\u30D4\u30C3\u30AF\u306E\u524A\u9664
jms-topic.subscription-count=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u306E (\u6C38\u7D9A\u3042\u308B\u3044\u306F\u975E\u6C38\u7D9A) \u30B5\u30D6\u30B9\u30AF\u30E9\u30A4\u30D0\u30FC\u6570
jms-topic.subscription-name=\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u540D
jms-topic.temporary=\u30C8\u30D4\u30C3\u30AF\u304C\u4E00\u6642\u7684\u306A\u3082\u306E\u304B\u3069\u3046\u304B
jms-topic.topic-address=\u30C8\u30D4\u30C3\u30AF\u306E\u53C2\u7167\u5148\u30A2\u30C9\u30EC\u30B9
jms-topic=JMS \u30C8\u30D4\u30C3\u30AF\u306E\u5B9A\u7FA9
jndi-binding=JNDI \u5411\u3051\u306E\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u540D
journal-directory.path=\u30E1\u30C3\u30BB\u30FC\u30B8\u30B8\u30E3\u30FC\u30CA\u30EB\u304C\u5B58\u5728\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F ${jboss.server.data.dir}/messagingjournal \u3067\u3059\u3002
large-messages-directory.path=\u5927\u578B\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u4FDD\u5B58\u3055\u308C\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F ${jboss.server.data.dir}/messaginglargemessages \u3067\u3059\u3002
messaging-activemq.add=messaging-activemq \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C
messaging-activemq.remove=messaging-activemq \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664\u64CD\u4F5C
messaging-activemq=messaging-activemq \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3002
paging-directory.path=\u30DA\u30FC\u30B8\u30D5\u30A1\u30A4\u30EB\u304C\u4FDD\u5B58\u3055\u308C\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F ${jboss.server.data.dir}/messagingpaging \u3067\u3059\u3002
path.add=\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u306E\u8FFD\u52A0
path.path=\u5B9F\u969B\u306E\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u3002'relative-to' \u5C5E\u6027\u3068\u3057\u3066\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u9650\u308A\u3001\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002'relative-to' \u5C5E\u6027\u3068\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u305D\u306E\u30D1\u30B9\u3092\u8D77\u70B9\u306B\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u5024\u304C\u51E6\u7406\u3055\u308C\u307E\u3059\u3002\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u308B\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u5024\u304C\u6307\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u30D1\u30B9\u540D\u306F\u6B21\u306E\u3088\u3046\u306B\u6C7A\u5B9A\u3055\u308C\u307E\u3059\u3002\u3053\u306E\u5024\u304C\u3059\u3067\u306B\u7D76\u5BFE\u30D1\u30B9\u306E\u5834\u5408\u3001\u5024\u306F\u76F4\u63A5\u5229\u7528\u3055\u308C\u307E\u3059\u3002\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u3001\u30E9\u30F3\u30BF\u30A4\u30E0\u30D1\u30B9\u540D\u304C\u30B7\u30B9\u30C6\u30E0\u306B\u4F9D\u5B58\u3059\u308B\u5F62\u3067\u89E3\u6C7A\u3055\u308C\u307E\u3059\u3002UNIX \u30B7\u30B9\u30C6\u30E0\u3067\u306F\u3001\u76F8\u5BFE\u30D1\u30B9\u540D\u306F\u73FE\u5728\u306E\u30E6\u30FC\u30B6\u30FC\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u306B\u5BFE\u3057\u3066\u89E3\u6C7A\u3059\u308B\u3053\u3068\u3067\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002Microsoft Windows \u30B7\u30B9\u30C6\u30E0\u3067\u306F\u3001\u30D1\u30B9\u540D\u3067\u6307\u5B9A\u3057\u3066\u3044\u308B\u30C9\u30E9\u30A4\u30D6\u306E\u73FE\u5728\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u304C\u3042\u308C\u3070\u305D\u308C\u306B\u5BFE\u3057\u3066\u89E3\u6C7A\u3059\u308B\u3053\u3068\u3067\u3001\u76F8\u5BFE\u30D1\u30B9\u304C\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u304C\u306A\u3044\u5834\u5408\u306F\u3001\u73FE\u5728\u306E\u30E6\u30FC\u30B6\u30FC\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u306B\u5BFE\u3057\u3066\u89E3\u6C7A\u3055\u308C\u308B\u3053\u3068\u3067\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002
path.relative-to=\u4EE5\u524D\u306B\u540D\u524D\u6307\u5B9A\u3055\u308C\u305F\u30D1\u30B9\u306E\u540D\u524D\u3001\u3042\u308B\u3044\u306F\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u4F9B\u3057\u305F\u6A19\u6E96\u30D1\u30B9\u306E 1 \u3064\u3002'relative-to' \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001'path' \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3057\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u4F9B\u3059\u308B\u6A19\u6E96\u30D1\u30B9\u306F\u4EE5\u4E0B\u306E\u901A\u308A\u3067\u3059\u3002jboss.home - JBoss AS \u30C7\u30A3\u30B9\u30C8\u30EA\u30D3\u30E5\u30FC\u30B7\u30E7\u30F3\u306E\u30EB\u30FC\u30C8\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002user.home - \u30E6\u30FC\u30B6\u30FC\u306E\u30DB\u30FC\u30E0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002user.dir - \u30E6\u30FC\u30B6\u30FC\u306E\u73FE\u5728\u4F5C\u696D\u4E2D\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002java.home - java \u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u8A2D\u5B9A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002jboss.server.base.dir - \u5404\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30EB\u30FC\u30C8\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002jboss.server.data.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u6C38\u7D9A\u30C7\u30FC\u30BF\u306E\u30D5\u30A1\u30A4\u30EB\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002jboss.server.log.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u306E\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002jboss.server.tmp.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u4E00\u6642\u7684\u306A\u30D5\u30A1\u30A4\u30EB\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002jboss.domain.servers.dir - \u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u500B\u5225\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u696D\u30A8\u30EA\u30A2\u3092\u4F5C\u6210\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002
path.remove=\u30D1\u30B9\u306E\u524A\u9664
path=ActiveMQ \u304C\u6C38\u7D9A\u30C7\u30FC\u30BF\u3092\u4FDD\u5B58\u3059\u308B\u5834\u6240\u306E 1 \u3064\u3092\u793A\u3059\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9
pooled-connection-factory.add=\u7BA1\u7406\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u8FFD\u52A0
pooled-connection-factory.allow-local-transactions=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9 JMS \u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u30ED\u30FC\u30AB\u30EB\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u8A31\u53EF\u3057\u307E\u3059 (\u660E\u793A\u7684\u306B\u7121\u52B9\u306B\u3059\u308B JMSContext \u306B\u306F\u9069\u7528\u3055\u308C\u307E\u305B\u3093)\u3002
pooled-connection-factory.auto-group=autogroup
pooled-connection-factory.block-on-acknowledge=True \u306F\u78BA\u8A8D\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
pooled-connection-factory.block-on-durable-send=True \u306F\u6C38\u7D9A\u9001\u4FE1\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u8A2D\u5B9A\u3057\u307E\u3059\u3002
pooled-connection-factory.block-on-non-durable-send=True \u306F\u975E\u6C38\u7D9A\u9001\u4FE1\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u8A2D\u5B9A\u3057\u307E\u3059\u3002
pooled-connection-factory.cache-large-message-client=True \u306F\u5927\u5BB9\u91CF\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u3057\u307E\u3059\u3002
pooled-connection-factory.call-failover-timeout=\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u304C\u51E6\u7406\u4E2D\u306E\u6642\u306B\u4F7F\u7528\u3059\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u30DF\u30EA\u79D2)\u3002
pooled-connection-factory.call-timeout=\u547C\u3073\u51FA\u3057\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
pooled-connection-factory.client-failure-check-period=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u554F\u984C\u78BA\u8A8D\u671F\u9593
pooled-connection-factory.client-id=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 id
pooled-connection-factory.compress-large-messages=\u5927\u5BB9\u91CF\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u5727\u7E2E\u3059\u3079\u304D\u304B\u3069\u3046\u304B
pooled-connection-factory.confirmation-window-size=\u78BA\u8A8D\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
pooled-connection-factory.connection-factory=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u5B9A\u7FA9
pooled-connection-factory.connection-load-balancing-policy-class-name=\u30AF\u30E9\u30B9\u30BF\u30FC\u5185\u306E\u69D8\u3005\u306A\u30CE\u30FC\u30C9\u306E\u9593\u3067\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u8CA0\u8377\u5206\u6563\u3092\u884C\u3046\u969B\u306B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u5229\u7528\u53EF\u80FD\u306A\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5074\u306E\u8CA0\u8377\u5206\u6563\u30DD\u30EA\u30B7\u30FC\u3092\u5B9F\u88C5\u3059\u308B\u30AF\u30E9\u30B9\u540D\u3002
pooled-connection-factory.connection-ttl=\u63A5\u7D9A ttl
pooled-connection-factory.connectors=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u5B9A\u7FA9\u3002\u672A\u5B9A\u7FA9\u306E\u5024\u3068\u5408\u308F\u305B\u3066\u3001\u30B3\u30CD\u30AF\u30BF\u30FC\u540D\u3067\u30DE\u30C3\u30D7\u5185\u306B\u4FDD\u5B58\u3055\u308C\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u3092\u66F8\u304D\u8FBC\u3080\u3068\u304D\u306F\u3001\u30B3\u30CD\u30AF\u30BF\u30FC\u540D\u306E\u30EA\u30B9\u30C8\u3092\u6E21\u3059\u3053\u3068\u304C\u53EF\u80FD\u3067\u3059\u3002
pooled-connection-factory.consumer-max-rate=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u6700\u5927\u30EC\u30FC\u30C8
pooled-connection-factory.consumer-window-size=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
pooled-connection-factory.credential-reference=\u30D7\u30FC\u30EB\u3055\u308C\u305F\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3092\u8A8D\u8A3C\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB (\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304B\u3089\u306E)
pooled-connection-factory.credential-reference.store=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3078\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D
pooled-connection-factory.credential-reference.type=\u3053\u306E\u53C2\u7167\u304C\u610F\u5473\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30BF\u30A4\u30D7
pooled-connection-factory.credential-reference.alias=\u4FDD\u5B58\u3055\u308C\u305F\u79D8\u5BC6\u307E\u305F\u306F\u30B9\u30C8\u30A2\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u610F\u5473\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9
pooled-connection-factory.credential-reference.clear-text=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u79D8\u5BC6 (\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB/ \u79D8\u5BC6\u3092\u30B5\u30FC\u30D3\u30B9\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044)
pooled-connection-factory.deserialization-black-list=JMS ObjectMessage \u306E\u30B7\u30EA\u30A2\u30EB\u5316\u3067\u306E\u4F7F\u7528\u304C\u62D2\u5426\u3055\u308C\u308B\u30AF\u30E9\u30B9\u540D\u306E\u30EA\u30B9\u30C8 (\u30B9\u30DA\u30FC\u30B9\u533A\u5207\u308A)\u3002
pooled-connection-factory.deserialization-white-list=JMS ObjectMessage \u306E\u30B7\u30EA\u30A2\u30EB\u5316\u3067\u306E\u4F7F\u7528\u304C\u8A31\u53EF\u3055\u308C\u308B\u30AF\u30E9\u30B9\u540D\u306E\u30EA\u30B9\u30C8 (\u30B9\u30DA\u30FC\u30B9\u533A\u5207\u308A)\u3002
pooled-connection-factory.discovery-group=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30B0\u30EB\u30FC\u30D7\u540D
pooled-connection-factory.discovery-initial-wait-timeout.deprecated=\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u5F71\u97FF\u306F\u306A\u304F\u3001\u3053\u306E\u5C5E\u6027\u306E\u5024\u3092\u8A2D\u5B9A\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u8B66\u544A\u304C\u51FA\u3055\u308C\u307E\u3059\u3002
pooled-connection-factory.discovery-initial-wait-timeout=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u306E\u521D\u671F\u5F85\u6A5F\u6642\u9593\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
pooled-connection-factory.dups-ok-batch-size=dups ok batch size
pooled-connection-factory.enable-amq1-prefix=\u30A2\u30C9\u30EC\u30B9\u3067 ActiveMQ 1.5.x \u63A5\u982D\u8F9E\u306E\u4F7F\u7528\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
pooled-connection-factory.enlistment-trace=IronJacamar \u304C\u3053\u306E pooled-connection-factory \u306E\u30A8\u30F3\u30EA\u30B9\u30C8\u30E1\u30F3\u30C8\u30C8\u30EC\u30FC\u30B9\u3092\u8A18\u9332\u3059\u308B\u3053\u3068\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u306F\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u672A\u5B9A\u7FA9\u3067\u3042\u308A\u3001\u52D5\u4F5C\u306F ironjacamar.disable_enlistment_trace \u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u5B58\u5728\u306B\u3088\u3063\u3066\u5DE6\u53F3\u3055\u308C\u307E\u3059\u3002
pooled-connection-factory.entries=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u306B\u306A\u308B\u3079\u304D jndi \u540D
pooled-connection-factory.failover-on-initial-connection=True \u306F\u521D\u671F\u63A5\u7D9A\u6642\u306B\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u3057\u307E\u3059\u3002
pooled-connection-factory.failover-on-server-shutdown.deprecated=\u975E\u63A8\u5968\u3002\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u5F71\u97FF\u306F\u306A\u304F\u3001\u3053\u306E\u5C5E\u6027\u306E\u5024\u3092\u8A2D\u5B9A\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u8B66\u544A\u304C\u51FA\u3055\u308C\u307E\u3059\u3002
pooled-connection-factory.failover-on-server-shutdown=True \u306F\u30B5\u30FC\u30D0\u30FC\u306E\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u6642\u306B\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u3057\u307E\u3059\u3002
pooled-connection-factory.group-id=\u30B0\u30EB\u30FC\u30D7 id
pooled-connection-factory.ha=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u304C\u9AD8\u53EF\u7528\u6027\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u304B\u3069\u3046\u304B
pooled-connection-factory.initial-connect-attempts=\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u3067\u521D\u671F\u63A5\u7D9A\u3092\u8A66\u884C\u3059\u308B\u56DE\u6570\u3002
pooled-connection-factory.initial-message-packet-size=\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u7D4C\u7531\u3067\u4F5C\u6210\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u521D\u671F\u30B5\u30A4\u30BA
pooled-connection-factory.jndi-params=\u53D7\u4FE1\u63A5\u7D9A\u306E\u30C7\u30B9\u30C6\u30A3\u30CD\u30FC\u30B7\u30E7\u30F3\u3092\u7A81\u304D\u6B62\u3081\u308B\u305F\u3081\u306B\u5229\u7528\u3059\u308BJNDI \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC
pooled-connection-factory.managed-connection-pool=\u3053\u306E pooled-connection-factory \u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u7BA1\u7406\u3055\u308C\u305F\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30AF\u30E9\u30B9\u540D\u3002
pooled-connection-factory.max-pool-size=\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B5\u30A4\u30BA
pooled-connection-factory.max-retry-interval=\u518D\u8A66\u884C\u306E\u6700\u5927\u9593\u9694
pooled-connection-factory.min-large-message-size=\u5927\u5BB9\u91CF\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6700\u5C0F\u30B5\u30A4\u30BA
pooled-connection-factory.min-pool-size=\u30D7\u30FC\u30EB\u306E\u6700\u5C0F\u30B5\u30A4\u30BA
pooled-connection-factory.password=\u3053\u306E\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u3068\u3042\u308F\u305B\u3066\u5229\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002\u3053\u308C\u306F\u3001\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u304C\u30EA\u30E2\u30FC\u30C8\u30DB\u30B9\u30C8\u3092\u53C2\u7167\u3057\u3066\u3044\u308B\u5834\u5408\u306B\u306E\u307F\u5FC5\u8981\u3067\u3059\u3002
pooled-connection-factory.pre-acknowledge=True \u306F\u4E8B\u524D\u78BA\u8A8D\u3092\u884C\u3044\u307E\u3059\u3002
pooled-connection-factory.producer-max-rate=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306E\u6700\u5927\u30EC\u30FC\u30C8
pooled-connection-factory.producer-window-size=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306E\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
pooled-connection-factory.protocol-manager-factory=\u3053\u306E\u30D7\u30FC\u30EB\u3055\u308C\u305F\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30ED\u30C8\u30B3\u30EB\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3002
pooled-connection-factory.rebalance-connections=\u30AF\u30E9\u30B9\u30BF\u30FC\u30C8\u30DD\u30ED\u30B8\u30FC\u304C\u5909\u66F4\u3055\u308C\u305F\u3068\u304D\u306B\u30A4\u30F3\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u3092\u518D\u8ABF\u6574\u3057\u307E\u3059\u3002
pooled-connection-factory.reconnect-attempts=\u518D\u63A5\u7D9A\u306E\u8A66\u884C\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u3001\u30D7\u30FC\u30EB\u3055\u308C\u305F\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u518D\u63A5\u7D9A\u3092\u7121\u9650\u306B\u8A66\u884C\u3057\u307E\u3059\u3002
pooled-connection-factory.remove=\u7BA1\u7406\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u524A\u9664
pooled-connection-factory.retry-interval-multiplier=\u518D\u8A66\u884C\u9593\u9694\u306E\u4E57\u6570
pooled-connection-factory.retry-interval=\u518D\u8A66\u884C\u306E\u9593\u9694
pooled-connection-factory.scheduled-thread-pool-max-size=\u4E88\u7D04\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B5\u30A4\u30BA
pooled-connection-factory.setup-attempts=MDB \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3092\u8A2D\u5B9A\u3059\u308B\u56DE\u6570
pooled-connection-factory.setup-interval=MDB \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u8A2D\u5B9A\u3092\u8A66\u884C\u3059\u308B\u969B\u306E\u9593\u9694
pooled-connection-factory.statistics-enabled=\u5B9F\u884C\u6642\u7D71\u8A08\u304C\u6709\u52B9\u3067\u3042\u308B\u304B\u3069\u3046\u304B\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
pooled-connection-factory.thread-pool-max-size=\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B5\u30A4\u30BA
pooled-connection-factory.transaction-batch-size=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA
pooled-connection-factory.transaction=\u3053\u306E\u30D7\u30FC\u30EB\u3055\u308C\u305F\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306B\u3088\u308A\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u30BF\u30A4\u30D7 (LOCAL\u3001NONE\u3001\u307E\u305F\u306F XA\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F XA)\u3002
pooled-connection-factory.use-auto-recovery=True \u306F\u81EA\u52D5\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
pooled-connection-factory.use-global-pools=True \u306F\u30B0\u30ED\u30FC\u30D0\u30EB\u30D7\u30FC\u30EB\u3092\u4F7F\u3044\u307E\u3059\u3002
pooled-connection-factory.use-jndi=JNDI \u3092\u4F7F\u3044\u53D7\u4FE1\u63A5\u7D9A\u306E\u30C7\u30B9\u30C6\u30A3\u30CD\u30FC\u30B7\u30E7\u30F3\u3092\u7A81\u304D\u6B62\u3081\u307E\u3059\u3002
pooled-connection-factory.use-local-tx=\u53D7\u4FE1\u30BB\u30C3\u30B7\u30E7\u30F3\u306B\u30ED\u30FC\u30AB\u30EB\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u5229\u7528
pooled-connection-factory.use-topology-for-load-balancing=\u30AF\u30E9\u30B9\u30BF\u30FC\u304B\u3089\u30C8\u30DD\u30ED\u30B8\u30FC\u60C5\u5831\u3092\u4F7F\u7528\u3057\u3066\u63A5\u7D9A\u3059\u308B\u304B\u3069\u3046\u304B\u3002false \u306B\u8A2D\u5B9A\u3055\u308C\u305F\u5834\u5408\u306F\u3001\u6700\u521D\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u307F\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
pooled-connection-factory.user=\u3053\u306E\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u3068\u3042\u308F\u305B\u3066\u5229\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30E6\u30FC\u30B6\u30FC\u540D\u3002\u3053\u308C\u306F\u3001\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u304C\u30EA\u30E2\u30FC\u30C8\u30DB\u30B9\u30C8\u3092\u53C2\u7167\u3057\u3066\u3044\u308B\u5834\u5408\u306B\u306E\u307F\u5FC5\u8981\u3067\u3059\u3002
pooled-connection-factory=\u7BA1\u7406\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u5B9A\u7FA9
queue.add=\u30B3\u30A2\u30AD\u30E5\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C
queue.change-message-priority.message-id=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
queue.change-message-priority.new-priority=\u65B0\u3057\u3044\u512A\u5148\u9806\u4F4D (0-9)
queue.change-message-priority.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u9806\u4F4D\u304C\u5909\u66F4\u3055\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false
queue.change-message-priority=\u6307\u5B9A\u306E message-id \u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u9806\u4F4D\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
queue.change-messages-priority.filter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
queue.change-messages-priority.new-priority=\u65B0\u3057\u3044\u512A\u5148\u9806\u4F4D (0-9)
queue.change-messages-priority.reply=\u5909\u66F4\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
queue.change-messages-priority=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u9806\u4F4D\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
queue.consumer-count=\u3053\u306E\u30AD\u30E5\u30FC\u3088\u308A\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u6D88\u8CBB\u3059\u308B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u6570
queue.count-messages.filter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
queue.count-messages=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u4E00\u81F4\u3059\u308B\u30AD\u30E5\u30FC\u306B\u3042\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570\u3092\u8FD4\u3057\u307E\u3059\u3002
queue.dead-letter-address=\u30AD\u30E5\u30FC\u306E\u30C7\u30C3\u30C9\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u9001\u4ED8\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u3002
queue.delivering-count=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u914D\u4FE1\u3057\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
queue.durable=\u30AD\u30E5\u30FC\u304C\u6C38\u7D9A\u7684\u304B\u5B9A\u7FA9\u3057\u307E\u3059\u3002
queue.elements.address=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u9001\u4FE1\u3055\u308C\u305F\u30A2\u30C9\u30EC\u30B9\u3002
queue.elements.durable=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u6C38\u7D9A\u7684 (durable) \u3067\u3042\u308B\u304B\u3069\u3046\u304B\u3002
queue.elements.expiration=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u671F\u9650\u5207\u308C\u6642\u9593\u3002
queue.elements.messageID=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
queue.elements.priority=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u5EA6\u3002\u5024\u306E\u7BC4\u56F2\u306F 0 (\u512A\u5148\u5EA6\u304C\u4F4E\u3044) \u304B\u3089 9 (\u512A\u5148\u5EA6\u304C\u9AD8\u3044) \u3067\u3059\u3002
queue.elements.type=\u30E1\u30C3\u30BB\u30FC\u30B8\u30BF\u30A4\u30D7\u30020 = \u30C7\u30D5\u30A9\u30EB\u30C8\u30012 = \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30013 = \u30C6\u30AD\u30B9\u30C8\u30014 = \u30D0\u30A4\u30C8\u30015 = \u30DE\u30C3\u30D7\u30016 = \u30B9\u30C8\u30EA\u30FC\u30E0
queue.elements.userID=userID - \u3053\u308C\u306F\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u7279\u5B9A\u7528\u306B\u8A2D\u5B9A\u53EF\u80FD\u306A UUID \u3092\u6307\u5B9A\u3059\u308B\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30E6\u30FC\u30B6\u30FC\u3002
queue.expire-message.message-id=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
queue.expire-message.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6709\u52B9\u671F\u9650\u304C\u5207\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false\u3002
queue.expire-message=\u6307\u5B9A\u306E message-id \u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u671F\u9650\u5207\u308C\u306B\u3057\u307E\u3059\u3002
queue.expire-messages.filter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
queue.expire-messages.reply=\u6709\u52B9\u671F\u9650\u306E\u5207\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
queue.expire-messages=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u4E00\u81F4\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u671F\u9650\u5207\u308C\u306B\u3057\u307E\u3059\u3002
queue.expiry-address=\u30AD\u30E5\u30FC\u306E\u671F\u9650\u5207\u308C\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u9001\u4ED8\u3059\u308B\u30A2\u30C9\u30EC\u30B9
queue.filter=\u30AD\u30E5\u30FC\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u5B9A\u7FA9\u3002\u672A\u5B9A\u7FA9\u3042\u308B\u3044\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u306F\u5168\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u30DE\u30C3\u30C1\u3057\u307E\u3059\u3002
queue.id=\u30AD\u30E5\u30FC\u306E id
queue.list-consumers-as-json.reply=\u3059\u3079\u3066\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u30EA\u30B9\u30C8\u304C\u542B\u307E\u308C\u308B JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3002
queue.list-consumers-as-json=\u30AD\u30E5\u30FC\u306E\u65E2\u5B58\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3092\u3059\u3079\u3066JSON \u5F62\u5F0F\u3067\u6587\u5B57\u5217\u3068\u3057\u3066\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
queue.list-consumers.reply=\u30AD\u30E5\u30FC\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3092\u8AAC\u660E\u3059\u308B\u5404\u8981\u7D20\u306E\u4E00\u89A7\u3002
queue.list-consumers=\u30AD\u30E5\u30FC\u306E\u65E2\u5B58\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
queue.list-delivering-messages-as-json.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u304B\u3089\u305D\u308C\u3089\u306E\u5024\u3078\u306E\u30DE\u30C3\u30D7\u3067\u3042\u308B\u30EA\u30B9\u30C8\u3092\u8868\u3059 JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3002
queue.list-delivering-messages-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u73FE\u5728\u914D\u4FE1\u3055\u308C\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30EA\u30B9\u30C8
queue.list-delivering-messages.consumerName=\u30E1\u30C3\u30BB\u30FC\u30B8\u914D\u4FE1\u5148\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u540D\u524D\u3002
queue.list-delivering-messages.elements=\u914D\u4FE1\u4E2D\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3002
queue.list-delivering-messages.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u304B\u3089\u305D\u308C\u3089\u306E\u5024\u3078\u306E\u30DE\u30C3\u30D7\u3067\u3042\u308B\u30EA\u30B9\u30C8\u3002
queue.list-delivering-messages=\u73FE\u5728\u914D\u4FE1\u4E2D\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
queue.list-message-counter-as-html.reply=HTML \u5F62\u5F0F\u306E\u6587\u5B57\u5217
queue.list-message-counter-as-html=HTML \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u3092\u4E00\u89A7\u8868\u793A
queue.list-message-counter-as-json.reply=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217
queue.list-message-counter-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u3092\u4E00\u89A7\u8868\u793A
queue.list-message-counter-history-as-html.reply=HTML \u5F62\u5F0F\u306E\u6587\u5B57\u5217
queue.list-message-counter-history-as-html=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u5C65\u6B74\u3092\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002
queue.list-message-counter-history-as-json.reply=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217
queue.list-message-counter-history-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u5C65\u6B74\u3092\u4E00\u89A7\u8868\u793A
queue.list-message-counter-history.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u5C65\u6B74\u306E\u8A73\u7D30
queue.list-message-counter-history=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u5C65\u6B74\u3092\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002
queue.list-message-counter.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u306E\u8A73\u7D30
queue.list-message-counter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u306E\u8A73\u7D30\u3092\u4E00\u89A7\u8868\u793A
queue.list-messages-as-json.filter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
queue.list-messages-as-json.reply=\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u4E00\u81F4\u3059\u308B\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u542B\u307E\u308C\u308B JSON \u306E\u6587\u5B57\u5217\u3002
queue.list-messages-as-json=\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u30DE\u30C3\u30C1\u3059\u308B\u30AD\u30E5\u30FC\u306B\u3042\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3059\u3079\u3066\u3092\u4E00\u89A7\u8868\u793A\u3057\u3001\u305D\u308C\u3089\u3092 JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3067\u8FD4\u3057\u307E\u3059\u3002
queue.list-messages.address=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u9001\u4FE1\u3055\u308C\u305F\u30A2\u30C9\u30EC\u30B9\u3002
queue.list-messages.durable=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u6C38\u7D9A\u7684 (durable) \u3067\u3042\u308B\u304B\u3069\u3046\u304B\u3002
queue.list-messages.expiration=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u671F\u9650\u5207\u308C\u6642\u9593\u3002
queue.list-messages.filter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
queue.list-messages.messageID=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
queue.list-messages.priority=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u5EA6\u3002\u5024\u306E\u7BC4\u56F2\u306F 0 (\u512A\u5148\u5EA6\u304C\u4F4E\u3044) \u304B\u3089 9 (\u512A\u5148\u5EA6\u304C\u9AD8\u3044) \u3067\u3059\u3002
queue.list-messages.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u304B\u3089\u305D\u308C\u3089\u306E\u5024\u3078\u306E\u30DE\u30C3\u30D7\u3067\u3042\u308B\u30EA\u30B9\u30C8\u3002
queue.list-messages.timestamp=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3002\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u306F\u3001ActiveMQ \u30B5\u30FC\u30D0\u30FC\u304C\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u51E6\u7406\u3059\u308B\u6642\u9593\u306B\u3042\u305F\u308A\u307E\u3059\u3002
queue.list-messages.type=\u30E1\u30C3\u30BB\u30FC\u30B8\u30BF\u30A4\u30D7\u30020 = \u30C7\u30D5\u30A9\u30EB\u30C8\u30012 = \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30013 = \u30C6\u30AD\u30B9\u30C8\u30014 = \u30D0\u30A4\u30C8\u30015 = \u30DE\u30C3\u30D7\u30016 = \u30B9\u30C8\u30EA\u30FC\u30E0
queue.list-messages.userID=userID - \u3053\u308C\u306F\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u7279\u5B9A\u7528\u306B\u8A2D\u5B9A\u53EF\u80FD\u306A UUID \u3092\u6307\u5B9A\u3059\u308B\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30E6\u30FC\u30B6\u30FC\u3002
queue.list-messages=\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u30DE\u30C3\u30C1\u3059\u308B\u30AD\u30E5\u30FC\u306E\u4E2D\u306B\u3042\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
queue.list-scheduled-messages-as-json.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u304B\u3089\u305D\u308C\u3089\u306E\u5024\u3078\u306E\u30DE\u30C3\u30D7\u3067\u3042\u308B\u30EA\u30B9\u30C8\u3092\u8868\u3059 JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3002
queue.list-scheduled-messages-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u914D\u4FE1\u304C\u4E88\u5B9A\u3055\u308C\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u4E00\u89A7\u8868\u793A
queue.list-scheduled-messages.address=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u9001\u4FE1\u3055\u308C\u305F\u30A2\u30C9\u30EC\u30B9\u3002
queue.list-scheduled-messages.durable=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u6C38\u7D9A\u7684 (durable) \u3067\u3042\u308B\u304B\u3069\u3046\u304B\u3002
queue.list-scheduled-messages.expiration=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u671F\u9650\u5207\u308C\u6642\u9593\u3002
queue.list-scheduled-messages.messageID=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
queue.list-scheduled-messages.priority=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u5EA6\u3002\u5024\u306E\u7BC4\u56F2\u306F 0 (\u512A\u5148\u5EA6\u304C\u4F4E\u3044) \u304B\u3089 9 (\u512A\u5148\u5EA6\u304C\u9AD8\u3044) \u3067\u3059\u3002
queue.list-scheduled-messages.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u304B\u3089\u305D\u308C\u3089\u306E\u5024\u3078\u306E\u30DE\u30C3\u30D7\u3067\u3042\u308B\u30EA\u30B9\u30C8\u3002
queue.list-scheduled-messages.timestamp=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3002\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u306F\u3001ActiveMQ \u30B5\u30FC\u30D0\u30FC\u304C\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u51E6\u7406\u3059\u308B\u6642\u9593\u306B\u3042\u305F\u308A\u307E\u3059\u3002
queue.list-scheduled-messages.type=\u30E1\u30C3\u30BB\u30FC\u30B8\u30BF\u30A4\u30D7\u30020 = \u30C7\u30D5\u30A9\u30EB\u30C8\u30012 = \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30013 = \u30C6\u30AD\u30B9\u30C8\u30014 = \u30D0\u30A4\u30C8\u30015 = \u30DE\u30C3\u30D7\u30016 = \u30B9\u30C8\u30EA\u30FC\u30E0
queue.list-scheduled-messages.userID=userID - \u3053\u308C\u306F\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u7279\u5B9A\u7528\u306B\u8A2D\u5B9A\u53EF\u80FD\u306A UUID \u3092\u6307\u5B9A\u3059\u308B\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30E6\u30FC\u30B6\u30FC\u3002
queue.list-scheduled-messages=\u914D\u4FE1\u304C\u4E88\u5B9A\u3055\u308C\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u4E00\u89A7
queue.message-count=\u73FE\u5728\u3053\u306E\u30AD\u30E5\u30FC\u306B\u5B58\u5728\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
queue.message.address=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u9001\u4FE1\u3055\u308C\u305F\u30A2\u30C9\u30EC\u30B9\u3002
queue.message.durable=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u6C38\u7D9A\u7684 (durable) \u3067\u3042\u308B\u304B\u3069\u3046\u304B\u3002
queue.message.expiration=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u671F\u9650\u5207\u308C\u6642\u9593\u3002
queue.message.messageID=\u30E1\u30C3\u30BB\u30FC\u30B8 id
queue.message.priority=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u5EA6\u3002\u5024\u306E\u7BC4\u56F2\u306F 0 (\u512A\u5148\u5EA6\u304C\u4F4E\u3044) \u304B\u3089 9 (\u512A\u5148\u5EA6\u304C\u9AD8\u3044) \u3067\u3059\u3002
queue.message.timestamp=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3002\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u306F\u3001ActiveMQ \u30B5\u30FC\u30D0\u30FC\u304C\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u51E6\u7406\u3059\u308B\u6642\u9593\u306B\u3042\u305F\u308A\u307E\u3059\u3002
queue.message.type=Tmessage type. 0 = Default; 2 = Object; 3 = Text; 4 = Bytes; 5 = Map; 6 = Stream
queue.message.userID=userID - \u3053\u308C\u306F\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u7279\u5B9A\u7528\u306B\u8A2D\u5B9A\u53EF\u80FD\u306A UUID \u3092\u6307\u5B9A\u3059\u308B\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30E6\u30FC\u30B6\u30FC\u3002
queue.messages-added=\u3053\u306E\u30AD\u30E5\u30FC\u304C\u4F5C\u6210\u3055\u308C\u3066\u304B\u3089\u8FFD\u52A0\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
queue.move-message.message-id=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
queue.move-message.other-queue-name=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u79FB\u52D5\u5148\u30AD\u30E5\u30FC\u306E\u540D\u524D
queue.move-message.reject-duplicates=\u91CD\u8907\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u7279\u5B9A\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u62D2\u5426\u3059\u308B\u304B\u3069\u3046\u304B\u3002
queue.move-message.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u79FB\u52D5\u3055\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false
queue.move-message=\u6307\u5B9A\u306E message-id \u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u5225\u306E\u30AD\u30E5\u30FC\u306B\u79FB\u52D5\u3057\u307E\u3059\u3002
queue.move-messages.filter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
queue.move-messages.other-queue-name=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u79FB\u52D5\u5148\u30AD\u30E5\u30FC\u306E\u540D\u524D
queue.move-messages.reject-duplicates=\u91CD\u8907\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u7279\u5B9A\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u62D2\u5426\u3059\u308B\u304B\u3069\u3046\u304B\u3002
queue.move-messages.reply=\u79FB\u52D5\u3057\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
queue.move-messages=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u5225\u306E\u30AD\u30E5\u30FC\u306B\u79FB\u52D5\u3057\u307E\u3059\u3002
queue.name=\u4E00\u610F\u306E\u30AD\u30E5\u30FC\u540D
queue.pause=\u30AD\u30E5\u30FC\u306E\u4E00\u6642\u505C\u6B62
queue.paused=\u30AD\u30E5\u30FC\u304C\u4E00\u6642\u505C\u6B62\u3055\u308C\u308B\u304B\u3069\u3046\u304B
queue.queue-address=\u30AD\u30E5\u30FC\u30A2\u30C9\u30EC\u30B9\u306F\u3001\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u3069\u306E\u30A2\u30C9\u30EC\u30B9\u3092\u4F7F\u7528\u3059\u308B\u304B\u5B9A\u7FA9\u3057\u307E\u3059\u3002
queue.remove-message.message-id=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
queue.remove-message.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u524A\u9664\u3055\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false
queue.remove-message=\u6307\u5B9A\u306E message-id \u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u524A\u9664\u3057\u307E\u3059\u3002
queue.remove-messages.filter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
queue.remove-messages.reply=\u524A\u9664\u3057\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
queue.remove-messages=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u4E00\u81F4\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30AD\u30E5\u30FC\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u3002
queue.remove=\u65E2\u5B58\u30AD\u30E5\u30FC\u306E\u524A\u9664\u64CD\u4F5C
queue.reset-message-counter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u306E\u30EA\u30BB\u30C3\u30C8
queue.resume=\u30AD\u30E5\u30FC\u306E\u518D\u958B
queue.routing-type=\u30AD\u30E5\u30FC\u306E\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u30BF\u30A4\u30D7\u3002
queue.scheduled-count=\u3053\u306E\u30AD\u30E5\u30FC\u306B\u5B58\u5728\u3059\u308B\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
queue.send-message-to-dead-letter-address.message-id=\u30E1\u30C3\u30BB\u30FC\u30B8 ID\u3002
queue.send-message-to-dead-letter-address.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3055\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false
queue.send-message-to-dead-letter-address=\u6307\u5B9A\u306E message-id \u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3001\u3053\u306E\u30AD\u30E5\u30FC\u306E\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3057\u307E\u3059\u3002
queue.send-messages-to-dead-letter-address.filter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u672A\u5B9A\u7FA9\u307E\u305F\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
queue.send-messages-to-dead-letter-address.reply=\u9001\u4FE1\u6E08\u307F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
queue.send-messages-to-dead-letter-address=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3001\u3053\u306E\u30AD\u30E5\u30FC\u306E\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3057\u307E\u3059\u3002
queue.temporary=\u30AD\u30E5\u30FC\u304C\u4E00\u6642\u7684\u306A\u3082\u306E\u304B\u3069\u3046\u304B
queue=\u30AD\u30E5\u30FC
remote-acceptor=ActiveMQ \u30B5\u30FC\u30D0\u30FC\u3078\u30EA\u30E2\u30FC\u30C8\u63A5\u7D9A\u3067\u304D\u308B\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
remote-connector=\u30EA\u30E2\u30FC\u30C8\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u5229\u7528\u3057\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
role.consume=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u306B\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u305F\u30AD\u30E5\u30FC\u304B\u3089\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u6D88\u8CBB\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
role.create-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u4F5C\u6210\u3067\u304D\u307E\u3059\u3002
role.create-non-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u4E00\u6642\u7684\u306A\u30AD\u30E5\u30FC\u3092\u4F5C\u6210\u3067\u304D\u307E\u3059\u3002
role.delete-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u524A\u9664\u3067\u304D\u307E\u3059\u3002
role.delete-non-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u4E00\u6642\u7684\u306A\u30AD\u30E5\u30FC\u3092\u524A\u9664\u3067\u304D\u307E\u3059\u3002
role.manage=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u3001\u7BA1\u7406\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u7BA1\u7406\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3059\u308B\u3053\u3068\u306B\u3088\u308A\u3001\u7BA1\u7406\u64CD\u4F5C\u3092\u547C\u3073\u51FA\u3059\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
role.name=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u540D\u3002
role.send= \u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u9001\u4FE1\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
role=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u3002
runtime-queue=\u30E9\u30F3\u30BF\u30A4\u30E0\u30AD\u30E5\u30FC
security-role.add=\u65B0\u898F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u306E\u8FFD\u52A0
security-role.consume=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u306B\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u305F\u30AD\u30E5\u30FC\u304B\u3089\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u6D88\u8CBB\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
security-role.create-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u4F5C\u6210\u3067\u304D\u307E\u3059\u3002
security-role.create-non-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u4E00\u6642\u7684\u306A\u30AD\u30E5\u30FC\u3092\u4F5C\u6210\u3067\u304D\u307E\u3059\u3002
security-role.delete-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u524A\u9664\u3067\u304D\u307E\u3059\u3002
security-role.delete-non-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u4E00\u6642\u7684\u306A\u30AD\u30E5\u30FC\u3092\u524A\u9664\u3067\u304D\u307E\u3059\u3002
security-role.manage=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u3001\u7BA1\u7406\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u7BA1\u7406\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3059\u308B\u3053\u3068\u306B\u3088\u308A\u3001\u7BA1\u7406\u64CD\u4F5C\u3092\u547C\u3073\u51FA\u3059\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
security-role.name=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u540D\u3002
security-role.remove=\u65E2\u5B58\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u3092\u524A\u9664
security-role.send= \u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u306F\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u9001\u4FE1\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
security-role=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u3002
security-setting.add=\u65B0\u898F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u8A2D\u5B9A\u3092\u8FFD\u52A0
security-setting.remove=\u65E2\u5B58\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u8A2D\u5B9A\u3092\u524A\u9664
security-setting.role=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u3002
security-setting=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u8A2D\u5B9A\u3067\u3001\u30A2\u30C9\u30EC\u30B9\u3092\u30D9\u30FC\u30B9\u306B\u30AD\u30E5\u30FC\u306B\u5BFE\u3057\u3066\u6A29\u9650\u3092\u5B9A\u7FA9\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
server-id=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D0\u30FC ID\u3002
socket-binding=\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u53C2\u7167
transport-config.param.add=\u65B0\u898F\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C
transport-config.param.optional=\u4EFB\u610F\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC
transport-config.param.remove=\u65E2\u5B58\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u524A\u9664\u64CD\u4F5C
transport-config.param.value=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u5024
transport-config.param=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC
legacy=HornetQ \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30EC\u30AC\u30B7\u30FC\u30EA\u30BD\u30FC\u30B9

