config-source=ConfigSource \u306F\u8A2D\u5B9A\u5024\u306E\u30BD\u30FC\u30B9\u3092\u63D0\u4F9B\u3057\u307E\u3059\u3002
config-source.add=Config Source \u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002\u8A2D\u5B9A\u306E\u30BD\u30FC\u30B9\u306F config-source \u306E\u5C5E\u6027\u306B\u3088\u3063\u3066\u5224\u65AD\u3055\u308C\u307E\u3059 (\u30AF\u30E9\u30B9\u306F\u65B0\u3057\u3044 ConfigSource \u5B9F\u88C5\u3092\u63D0\u4F9B\u3057\u3001\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306F WildFly \u7BA1\u7406\u30E2\u30C7\u30EB\u306B\u8A2D\u5B9A\u5024\u3092\u4FDD\u5B58\u3059\u308B\u306A\u3069)\u3002
config-source.ordinal=\u8A2D\u5B9A\u30BD\u30FC\u30B9\u306E\u5E8F\u6570\u5024
config-source.properties=\u3053\u306E\u8A2D\u5B9A\u30BD\u30FC\u30B9\u306E\u305F\u3081\u306B\u8A2D\u5B9A\u3055\u308C\u3001WildFly \u7BA1\u7406\u30E2\u30C7\u30EB\u306B\u76F4\u63A5\u683C\u7D0D\u3055\u308C\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
config-source.dir=\u3053\u306E\u8A2D\u5B9A\u30BD\u30FC\u30B9\u306E\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306B\u30B9\u30AD\u30E3\u30F3\u3055\u308C\u305F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC (\u30D5\u30A1\u30A4\u30EB\u540D\u304C\u30AD\u30FC\u3067\u3001\u30D5\u30A1\u30A4\u30EB\u306E\u5185\u5BB9\u304C\u5024)\u3002
config-source.dir.path=\u30B9\u30AD\u30E3\u30F3\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3078\u306E\u30D1\u30B9\u3002\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3059\u308B relative-to \u5C5E\u6027\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u9650\u308A\u3001\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u6271\u308F\u308C\u307E\u3059\u3002\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u6271\u308F\u308C\u308B\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u306E\u5024\u306B\u3088\u3063\u3066\u6307\u5B9A\u3055\u308C\u308B\u5B9F\u969B\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u30D1\u30B9\u540D\u306F\u6B21\u306E\u3088\u3046\u306B\u5224\u65AD\u3055\u308C\u307E\u3059\u3002\u5024\u304C\u3059\u3067\u306B\u7D76\u5BFE\u5024\u3067\u3042\u308B\u5834\u5408\u306F\u3001\u305D\u306E\u5024\u304C\u76F4\u63A5\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u305D\u306E\u4ED6\u306E\u5834\u5408\u306F\u3001\u30E9\u30F3\u30BF\u30A4\u30E0\u30D1\u30B9\u540D\u306F\u30B7\u30B9\u30C6\u30E0\u306B\u4F9D\u5B58\u3057\u3066\u89E3\u6C7A\u3055\u308C\u307E\u3059\u3002UNIX \u30B7\u30B9\u30C6\u30E0\u3067\u306F\u3001\u76F8\u5BFE\u30D1\u30B9\u306F\u73FE\u5728\u306E\u30E6\u30FC\u30B6\u30FC\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3092\u57FA\u306B\u3057\u3066\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002Microsoft Windows \u30B7\u30B9\u30C6\u30E0\u3067\u306F\u3001\u30D1\u30B9\u540D\u3092\u540D\u524D\u3068\u3059\u308B\u30C9\u30E9\u30A4\u30D6\u306E\u73FE\u5728\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u304C\u3042\u308C\u3070\u305D\u308C\u3092\u57FA\u306B\u3057\u3066\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002\u306A\u3044\u5834\u5408\u306F\u3001\u73FE\u5728\u306E\u30E6\u30FC\u30B6\u30FC\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3092\u57FA\u306B\u3057\u3066\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002
config-source.dir.relative-to=\u4EE5\u524D\u306B\u540D\u524D\u6307\u5B9A\u3055\u308C\u305F\u30D1\u30B9\u306E\u540D\u524D\u3001\u3042\u308B\u3044\u306F\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u4F9B\u3057\u305F\u6A19\u6E96\u30D1\u30B9\u306E 1 \u3064\u3002'relative-to' \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001'path' \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3057\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u4F9B\u3059\u308B\u6A19\u6E96\u30D1\u30B9\u306F\u4EE5\u4E0B\u306E\u901A\u308A\u3067\u3059\u3002jboss.home - JBoss AS \u30C7\u30A3\u30B9\u30C8\u30EA\u30D3\u30E5\u30FC\u30B7\u30E7\u30F3\u306E\u30EB\u30FC\u30C8\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002user.home - \u30E6\u30FC\u30B6\u30FC\u306E\u30DB\u30FC\u30E0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002user.dir - \u30E6\u30FC\u30B6\u30FC\u306E\u73FE\u5728\u4F5C\u696D\u4E2D\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002java.home - java \u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u8A2D\u5B9A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002jboss.server.base.dir - \u5404\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30EB\u30FC\u30C8\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002jboss.server.data.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u6C38\u7D9A\u30C7\u30FC\u30BF\u306E\u30D5\u30A1\u30A4\u30EB\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002jboss.server.log.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u306E\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002jboss.server.tmp.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u4E00\u6642\u7684\u306A\u30D5\u30A1\u30A4\u30EB\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002jboss.domain.servers.dir - \u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u500B\u5225\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u696D\u30A8\u30EA\u30A2\u3092\u4F5C\u6210\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u3002
config-source.class=\u30ED\u30FC\u30C9\u3059\u308B\u8A2D\u5B9A\u30BD\u30FC\u30B9\u306E\u30AF\u30E9\u30B9
config-source.class.module=\u30ED\u30FC\u30C9\u3059\u308B\u8A2D\u5B9A\u30BD\u30FC\u30B9\u306E\u30E2\u30B8\u30E5\u30FC\u30EB
config-source.class.name=\u30ED\u30FC\u30C9\u3059\u308B\u8A2D\u5B9A\u30BD\u30FC\u30B9\u306E\u30AF\u30E9\u30B9\u306E\u540D\u524D
config-source.remove=\u8A2D\u5B9A\u30BD\u30FC\u30B9\u306E\u524A\u9664
config-source-provider=\u8A2D\u5B9A\u30BD\u30FC\u30B9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306F\u3001\u8907\u6570\u306E\u8A2D\u5B9A\u30BD\u30FC\u30B9\u306B\u65B0\u3057\u3044\u5B9F\u88C5\u3092\u767B\u9332\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002
config-source-provider.add=\u8A2D\u5B9A\u30BD\u30FC\u30B9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u8FFD\u52A0
config-source-provider.class=\u30ED\u30FC\u30C9\u3059\u308B ConfigSourceProvider \u306E\u30AF\u30E9\u30B9
config-source-provider.class.module=\u30ED\u30FC\u30C9\u3059\u308B\u8A2D\u5B9A\u30BD\u30FC\u30B9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30E2\u30B8\u30E5\u30FC\u30EB
config-source-provider.class.name=\u30ED\u30FC\u30C9\u3059\u308B\u8A2D\u5B9A\u30BD\u30FC\u30B9\u306E\u30AF\u30E9\u30B9\u306E\u540D\u524D
config-source-provider.remove=\u8A2D\u5B9A\u30BD\u30FC\u30B9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u524A\u9664
microprofile-config-smallrye=SmallRye \u3067\u306E Eclipse MicroProfile Config \u306E WildFly \u62E1\u5F35
microprofile-config-smallrye.add=\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u8FFD\u52A0
microprofile-config-smallrye.remove=\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u524A\u9664

