config-source=ConfigSource fornece uma origem para valores de configura\u00E7\u00E3o.
config-source.add=Adicione uma origem de configura\u00E7\u00E3o. A origem da configura\u00E7\u00E3o \u00E9 determinada pelos atributos de config-source (classe para fornecer uma nova implementa\u00E7\u00E3o de ConfigSource, propriedades para armazenar valores de configura\u00E7\u00E3o no modelo de gerenciamento do WildFly etc.)
config-source.ordinal=Valor ordinal para a origem da configura\u00E7\u00E3o
config-source.properties=Propriedades configuradas para essa origem de configura\u00E7\u00E3o e armazenadas diretamente no modelo de gerenciamento do WildFly.
config-source.dir=O diret\u00F3rio que \u00E9 verificado para propriedades de configura\u00E7\u00E3o para essa origem de configura\u00E7\u00E3o (nomes de arquivos s\u00E3o chaves, conte\u00FAdos de arquivo s\u00E3o valores)
config-source.dir.path=O caminho do diret\u00F3rio a ser verificado. Tratado como um caminho absoluto, a n\u00E3o ser que o atributo "relative-to" seja especificado. Nesse caso, o valor ser\u00E1 tratado como relativo \u00E0quele caminho. Se tratado como um caminho absoluto, o nome do caminho do tempo de execu\u00E7\u00E3o real especificado pelo valor desse atributo ser\u00E1 determinado da seguinte maneira: se o valor j\u00E1 for absoluto, ent\u00E3o, ser\u00E1 usado diretamente. Caso contr\u00E1rio, o nome do caminho do tempo de execu\u00E7\u00E3o ser\u00E1 resolvido de modo dependente do sistema. Em sistemas UNIX, um nome do caminho relativo \u00E9 tornado absoluto por sua resolu\u00E7\u00E3o em rela\u00E7\u00E3o ao diret\u00F3rio do usu\u00E1rio atual. Em sistemas Microsoft Windows, um nome de caminho relativo \u00E9 tornado absoluto por sua resolu\u00E7\u00E3o em rela\u00E7\u00E3o ao diret\u00F3rio atual da unidade nomeada pelo nome do caminho, se houver; se n\u00E3o houver, ele ser\u00E1 resolvido em rela\u00E7\u00E3o ao diret\u00F3rio do usu\u00E1rio atual.
config-source.dir.relative-to=O nome de outro caminho nomeado anteriormente ou de um dos caminhos padr\u00E3o fornecidos pelo sistema. Se "relative-to" for fornecido, o valor do atributo "path" ser\u00E1 tratado como relativo ao caminho especificado por este atributo. Os caminhos padr\u00E3o fornecidos pelo sistema incluem: jboss.home \u2013 o diret\u00F3rio raiz da distribui\u00E7\u00E3o do JBoss AS, user.home \u2013 o diret\u00F3rio inicial do usu\u00E1rio, user.dir \u2013 o diret\u00F3rio de trabalho atual do usu\u00E1rio, java.home \u2013 o diret\u00F3rio de instala\u00E7\u00E3o java, jboss.server.base.dir \u2013 o diret\u00F3rio raiz de uma inst\u00E2ncia de servidor individual, jboss.server.data.dir \u2013 o diret\u00F3rio que o servidor usar\u00E1 para o armazenamento de arquivos de dados persistentes, jboss.server.log.dir \u2013 o diret\u00F3rio que o servidor usar\u00E1 para o armazenamento de arquivos de log, jboss.server.tmp.dir \u2013 o diret\u00F3rio que o servidor usar\u00E1 para o armazenamento de arquivos tempor\u00E1rios e jboss.domain.servers.dir \u2013 o diret\u00F3rio em que um controlador do host criar\u00E1 a \u00E1rea de trabalho para inst\u00E2ncias de servidor individuais.
config-source.class=Classe da origem de configura\u00E7\u00E3o a ser carregada
config-source.class.module=M\u00F3dulo da origem de configura\u00E7\u00E3o a ser carregado
config-source.class.name=Nome da classe da origem de configura\u00E7\u00E3o a ser carregado
config-source.remove=Remover a origem de configura\u00E7\u00E3o
config-source-provider=\u00C9 poss\u00EDvel um provedor de origem de configura\u00E7\u00E3o para registrar uma implementa\u00E7\u00E3o nova para v\u00E1rias origens de configura\u00E7\u00E3o.
config-source-provider.add=Adicione um provedor de origem de configura\u00E7\u00E3o
config-source-provider.class=Classe do ConfigSourceProvider a ser carregada
config-source-provider.class.module=M\u00F3dulo do ConfigSourceProvider a ser carregado
config-source-provider.class.name=Nome da classe da origem de configura\u00E7\u00E3o a ser carregado
config-source-provider.remove=Remover o provedor de origem de configura\u00E7\u00E3o
microprofile-config-smallrye=Extens\u00E3o do WildFly para Eclipse MicroProfile Config com SmallRye
microprofile-config-smallrye.add=Adicionar o subsistema
microprofile-config-smallrye.remove=Remover o subsistema

