config-source=ConfigSource proporciona una fuente para los valores de configuraci\u00F3n.
config-source.add=Agregue una fuente de configuraci\u00F3n (la fuente de la configuraci\u00F3n est\u00E1 determinada por los atributos de la fuente de configuraci\u00F3n (clase para ofrecer una nueva implementaci\u00F3n de ConfigSource, propiedades para almacenar los valores de configuraci\u00F3n en el modelo de administraci\u00F3n de WildFly, etc.)
config-source.ordinal=Valor ordinal de la fuente de configuraci\u00F3n
config-source.properties=Propiedades configuradas para esta fuente de configuraci\u00F3n y almacenadas directamente en el modelo de administraci\u00F3n de WildFly.
config-source.dir=Directorio que se analiza para configurar las propiedades de esta fuente de configuraci\u00F3n (los nombres del archivo son la clave, el contenido del archivo es el valor)
config-source.dir.path=La ruta del directorio que se analizar\u00E1. Se trata como una ruta absoluta, a menos que se especifique el atributo 'relative-to', en cuyo caso el valor se trata como relativo a esa ruta. Si se trata como una ruta absoluta, el nombre de ruta en tiempo de ejecuci\u00F3n real especificado por el valor de este atributo se determinar\u00E1 de la siguiente manera: Si este valor ya es absoluto, el valor se usa directamente. De lo contrario, el nombre de ruta en tiempo de ejecuci\u00F3n se resuelve en una forma dependiente del sistema. En los sistemas UNIX, un nombre de ruta relativo se hace absoluto si se resuelve con el directorio del usuario actual. En los sistemas Microsoft Windows, un nombre de ruta relativo se hace absoluto al resolverlo con el directorio actual de la unidad con el nombre de la ruta, si lo hay; si no, se resuelve con el directorio del usuario actual.
config-source.dir.relative-to=El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndares que el sistema proporciona. Si se brinda 'relative-to', el valor del atributo 'path' se trata como relativo a la ruta especificada por este atributo. Las rutas est\u00E1ndares que el sistema proporciona incluyen: jboss.home - el directorio ra\u00EDz de la distribuci\u00F3n JBoss AS distribution; user.home - el directorio de inicio del usuario; user.dir - el directorio de trabajo actual del usuario; java.home - el directorio de instalaci\u00F3n java; jboss.server.base.dir - el directorio ra\u00EDz para una instancia individual del servidor; jboss.server.data.dir - el directorio que el servidor utilizar\u00E1 para almacenamiento de archivos de datos persistentes; jboss.server.log.dir - el directorio que el servidor utilizar\u00E1 para almacenamiento de archivos de registro; jboss.server.tmp.dir - el directorio que el servidor utilizar\u00E1 para almacenamiento de archivos temporales; y jboss.domain.servers.dir - el directorio bajo el cual un controlador de hosts crear\u00E1 el \u00E1rea de trabajo para instancias individuales del servidor.
config-source.class=Clase de la fuente de configuraci\u00F3n que se debe cargar
config-source.class.module=M\u00F3dulo de la fuente de configuraci\u00F3n que se debe cargar
config-source.class.name=Nombre de la clase de la fuente de configuraci\u00F3n que se debe cargar
config-source.remove=Elimine la fuente de configuraci\u00F3n
config-source-provider=El proveedor de fuente de configuraci\u00F3n puede utilizarse para registrar una nueva implementaci\u00F3n para m\u00FAltiples fuentes de configuraci\u00F3n.
config-source-provider.add=A\u00F1ada un proveedor de fuente de configuraci\u00F3n
config-source-provider.class=Clase del proveedor de fuente de configuraci\u00F3n que se debe cargar
config-source-provider.class.module=M\u00F3dulo del proveedor de fuente de configuraci\u00F3n que se debe cargar
config-source-provider.class.name=Nombre de la clase de la fuente de configuraci\u00F3n que se debe cargar
config-source-provider.remove=Elimine el proveedor de fuente de configuraci\u00F3n
microprofile-config-smallrye=Extensi\u00F3n WildFLy para la configuraci\u00F3n de Eclipse MicroProfile con SmallRye
microprofile-config-smallrye.add=A\u00F1ada el subsistema
microprofile-config-smallrye.remove=Elimine el subsistema

