config-source=ConfigSource fournit une source pour les valeurs de configuration.
config-source.add=Ajouter une source de configuration (la source de la configuration est d\u00E9termin\u00E9e par les attributs de la source de configuration config-source (classe pour fournir une nouvelle impl\u00E9mentation de ConfigSource, propri\u00E9t\u00E9s pour stocker les valeurs de configuration dans les mod\u00E8les de gestion de WildFly, etc.
config-source.ordinal=Valeur ordinale de la source de configuration
config-source.properties=Propri\u00E9t\u00E9s configur\u00E9es pour cette source de configuration et stock\u00E9es directement dans le mod\u00E8le de gestion de WildFly.
config-source.dir=R\u00E9pertoire qui est scann\u00E9 en propri\u00E9t\u00E9s de configuration pour cette source de configuration (les noms de fichier sont la cl\u00E9, le contenu du fichier est la valeur)
config-source.dir.path=Chemin d'acc\u00E8s r\u00E9el au syst\u00E8me de fichiers. Consid\u00E9r\u00E9 comme un chemin d'acc\u00E8s absolu, \u00E0 moins que l'attribut \u00AB relative-to \u00BB ne soit sp\u00E9cifi\u00E9, auquel cas la valeur sera trait\u00E9e comme \u00E9tant relative \u00E0 ce chemin. Si trait\u00E9 comme un chemin d'acc\u00E8s complet, le v\u00E9ritable chemin d'acc\u00E8s de runtime sp\u00E9cifi\u00E9 par la valeur de cet attribut sera d\u00E9termin\u00E9 comme suit\u00A0: si cette valeur est d\u00E9j\u00E0 absolue, alors la valeur sera directement utilis\u00E9e. Sinon le chemin d'acc\u00E8s de runtime sera r\u00E9solu selon le syst\u00E8me. Sur les syst\u00E8mes UNIX, un chemin d'acc\u00E8s relatif est rendu absolu s'il est r\u00E9solu sur le r\u00E9pertoire utilisateur en cours. Sur les syst\u00E8mes Microsoft Windows, un chemin d'acc\u00E8s relatif est rendu absolu si on le r\u00E9sout sur le r\u00E9pertoire en cours du lecteur nomm\u00E9 par le chemin d'acc\u00E8s, le cas \u00E9ch\u00E9ant ; sinon, sur le r\u00E9pertoire utilisateur en cours.
config-source.dir.relative-to=Nom d'un autre chemin d'acc\u00E8s nomm\u00E9 pr\u00E9c\u00E9demment, ou de l'un des chemins d'acc\u00E8s standard fournis par le syst\u00E8me. Si \u00AB relative-to \u00BB est fourni, la valeur de l'attribut \u00AB path \u00BB (chemin) est consid\u00E9r\u00E9e comme relative par rapport au chemin sp\u00E9cifi\u00E9 par cet attribut. Les chemins d'acc\u00E8s standard fournis par le syst\u00E8me comprennent : jboss.home - r\u00E9pertoire racine de la distribution de JBoss AS ; user.home - r\u00E9pertoire d'accueil de l'utilisateur ; user.dir - r\u00E9pertoire de travail en cours de l'utilisateur ; java.home - r\u00E9pertoire d'installation de java ; jboss.server.base.dir - r\u00E9pertoire racine pour une instance de serveur individuelle ; jboss.server.data.dir - r\u00E9pertoire utilis\u00E9 par le serveur pour le stockage de fichiers de donn\u00E9es persistantes ; jboss.server.log.dir - r\u00E9pertoire utilis\u00E9 par le serveur pour le stockage de fichiers log ; jboss.server.tmp.dir - r\u00E9pertoire utilis\u00E9 par le serveur pour le stockage de fichiers temporaires ; jboss.domain.servers.dir - r\u00E9pertoire sous lequel un contr\u00F4leur h\u00F4te va cr\u00E9er la zone de travail pour chaque instance de serveur
config-source.class=Classe de la source de configuration \u00E0 charger
config-source.class.module=Module de la source de configuration \u00E0 charger
config-source.class.name=Nom de la classe de la source de configuration \u00E0 charger
config-source.remove=Supprimer la source de configuration
config-source-provider=Le fournisseur de source de config peut \u00EAtre utilis\u00E9 pour enregistrer une nouvelle impl\u00E9mentation pour plusieurs sources de configuration.
config-source-provider.add=Ajouter un fournisseur de source de config
config-source-provider.class=Classe du ConfigSourceProvider \u00E0 charger
config-source-provider.class.module=Module de la source de configuration \u00E0 charger
config-source-provider.class.name=Nom de la classe de la source de configuration \u00E0 charger
config-source-provider.remove=Supprimer le fournisseur de source de configuration
microprofile-config-smallrye=Extension WildFLy pour Eclipse MicroProfile Config avec SmallRye
microprofile-config-smallrye.add=Ajouter le sous-syst\u00E8me
microprofile-config-smallrye.remove=Supprimer le sous-syst\u00E8me

