webservices=La configuraci\u00F3n del subsistema de servicios web.
webservices.add=A\u00F1ade el sub-sistema de servicios web. 
webservices.remove=Borra el sub-sistema de servicios web.
webservices.deployment.endpoint.name=Nombre del punto final de Webservice.
webservices.deployment.endpoint.context=Contexto del punto de acceso de Webservice.
webservices.deployment.endpoint.class=Clase del punto final de Webservice.
webservices.deployment.endpoint.type=Tipo del punto de acceso de Webservice.
webservices.deployment.endpoint.wsdl-url=URL WSDL del punto de acceso Webservice. Si wsdl-host se define en jbossws.undefined.host, JBossWS usar\u00E1 el host solicitante durante la reescritura de <soap:address>
webservices.endpoint=punto de acceso de Webservice.
webservices.endpoint.name=Nombre del punto final de Webservice.
webservices.endpoint.context=Contexto del punto de acceso de Webservice.
webservices.endpoint.class=Clase del punto final de Webservice.
webservices.endpoint.type=Tipo del punto de acceso de Webservice.
webservices.endpoint.wsdl=URL WSDL del punto de acceso Webservice. Si wsdl-host se define en jbossws.undefined.host, JBossWS usar\u00E1 el host solicitante durante la reescritura de <soap:address>
webservices.endpoint.add=Agrega el punto final de Webservice.
webservices.endpoint.remove=Borra el punto final de Webservice.
webservices.modify-wsdl-address=Si la direcci\u00F3n SOAP puede modificarse o no.
webservices.wsdl-host=El WSDL, el cual es un artefacto de implementaci\u00F3n requerido para un punto final, tiene un elemento <soap:address> que apunta al sitio del punto final. JBoss soporta la reescritura de la direcci\u00F3n de SOAP. Si el contenido de <soap:address> es una URL v\u00E1lida, JBossWS no la reescribir\u00E1, a menos que 'modify-wsdl-address' sea verdadero. Si el contenido de <soap:address> no es una URL v\u00E1lida, JBossWS la reescribir\u00E1 mediante los valores de atributos determinados a continuaci\u00F3n. Si 'wsdl-host' se establece como 'jbossws.undefined.host', JBossWS usa hosts solicitantes al reescribir <soap:address>
webservices.wsdl-port=El puerto no-seguro que ser\u00E1 utilizado para reescribir la direcci\u00F3n de SOAP. Si el puerto est\u00E1 ausente, ser\u00E1 identificado al consultar la lista de conectores instalados.
webservices.wsdl-secure-port=El puerto seguro que se utilizar\u00E1 para rescribir la direcci\u00F3n SOAP. Si el puerto est\u00E1 ausente, se identificar\u00E1 al consultar la lista de los conectores instalados.
webservices.wsdl-uri-scheme=El esquema URI que se usar\u00E1 para reescribir <soap:address>. Los valores v\u00E1lidos son 'http' y 'https'. Esta configuraci\u00F3n sobrescribe el esquema computado al procesar el punto de acceso (incluso si se especifica una garant\u00EDa de transporte). Los valores para 'wsdl-port' y 'wsdl-secure-port' (o sus valores predeterminados) se usan seg\u00FAn el esquema especificado.
webservices.wsdl-path-rewrite-rule=La cadena define un comando de sustituci\u00F3n SED (p.\u00A0ej., 's/regexp/replacement/g') que JBossWS ejecuta con el componente de ruta de cada URL <soap:address> publicada desde el servidor. Cuando wsdl-path-rewrite-rule no est\u00E1 definido, JBossWS retiene el componente de la ruta original de cada URL <soap:address>. Cuando 'modify-wsdl-address' se establece en "false", este elemento se ignora.
webservices.statistics-enabled=Indica si las estad\u00EDsticas deben ser recolectadas para los puntos de acceso, el valor predeterminado es 'false'.
webservices.deployment=Recursos del tiempo de ejecuci\u00F3n expuestos por los componentes en la implementaci\u00F3n.
webservices.deployment.endpoint=Punto final WS
webservices.deployment.endpoint.average-processing-time=Tiempo de procesamiento promedio del punto final.
webservices.deployment.endpoint.min-processing-time=Tiempo de procesamiento m\u00EDnimo del punto final.
webservices.deployment.endpoint.max-processing-time=Tiempo de procesamiento m\u00E1ximo del punto final.
webservices.deployment.endpoint.total-processing-time=Tiempo de procesamiento total del punto final.
webservices.deployment.endpoint.request-count=Conteo de peticiones del punto final procesadas. 
webservices.deployment.endpoint.response-count=Conteo de respuestas del punto final generadas.
webservices.deployment.endpoint.fault-count=Conteo de fallas del punto final generadas.

webservices.endpoint-config=Configuraci\u00F3n del punto final de Webservice
webservices.endpoint-config.add=Agregar una configuraci\u00F3n del punto final
webservices.endpoint-config.remove=Borra una configuraci\u00F3n del punto final
webservices.endpoint-config.pre-handler-chain=Cadena del pre controlador
webservices.endpoint-config.post-handler-chain=Cadena del post controlador
webservices.endpoint-config.property=Propiedad de configuraci\u00F3n


webservices.pre-handler-chain=Cadena del PRE-controlador de configuraci\u00F3n del punto final
webservices.pre-handler-chain.add=Agrega la cadena del PRE-controlador de configuraci\u00F3n del punto final
webservices.pre-handler-chain.remove=Borra la cadena del PRE-controlador de configuraci\u00F3n del punto final
webservices.pre-handler-chain.handler=Controlador
webservices.post-handler-chain=Cadena del POST-controlador de configuraci\u00F3n del punto final
webservices.post-handler-chain.add=Agrega la cadena del POST-controlador de configuraci\u00F3n del punto final
webservices.post-handler-chain.remove=Borra la cadena del POST controlador de configuraci\u00F3n del punto final
webservices.post-handler-chain.handler=Controlador

webservices.property=Propiedad de configuraci\u00F3n del punto final
webservices.property.add=Agrega una propiedad de configuraci\u00F3n del punto final
webservices.property.remove=Borra una propiedad de configuraci\u00F3n del punto final
webservices.property.value=Valor de la propiedad de configuraci\u00F3n del punto final
webservices.client-config=Configuraci\u00F3n del cliente Webservice
webservices.client-config.add=Agregar configuraci\u00F3n del cliente
webservices.client-config.remove=Borrar configuraci\u00F3n del cliente
webservices.pre-handler-chain.chain=Cadena del PRE-controlador de configuraci\u00F3n del cliente
webservices.client-config.pre-handler-chain=Cadena del PRE-controlador de configuraci\u00F3n del cliente
webservices.client-config.post-handler-chain=Cadena del POST-controlador de configuraci\u00F3n del cliente
webservices.client-config.property=Propiedad de configuraci\u00F3n del cliente
webservices.pre-handler-chain.protocol-bindings=Enlace de protocolo
webservices.post-handler-chain.protocol-bindings=Enlace de protocolo
webservices.handler=Controlador del punto final
webservices.handler.add=Agregar controlador del punto final
webservices.handler.remove=Borra controlador del punto final
webservices.handler.name=Nombre de controlador
webservices.handler.class=Clase de controlador

