# subsystem resource
infinispan=A configura\u00E7\u00E3o do subsistema infinispan.
infinispan.add=Adiciona o subsistema do infinispan.
infinispan.describe=Descreve o subsistema do infinispan
infinispan.remove=Remove o subsistema do infinispan
# cache container resource
infinispan.cache-container=A configura\u00E7\u00E3o de um cont\u00EAiner do cache infinispan
infinispan.cache-container.default-cache=O cache infinispan default
infinispan.cache-container.listener-executor=O executor usado para a fila de replica\u00E7\u00E3o
infinispan.cache-container.listener-executor.deprecated=Preterido. Isto ser\u00E1 substitu\u00EDdo pela configura\u00E7\u00E3o de thread pool integrada no subsistema em um lan\u00E7amento futuro. 
infinispan.cache-container.eviction-executor=O executor usado para a remo\u00E7\u00E3o
infinispan.cache-container.eviction-executor.deprecated=Preterido. Isto ser\u00E1 substitu\u00EDdo pela configura\u00E7\u00E3o de thread pool integrada no subsistema em um lan\u00E7amento futuro. 
infinispan.cache-container.replication-queue-executor=O executor usado para as opera\u00E7\u00F5es de cache ass\u00EDncronas
infinispan.cache-container.replication-queue-executor.deprecated=Preterido. Isto ser\u00E1 substitu\u00EDdo pela configura\u00E7\u00E3o de thread pool integrada no subsistema em um lan\u00E7amento futuro. 
infinispan.cache-container.jndi-name=O nome jndi pelo qual executar o bind neste cont\u00EAiner de cache
infinispan.cache-container.jndi-name.deprecated=Descontinuado. Ser\u00E1 ignorado.
infinispan.cache-container.module=O m\u00F3dulo cujo carregador de classe deve ser usado quando construindo esta configura\u00E7\u00E3o do cont\u00EAiner de cache.
infinispan.cache-container.start=O modo de inicializa\u00E7\u00E3o do cont\u00EAiner, que pode ser EAGER (imediatamente inicializado) ou LAZY (inicializado sob solicita\u00E7\u00E3o).
infinispan.cache-container.start.deprecated=Preterido. Lan\u00E7amentos futuros suportar\u00E3o somente modo LAZY. 
infinispan.cache-container.statistics-enabled=Caso habilitado, as estat\u00EDsticas ser\u00E3o coletadas para este cont\u00EAiner de cache.
infinispan.cache-container.thread-pool=Define thread pool pra este cont\u00EAiner de cache. 
infinispan.cache-container.cache=A lista de caches dispon\u00EDveis ao cont\u00EAiner de cache
infinispan.cache-container.singleton=Um conjunto de elementos de configura\u00E7\u00E3o do cont\u00EAiner de cache.
infinispan.cache-container.aliases=A lista de aliases para este cont\u00EAiner de cache
infinispan.cache-container.add-alias=Adiciona um alias para esse cont\u00EAiner do cache
infinispan.cache-container.add-alias.name=O nome do alias para adicionar a este cont\u00EAiner de cache. 
infinispan.cache-container.add-alias.deprecated=Preterido. Utilize a opera\u00E7\u00E3o list-add como alternativa. 
infinispan.cache-container.remove-alias=Remove um alias para esse cont\u00EAiner do cache
infinispan.cache-container.remove-alias.name=O nome do alias para remover deste cont\u00EAiner de cache
infinispan.cache-container.remove-alias.deprecated=Preterido. Utilize a opera\u00E7\u00E3o list-remove como alternativa. 
infinispan.cache-container.add=Adiciona um cont\u00EAiner do cache ao subsistema infinispan
infinispan.cache-container.remove=Remove um cont\u00EAiner do cache do subsistema infinispan
# cache container read-only metrics
infinispan.cache-container.cache-manager-status=O status do componente do gerenciador do cache. Ele pode retornar nulo caso o gerenciador do cache n\u00E3o tenha sido inicializado.
infinispan.cache-container.cache-manager-status.deprecated=Preterido. Sempre retorna RUNNING.
infinispan.cache-container.is-coordinator=Configure para verdadeiro caso este n\u00F3 for o coordenador do cluster. Ele pode retornar nulo caso o gerenciador do cluster n\u00E3o tenha sido iniciado.
infinispan.cache-container.coordinator-address=O endere\u00E7o l\u00F3gico do coordenador do cluster. Ele pode retornar nulo caso o gerenciador do cluster n\u00E3o tenha sido iniciado.
infinispan.cache-container.local-address=O endere\u00E7o local do n\u00F3. Ele pode retornar nulo caso o gerenciador do cache n\u00E3o tenha sido iniciado.
infinispan.cache-container.cluster-name=O nome do cluster que este n\u00F3 pertence. Ele pode retornar nulo caso o gerenciador do cluster n\u00E3o tenha sido inicializado.
# cache container children
infinispan.cache-container.transport=Um child de transporte do cont\u00EAiner do cache.
infinispan.cache-container.local-cache=Um cache local dependente do cont\u00EAiner do cache.
infinispan.cache-container.invalidation-cache=Um child do cache de invalida\u00E7\u00E3o do cont\u00EAiner do cache.
infinispan.cache-container.replicated-cache=Um child replicado do cont\u00EAiner do cache.
infinispan.cache-container.distributed-cache=Um child de cache distribu\u00EDdo do cont\u00EAiner do cache.
# thread-pool resources
infinispan.thread-pool.async-operations=Define um thread pool utilizado para opera\u00E7\u00F5es ass\u00EDncronas. 
infinispan.thread-pool.listener=Define um thread pool utilizado para as notifica\u00E7\u00F5es de ouvinte de cache ass\u00EDncrono. 
infinispan.thread-pool.persistence=Define um thread pool utilizado para interagir com o armazenamento persistente. 
infinispan.thread-pool.remote-command=Define um thread pool utilizado para executar os comandos remotos. 
infinispan.thread-pool.state-transfer=Define um thread pool utilizado para transfer\u00EAncia de estado. 
infinispan.thread-pool.transport=Define um thread pool utilizado para comunica\u00E7\u00E3o de transporte ass\u00EDncrono. 
infinispan.thread-pool.expiration=Define um thread pool utilizado para despejos.  
infinispan.thread-pool.add=Adiciona um executor de pool de thread. 
infinispan.thread-pool.remove=Remove o executor de pool de thread. 
infinispan.thread-pool.min-threads=O tamanho do pool thread core que \u00E9 menor do que o tamanho m\u00E1ximo de pool. Caso indefinido, o tamanho do pool de thread principal \u00E9 o mesmo ao do tamanho de pool de thread m\u00E1ximo.
infinispan.thread-pool.min-threads.deprecated=Preterido. N\u00E3o possui efeito.
infinispan.thread-pool.max-threads=O tamanho m\u00E1ximo do pool thread. 
infinispan.thread-pool.queue-length=O comprimento da fila.
infinispan.thread-pool.queue-length.deprecated=Preterido. N\u00E3o possui efeito.
infinispan.thread-pool.keepalive-time=Usado para especificar a quantia de milissegundos que threads de pool devem continuar executando quando ociosos. Caso n\u00E3o seja especificado, os threads executar\u00E3o at\u00E9 que o executor seja encerrado.
# transport resource
infinispan.transport.jgroups=A descri\u00E7\u00E3o de transporte usada pelo cont\u00EAiner do cache
infinispan.transport.jgroups.add=Adiciona o transporte ao cont\u00EAiner do cache
infinispan.transport.jgroups.remove=Remove o transporte do cont\u00EAiner do cache
infinispan.transport.jgroups.channel=O canal de transporte deste cont\u00EAiner de cache. 
infinispan.transport.jgroups.cluster=O nome do cluster de comunica\u00E7\u00E3o do grupo
infinispan.transport.jgroups.cluster.deprecated=Preterido. O cluster utilizado para o transporte dese cont\u00EAiner de cache \u00E9 configurado via o subsistema JGroups. 
infinispan.transport.jgroups.executor=O executor de uso para o transporte
infinispan.transport.jgroups.executor.deprecated=Preterido. Isto ser\u00E1 substitu\u00EDdo pela configura\u00E7\u00E3o de thread pool integrada no subsistema em um lan\u00E7amento futuro. 
infinispan.transport.jgroups.lock-timeout=O tempo limite de bloqueio do transporte
infinispan.transport.jgroups.machine=O identificador da m\u00E1quina para o transporte
infinispan.transport.jgroups.rack=O indentificador rack para o transporte
infinispan.transport.jgroups.site=O identificador de site para o transporte
infinispan.transport.jgroups.stack=A pilha jgroups para uso do transporte
infinispan.transport.jgroups.stack.deprecated=Preterido. A pilha de protocolo utilizada pelo transporte deste cont\u00EAiner de cache \u00E9 configurada via o subsistema JGroups. 
infinispan.transport.none=Um transporte exclusivamente local utilizado por este cont\u00EAiner de cache
infinispan.transport.none.add=Adiciona um transporte local a este cont\u00EAiner de cache
infinispan.transport.none.remove=Remove um transporte local deste cont\u00EAiner de cache. 
# (hierarchical) cache resource
infinispan.cache.start=O modo de inicializa\u00E7\u00E3o do cache, que pode ser EAGER (in\u00EDcio imediato) ou LAZY (in\u00EDcio a pedido).
infinispan.cache.start.deprecated=Preterido. Somente o modo LAZY \u00E9 suportado. 
infinispan.cache.statistics-enabled=Caso habilitado, as estat\u00EDsticas ser\u00E3o coletadas para este de cache.
infinispan.cache.batching=Caso ativado, o API de envio de lote da invoca\u00E7\u00E3o estar\u00E1 dispon\u00EDvel para esse cache.
infinispan.cache.batching.deprecated=Preterido. Substitu\u00EDdo pelo modo de transa\u00E7\u00E3o BATCH.
infinispan.cache.indexing=Caso ativado, as entradas ser\u00E3o indexadas quando adicionadas ao cache. Os \u00EDndices ser\u00E3o atualizados uma vez que as entradas s\u00E3o alteradas ou removidas.
infinispan.cache.indexing.deprecated=Preterido. N\u00E3o possui efeito.
infinispan.cache.jndi-name=O jndi-name a ser vinculado a essa inst\u00E2ncia.
infinispan.cache.jndi-name.deprecated=Descontinuado. Ser\u00E1 ignorado.
infinispan.cache.module=O m\u00F3dulo cuja carregador de classe deve ser usado na constru\u00E7\u00E3o dessa configura\u00E7\u00E3o do cache.
infinispan.cache.indexing-properties=Propriedades para controle do comportamento de indexa\u00E7\u00E3o
infinispan.cache.indexing-properties.deprecated=Preterido. N\u00E3o possui efeito.
infinispan.cache.remove=Remove o cache desse recipiente.
# cache read-only metrics
infinispan.cache.cache-status=O status do componente de cache.
infinispan.cache.cache-status.deprecated=Preterido. Sempre retorna RUNNING.
infinispan.cache.average-read-time=Tempo m\u00E9dio (em ms) para leituras de cache. Inclui acertos e erros.
infinispan.cache.average-read-time.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.average-remove-time=Tempo m\u00E9dio (em ms) para remo\u00E7\u00F5es cache.
infinispan.cache.average-remove-time.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.average-write-time=Tempo m\u00E9dio (em ms) para grava\u00E7\u00F5es de cache
infinispan.cache.average-write-time.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.elapsed-time=Tempo (em segundos) desde que o cache foi iniciado.
infinispan.cache.elapsed-time.deprecated=Preterido. Em vez disso, use o tempo desde o in\u00EDcio.
infinispan.cache.hit-ratio=A rela\u00E7\u00E3o acertos/erros para o cache (acertos/acertos mais erros).
infinispan.cache.hit-ratio.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.hits=O n\u00FAmero de acertos do atributo do cache.
infinispan.cache.hits.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.misses=O n\u00FAmero de erros do atributo do cache.
infinispan.cache.misses.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.number-of-entries=O n\u00FAmero de entradas no cache, incluindo entradas passivas.
infinispan.cache.number-of-entries.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.number-of-entries-in-memory=O n\u00FAmero de entradas no cache sem entradas passivas.
infinispan.cache.read-write-ratio=A rela\u00E7\u00E3o de leitura/grava\u00E7\u00E3o do cache ((acertos+erros)/stores).
infinispan.cache.read-write-ratio.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.remove-hits=O n\u00FAmero de acertos de remo\u00E7\u00E3o do atributo do cache.
infinispan.cache.remove-hits.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.remove-misses=O n\u00FAmero de erros de remo\u00E7\u00E3o do atributo do cache.
infinispan.cache.remove-misses.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.stores=O n\u00FAmero de opera\u00E7\u00F5es adicionar do atributo do cache.
infinispan.cache.stores.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.time-since-reset=Tempo (em segundos) desde que as estat\u00EDsticas do cache foram redefinidas.
infinispan.cache.time-since-reset.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.time-since-start=Tempo (em segundos) desde que o cache foi iniciado.
infinispan.cache.writes=O n\u00FAmero de opera\u00E7\u00F5es adicionar do atributo do cache.
infinispan.cache.invalidations=O n\u00FAmero de invalida\u00E7\u00F5es de cache.
infinispan.cache.invalidations.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.passivations=O n\u00FAmero de passiva\u00E7\u00F5es do n\u00F3 do cache (passiva\u00E7\u00E3o de um n\u00F3 a partir da mem\u00F3ria a um store do cache).
infinispan.cache.passivations.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.activations=O n\u00FAmero de ativa\u00E7\u00F5es do n\u00F3 do cache (ativa\u00E7\u00E3o de um n\u00F3 a partir da mem\u00F3ria a um store do cache).
infinispan.cache.activations.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
#
infinispan.cache.async-marshalling=Caso ativado, isto levar\u00E1 ao empacotamentos das entradas a serem executadas de forma ass\u00EDncrona.
infinispan.cache.async-marshalling.deprecated=Preterido. Serializa\u00E7\u00E3o ass\u00EDncrona n\u00E3o \u00E9 mais suportada. 
infinispan.cache.mode=Determina o modo do cache com cluster, ASYNC para opera\u00E7\u00E3o ass\u00EDncrona ou SYNC para opera\u00E7\u00E3o s\u00EDncrona.
infinispan.cache.mode.deprecated=Descontinuado. Esse atributo ser\u00E1 ignorado. Todos os modos de cache ser\u00E3o tratados como SYNC. Para executar opera\u00E7\u00F5es de cache ass\u00EDncrono, use a API de cache ass\u00EDncrono do Infinispan.
infinispan.cache.queue-size=No modo ASYNC, esse atributo pode ser usado para aplicar o trigger no esvaziamento da fila quando ele alcan\u00E7ar um limite espec\u00EDfico.
infinispan.cache.queue-size.deprecated=Preterido. Este atributo ser\u00E1 ignorado. 
infinispan.cache.queue-flush-interval=No modo ASYNC, esse atributo controla a frequ\u00EAncia em que o thread ass\u00EDncrono usou para esvaziar as rodagens da fila de replica\u00E7\u00E3o. Isto deve ser um n\u00FAmero positivo que representa o per\u00EDodo de despertar do thread em mil\u00E9simos de segundos. 
infinispan.cache.queue-flush-interval.deprecated=Preterido. Este atributo ser\u00E1 ignorado. 
infinispan.cache.remote-timeout=No modo SYNC, o intervalo (em mil\u00E9simos de segundos) usado para esperar um reconhecimento na realiza\u00E7\u00E3o de uma chamada remota, ap\u00F3s a chamada ser abortada e uma exce\u00E7\u00E3o ser lan\u00E7ada.
# metrics
infinispan.cache.average-replication-time=O tempo m\u00E9dio necess\u00E1rio para replicar dados em torno do cluster.
infinispan.cache.average-replication-time.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.replication-count=O n\u00FAmero de vezes em que os dados foram replicados em torno do cluster.
infinispan.cache.replication-count.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.replication-failures=O n\u00FAmero de falhas de replica\u00E7\u00E3o de dados.
infinispan.cache.replication-failures.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.cache.success-ratio=A rela\u00E7\u00E3o de sucesso da replica\u00E7\u00E3o de dados (sucessos/sucessos+falhas).
infinispan.cache.success-ratio.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
# operations
infinispan.cache.reset-statistics=Redefina as estat\u00EDsticas para este cache.

#child resource aliases
infinispan.cache.memory=Alias do componente de configura\u00E7\u00E3o de despejo
infinispan.cache.eviction=Alias do recurso memory=object
infinispan.cache.expiration=Alias do componente de configura\u00E7\u00E3o de expira\u00E7\u00E3o 
infinispan.cache.locking=Alias do componente de configura\u00E7\u00E3o de bloqueio
infinispan.cache.state-transfer=Alias do componente de configura\u00E7\u00E3o de tranfer\u00EAncia de estado
infinispan.cache.transaction=Alias do componente de configura\u00E7\u00E3o de transa\u00E7\u00E3o 
infinispan.cache.file-store=Alias do componente de configura\u00E7\u00E3o de armazenamento de arquivo
infinispan.cache.remote-store=Alias do componente de configura\u00E7\u00E3o de armazenamento de arquivo
infinispan.cache.binary-keyed-jdbc-store=Alias do componente de configura\u00E7\u00E3o de armazenamento jdbc bin\u00E1rio. 
infinispan.cache.mixed-keyed-jdbc-store=Alias do componente de configura\u00E7\u00E3o de armazenamento jdbc misto 
infinispan.cache.string-keyed-jdbc-store=Alias do componente de configura\u00E7\u00E3o de armazenamento jdbc de sequ\u00EAncia
infinispan.cache.write-behind=Alias do componente de configura\u00E7\u00E3o de write-behind 
infinispan.cache.backup-for=Alias do componente de configura\u00E7\u00E3o de backup-for
infinispan.cache.backup=Alias para a depend\u00EAncia de backup da configura\u00E7\u00E3o de backups 
infinispan.cache.segments=Controla o n\u00FAmero de seguimentos com espa\u00E7o hash que \u00E9 granulado para a distribui\u00E7\u00E3o da tecla no cluster. O valor deve ser estritamente positivo.
infinispan.cache.consistent-hash-strategy=Define a estrat\u00E9gia de hash consistente de cache. 
infinispan.cache.evictions=O n\u00FAmero de opera\u00E7\u00F5es de remo\u00E7\u00E3o de cache.

infinispan.local-cache=Uma configura\u00E7\u00E3o de cache local
infinispan.local-cache.add=Adiciona o cache local a este cont\u00EAiner do cache
infinispan.local-cache.remove=Remove o cache local a partir deste cont\u00EAiner

infinispan.invalidation-cache=Um cache de invalida\u00E7\u00E3o
infinispan.invalidation-cache.add=Adiciona um cache de invalida\u00E7\u00E3o a este cont\u00EAiner de cache
infinispan.invalidation-cache.remove=Remove um cache de invalida\u00E7\u00E3o a partir deste cont\u00EAiner de cache

infinispan.replicated-cache=Uma configura\u00E7\u00E3o de cache replicada
infinispan.replicated-cache.add=Adiciona um cache replicado a este cont\u00EAiner de cache
infinispan.replicated-cache.remove=Remove um cache replicado deste cont\u00EAiner de cache

infinispan.component.partition-handling=A configura\u00E7\u00E3o da manipula\u00E7\u00E3o da parti\u00E7\u00E3o para as caches distribu\u00EDdos e replicados. 
infinispan.component.partition-handling.add=Adiciona uma configura\u00E7\u00E3o de manipula\u00E7\u00E3o de parti\u00E7\u00E3o. 
infinispan.component.partition-handling.remove=Remove uma configura\u00E7\u00E3o de manipula\u00E7\u00E3o de parti\u00E7\u00E3o. 
infinispan.component.partition-handling.enabled=Caso ativado, a cache entrar\u00E1 em modo degradado quando detectar uma parti\u00E7\u00E3o de rede que amea\u00E7a a integridade da cache. 
infinispan.component.partition-handling.availability=Indica a disponibilidade atual da cache. 
infinispan.component.partition-handling.availability.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.component.partition-handling.force-available=For\u00E7a uma cache com disponibilidade degradada a tornar-se dispon\u00EDvel. 
infinispan.component.partition-handling.force-available.deprecated=Preterido. Use a opera\u00E7\u00E3o do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.

infinispan.component.state-transfer=A configura\u00E7\u00E3o de transfer\u00EAncia de estado para caches distribu\u00EDdas e replicadas. 
infinispan.component.state-transfer.add=Adiciona a configura\u00E7\u00E3o da transfer\u00EAncia do estado.
infinispan.component.state-transfer.remove=Remove a configura\u00E7\u00E3o da transfer\u00EAncia do estado.
infinispan.component.state-transfer.enabled=Caso ativado, isto levar\u00E1 o cache a perguntar os caches vizinhos pelo estado quando ele inicia, de forma que o cache come\u00E7a a 'esquentar', embora isto impacte no per\u00EDodo de inicializa\u00E7\u00E3o.
infinispan.component.state-transfer.enabled.deprecated=Preterido. Sempre habilitar para caches replicadas e distribu\u00EDdas. 
infinispan.component.state-transfer.timeout=A quantidade m\u00E1xima de tempo (ms) para aguardar o estado dos caches vizinhos, antes de lan\u00E7ar uma exce\u00E7\u00E3o e anular a inicializa\u00E7\u00E3o. Se o tempo limite for 0, a transfer\u00EAncia de estado ser\u00E1 executada de maneira ass\u00EDncrona e o cache ficar\u00E1 imediatamente dispon\u00EDvel.
infinispan.component.state-transfer.chunk-size=O n\u00FAmero m\u00E1ximo de entradas de cache em um lote de estado transferido.

infinispan.distributed-cache=Uma configura\u00E7\u00E3o de cache distribu\u00EDda
infinispan.distributed-cache.add=Adiciona o cache distribu\u00EDdo a este cont\u00EAiner do cache.
infinispan.distributed-cache.remove=Remove o cache distribu\u00EDdo a partir deste cont\u00EAiner do cache.
infinispan.distributed-cache.owners=N\u00FAmero das r\u00E9plicas do cluster para cada entrada.
infinispan.distributed-cache.virtual-nodes=Preterido. N\u00E3o possui efeito.
infinispan.distributed-cache.virtual-nodes.deprecated=Preterido. N\u00E3o possui efeito.
infinispan.distributed-cache.l1-lifespan=O tempo de vida m\u00E1ximo de uma entrada posicionada no cache de L1. Esse elemento configura o comportamento do cache de L1 nas inst\u00E2ncias de caches 'distribu\u00EDdas'. Esse elemento \u00E9 ignorado em quaisquer outros modos.
infinispan.distributed-cache.capacity-factor=Controla a propor\u00E7\u00E3o de entradas que residir\u00E1 no n\u00F3 local, comparado aos outros n\u00F3s no cluster. 

infinispan.scattered-cache=Uma configura\u00E7\u00E3o de cache disperso.
infinispan.scattered-cache.add=Adicionar um cache disperso a este cont\u00EAiner de cache
infinispan.scattered-cache.remove=Remove um cache disperso deste cont\u00EAiner de cache
infinispan.scattered-cache.bias-lifespan=Quando maior que zero, especifica por quanto tempo (em ms) uma entrada de cache ser\u00E1 armazenada em cache em um n\u00E3o propriet\u00E1rio ap\u00F3s uma opera\u00E7\u00E3o de grava\u00E7\u00E3o.
infinispan.scattered-cache.invalidation-batch-size=O limite ap\u00F3s o qual invalida\u00E7\u00F5es em lote s\u00E3o enviadas.

infinispan.cache.store=Um armazenamento persistente de uma cache. 
infinispan.cache.component=Um componente de configura\u00E7\u00E3o de uma cache. 

infinispan.component.locking=A configura\u00E7\u00E3o de bloqueio do cache.
infinispan.component.locking.add=Adiciona o elemento de configura\u00E7\u00E3o de bloqueio ao cache.
infinispan.component.locking.remove=Remove o elemento de configura\u00E7\u00E3o de bloqueio do cache.
infinispan.component.locking.isolation=Determina o n\u00EDvel de isola\u00E7\u00E3o de bloqueio.
infinispan.component.locking.striping=Caso verdadeiro, o pool de bloqueios compartilhados \u00E9 mantido para todas as entradas que precisam ser bloqueadas. Do contr\u00E1rio, um bloqueio \u00E9 criado por entrada no cache. A distribui\u00E7\u00E3o de bloqueio ajuda a controlar o footprint de mem\u00F3ria, por\u00E9m pode reduzir a simultaneidade no sistema.
infinispan.component.locking.acquire-timeout=O per\u00EDodo m\u00E1ximo para tentar uma aquisi\u00E7\u00E3o de bloqueio particular.
infinispan.component.locking.concurrency-level=O n\u00EDvel de simultaneidade para os cont\u00EAiners de bloqueio. Ajuste o valor de acordo com o n\u00FAmero de threads simult\u00E2neos interagindo com o Infinispan.
# metrics
infinispan.component.locking.current-concurrency-level=O n\u00FAmero estimado dos threads da atualiza\u00E7\u00E3o atual que este cache pode suportar.
infinispan.component.locking.current-concurrency-level.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.component.locking.number-of-locks-available=O n\u00FAmero de bloqueios dispon\u00EDveis para este cache.
infinispan.component.locking.number-of-locks-available.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.component.locking.number-of-locks-held=O n\u00FAmero de bloqueios atualmente em uso por este cache.
infinispan.component.locking.number-of-locks-held.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.

infinispan.component.transaction=A configura\u00E7\u00E3o de transi\u00E7\u00E3o do cache.
infinispan.component.transaction.add=Adiciona o elemento de configura\u00E7\u00E3o da transa\u00E7\u00E3o ao cache.
infinispan.component.transaction.remove=Remove o elemento de configura\u00E7\u00E3o de transa\u00E7\u00E3o do cache.
infinispan.component.transaction.mode=Determina o modo de transa\u00E7\u00E3o do cache a um de NONE, NON_XA, NON_DURABLE_XA, FULL_XA.
infinispan.component.transaction.stop-timeout=Caso houver quaisquer transa\u00E7\u00F5es sendo executadas quando o cache \u00E9 interrompido, o Infinispan espera por transa\u00E7\u00F5es em execu\u00E7\u00E3o remotas e locais sejam encerradas pelo tempo limite de encerramento do cache. 
infinispan.component.transaction.locking=O modo de bloqueio para este cache, um do OPTIMISTIC ou PESSIMISTIC.
infinispan.component.transaction.timeout=A dura\u00E7\u00E3o (em ms) ap\u00F3s a qual as opera\u00E7\u00F5es ociosas ser\u00E3o revertidas.
# metrics
infinispan.component.transaction.commits=O n\u00FAmero de confirma\u00E7\u00F5es de transa\u00E7\u00F5es.
infinispan.component.transaction.commits.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.component.transaction.prepares=O n\u00FAmero de prepara\u00E7\u00F5es de transa\u00E7\u00F5es.
infinispan.component.transaction.prepares.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.component.transaction.rollbacks=O n\u00FAmero de revers\u00F5es de transa\u00E7\u00F5es.
infinispan.component.transaction.rollbacks.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
#
infinispan.memory.object=Configura\u00E7\u00E3o de mem\u00F3ria baseada em objeto no heap.
infinispan.memory.binary=Configura\u00E7\u00E3o de mem\u00F3ria baseada em bin\u00E1rio no heap.
infinispan.memory.off-heap=Configura\u00E7\u00E3o de mem\u00F3ria fora do heap.
infinispan.memory.add=Adiciona o elemento de configura\u00E7\u00E3o de mem\u00F3ria ao cache.
infinispan.memory.remove=Remove um elemento de configura\u00E7\u00E3o de remo\u00E7\u00E3o do cache.
infinispan.memory.size=Limite de remo\u00E7\u00E3o, conforme definido pelo tipo de remo\u00E7\u00E3o.
infinispan.memory.object.size=Aciona a remo\u00E7\u00E3o das entradas menos usadas recentemente quando o n\u00FAmero de entradas de cache excede esse limite.
infinispan.memory.eviction-type=Indica se o atributo de tamanho se refere ao n\u00FAmero de entradas de cache (ou seja, COUNT) ou ao tamanho coletivo das entradas de cache (ou seja, MEMORY).
infinispan.memory.capacity=Define a capacidade do armazenamento fora do heap.
infinispan.memory.strategy=Determina a estrat\u00E9gia de remo\u00E7\u00E3o do cache. As op\u00E7\u00F5es dispon\u00EDveis s\u00E3o 'UNORDERED', 'FIFO', 'LRU', 'LIRS' e 'NONE' (para desativar a remo\u00E7\u00E3o).
infinispan.memory.strategy.deprecated=Descontinuado. A remo\u00E7\u00E3o usa LRU e foi desativada por meio da indefini\u00E7\u00E3o do atributo de tamanho.
infinispan.memory.max-entries=O n\u00FAmero m\u00E1ximo de entradas numa inst\u00E2ncia de cache. Caso o valor selecionado n\u00E3o \u00E9 ao quadrado, o valor atual padronizar\u00E1 ao menor valor ao quadrado do que o selecionado. -1 significa sem limite.
infinispan.memory.max-entries.deprecated=Preterido. Use o atributo de tamanho em vez disso.

# metrics
infinispan.memory.evictions=O n\u00FAmero de opera\u00E7\u00F5es de remo\u00E7\u00E3o de cache.
infinispan.memory.evictions.deprecated=Preterido. Usar o \u00EDndice de avalia\u00E7\u00E3o correspondente no recurso pai.
#
infinispan.component.expiration=A configura\u00E7\u00E3o de expira\u00E7\u00E3o do cache.
infinispan.component.expiration.add=Adiciona um elemento de configura\u00E7\u00E3o de expira\u00E7\u00E3o ao cache.
infinispan.component.expiration.remove=Remove um elemento de configura\u00E7\u00E3o de expira\u00E7\u00E3o do cache.
infinispan.component.expiration.max-idle=O tempo m\u00E1ximo ocioso que uma entrada de cache ser\u00E1 mantida no cache em mil\u00E9simos de segundos. Caso o tempo ocioso exceder, a entrada ser\u00E1 expirada no cluster. -1 significa que as entradas nunca expiram.
infinispan.component.expiration.lifespan=O lifespan m\u00E1ximo de uma entrada de cache, ap\u00F3s a entrada ser expirada no cluster em mil\u00E9simos de segundos. -1 significa que as entradas nunca expiram.
infinispan.component.expiration.interval=Intervalo (em mil\u00E9simos de segundos) entre execu\u00E7\u00F5es subsequentes para limpar as entradas expiradas da mem\u00F3ria e quaisquer stores de cache. Caso voc\u00EA deseje desativar o processo de remo\u00E7\u00E3o peri\u00F3dica tamb\u00E9m, configure o wakeupInterval para -1.

infinispan.store.custom=A configura\u00E7\u00E3o de store do cache.
infinispan.store.custom.add=Adiciona o elemento de configura\u00E7\u00E3o de store do cache b\u00E1sico ao cache.
infinispan.store.custom.remove=Remove o elemento de store do cache do cache.

infinispan.store.shared=Esta configura\u00E7\u00E3o deve ser configurada para verdadeiro quando inst\u00E2ncias de cache m\u00FAltiplas compartilham o mesmo store de cache (ex.: n\u00F3s m\u00FAltiplos num cluster usando um JDBC baseado no CacheStpre direcionando ao mesmo banco de dados compartilhado. A configura\u00E7\u00E3o disto para verdadeiro evita que inst\u00E2ncias de cache m\u00FAltiplas gravem a mesma modifica\u00E7\u00E3o diversas vezes. Caso ativado, apenas o n\u00F3 onde a modifica\u00E7\u00E3o originou gravar\u00E1 no store do cache. Caso desativado, cada cache individual reage a uma atualiza\u00E7\u00E3o remota potencial aplicando o store nos dados para o store cache.
infinispan.store.preload=Caso verdadeiro, quando o cache inicia, os dados com store ter\u00E3o pr\u00E9-carregados na mem\u00F3ria. Isto \u00E9 particularmente \u00FAtil quando os dados no store do cache s\u00E3o necess\u00E1rios imediatamente ap\u00F3s a inicializa\u00E7\u00E3o e voc\u00EA deseja evitar que as opera\u00E7\u00F5es de cache atrasem como resultado do carregamento vagaroso dos dados. Isto pode ser usado para fornecer um 'warm-cache' na inicializa\u00E7\u00E3o, no entanto existe uma penalidade de desempenho uma vez que a inicializa\u00E7\u00E3o \u00E9 afetada pelo processo.
infinispan.store.passivation=Caso verdadeiro, os dados s\u00E3o apenas gravados no armazenamento de cache quando ele \u00E9 despejado da mem\u00F3ria, um fen\u00F4meno conhecido como 'passiva\u00E7\u00E3o'. A pr\u00F3xima vez que os dados forem solicitados, ser\u00E1 'ativado', que significa que os dados ser\u00E3o trazidos \u00E0 mem\u00F3ria e exclu\u00EDdos do armazenamento persistente. Caso falso, o armazenamento de cache cont\u00E9m uma c\u00F3pia dos conte\u00FAdos na mem\u00F3ria, portanto grava\u00E7\u00F5es ao cache resultam em grava\u00E7\u00F5es de armazenamento de cache. Essencialmente isto fornece uma configura\u00E7\u00E3o 'write-through'.
infinispan.store.fetch-state=Caso verdadeiro, isto busca pelo estado de persist\u00EAncia quando unindo-se ao um cluster. Caso stores m\u00FAltiplos de cache s\u00E3o encadeados, apenas um deles pode possuir esta propriedade ativada.
infinispan.store.purge=Caso verdadeiro, isto limpa o cache quando ele inicia.
infinispan.store.max-batch-size=O tamanho m\u00E1ximo de um lote a ser inserido/exclu\u00EDdo do reposit\u00F3rio. Se o valor for menor que um, nenhum limite superior ser\u00E1 colocado no n\u00FAmero de opera\u00E7\u00F5es em um lote.
infinispan.store.singleton=Caso verdadeiro, o store do cache do singleton store \u00E9 ativado. O SingletonStore \u00E9 um store de cache de delega\u00E7\u00E3o usado em situa\u00E7\u00F5es onde uma inst\u00E2ncia num cluster deve interagir com o store subjacente.
infinispan.store.singleton.deprecated=Preterido. Considere substituir pelo uso de um armazenamento compartilhado, em que as grava\u00E7\u00F5es s\u00E3o realizadas somente por propriet\u00E1rios prim\u00E1rios.
infinispan.store.class=A classe de implementa\u00E7\u00E3o do store personalizado de uso para este store do cache.
infinispan.store.write-behind=Filho a configurar o cache store como um write-behind o inv\u00E9s de write-through.
infinispan.store.properties=Uma lista de propriedades de store de cache.
infinispan.store.properties.property=Uma propriedade de store de cache com nome e valor.
infinispan.store.property=Uma propriedade de store de cache com nome e valor.
infinispan.store.write=O comportamento da grava\u00E7\u00E3o do armazenamento de cache. 
# metrics
infinispan.store.cache-loader-loads=O n\u00FAmero de cargas do n\u00F3 do carregador de cache.
infinispan.store.cache-loader-loads.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.
infinispan.store.cache-loader-misses=O n\u00FAmero de erros do n\u00F3 do carregador de cache.
infinispan.store.cache-loader-misses.deprecated=Preterido. Use a m\u00E9trica do recurso de cache de tempo de execu\u00E7\u00E3o correspondente.

infinispan.component.persistence.cache-loader-loads=O n\u00FAmero de entradas carregadas por este carregador de cache.
infinispan.component.persistence.cache-loader-misses=O n\u00FAmero de erros de carregamento de entradas por este carregador de cache.

infinispan.write.behind=Configura o cache store como um write-behind o inv\u00E9s de write-through.
infinispan.write.behind.add=Adiciona o elemento da configura\u00E7\u00E3o write-behind ao store.
infinispan.write.behind.remove=Remove o elemento de configura\u00E7\u00E3o write-behind do storage.
infinispan.write.behind.flush-lock-timeout=O tempo limite para adquirir o bloqueio do estado a ser esvaziado ao store do cache periodicamente.
infinispan.write.behind.flush-lock-timeout.deprecated=Preterido. Este atributo n\u00E3o \u00E9 mais utilizado. 
infinispan.write.behind.modification-queue-size=O n\u00FAmero m\u00E1ximo de entradas na fila ass\u00EDncrona. Quando a fila estiver cheia, o store torna-se write-through at\u00E9 que ele possa aceitar novas entradas.
infinispan.write.behind.shutdown-timeout=O tempo limite em mil\u00E9simos de segundos para encerrar o store do cache.
infinispan.write.behind.shutdown-timeout.deprecated=Preterido. Este atributo n\u00E3o \u00E9 mais utilizado. 
infinispan.write.behind.thread-pool-size=O tamanho do pool thread cujos threads s\u00E3o respons\u00E1veis pela aplica\u00E7\u00E3o das modifica\u00E7\u00F5es ao store do cache.

infinispan.write.through=Configura um armazenamento de cache como write-throuth. 
infinispan.write.through.add=Adiciona uma configura\u00E7\u00E3o write-through ao armazenamento. 
infinispan.write.through.remove=Remove uma configura\u00E7\u00E3o write-through do armazenamento. 

infinispan.property=Uma propriedade de store de cache com nome e valor.
infinispan.property.deprecated=Preterido. Utilize atributo "propriedade" do recurso de armazenamento de cache apropriado. 
infinispan.property.add=Adiciona a propriedade do store do cache.
infinispan.property.remove=Remove uma propriedade do store do cache.
infinispan.property.value=O valor da propriedade store do cache.

infinispan.store.none=Uma configura\u00E7\u00E3o store-less. 
infinispan.store.none.add=Adiciona uma configura\u00E7\u00E3o store-less a esta cache. 
infinispan.store.none.remove=Remove uma configura\u00E7\u00E3o store-less a partir deste cache. 

infinispan.store.file=A configura\u00E7\u00E3o do store do arquivo do cache.
infinispan.store.file.add=Adiciona o elemento da configura\u00E7\u00E3o do store cache de arquivo ao cache.
infinispan.store.file.remove=Remove um elemento de configura\u00E7\u00E3o do storw do arquivo do cache a partir do cache.
infinispan.store.file.relative-to=O caminho de sistema para o qual o caminho especificado \u00E9 relativo. 
infinispan.store.file.path=O caminho de sistema sob o qual este armazenamento de cache ir\u00E1 persistir usas entradas. 

infinispan.store.jdbc=A configura\u00E7\u00E3o do store JDBC do cache.
infinispan.store.jdbc.add=Adiciona o elemento de configura\u00E7\u00E3o dJDBC cache store ao cache.
infinispan.store.jdbc.remove=Remove um elemento de configura\u00E7\u00E3o de armazenamento de cache JDBC para o cache. 
infinispan.store.jdbc.data-source=Referencia a fonte de dados utilizada para conectar-se a este armazenamento. 
infinispan.store.jdbc.datasource=O nome Jndi da fonte de dados utilizada para conetar a este armazenamento.  
infinispan.store.jdbc.datasource.deprecated=Preterido. Substitu\u00EDdo pela fonte de dados. 
infinispan.store.jdbc.dialect=O dialeto deste armazenamento de dados.
infinispan.store.jdbc.table=Define uma tabela utilizada para armazenar os dados de cache persistentes. 
infinispan.store.jdbc.binary-keyed-table=Define uma tabela utilizada para armazenar entradas de cache cujas chaves n\u00E3o podem ser expressadas como sequ\u00EAncias. 
infinispan.store.jdbc.binary-keyed-table.deprecated=Preterido. Use recurso dependente table=binary. 
infinispan.store.jdbc.binary-keyed-table.table.prefix=O prefixo para o nome da tabela do banco de dados.
infinispan.store.jdbc.binary-keyed-table.table.batch-size=O tamanho do lote determina quantas inser\u00E7\u00F5es s\u00E3o agrupadas em lote nas inser\u00E7\u00F5es DB.
infinispan.store.jdbc.binary-keyed-table.table.fetch-size=O tamanho da pesquisa ser\u00E1 usada para determinar o tamanho da pesquisa no ResultSets nas consultas DB.
infinispan.store.jdbc.binary-keyed-table.table.create-on-start=Indica se o store deve criar esta tabela de banco de dados quando o cache \u00E9 iniciado.
infinispan.store.jdbc.binary-keyed-table.table.drop-on-stop=Indica se o store deve soltar esta tabela de banco de dados quando o cache \u00E9 parado.
infinispan.store.jdbc.binary-keyed-table.table.column.name=
infinispan.store.jdbc.binary-keyed-table.table.column.type=
infinispan.store.jdbc.binary-keyed-table.table.id-column=A coluna do banco de dados para manter os ids da entrada do cache.
infinispan.store.jdbc.binary-keyed-table.table.id-column.column.name=O nome da coluna do banco de dados.
infinispan.store.jdbc.binary-keyed-table.table.id-column.column.type=O tipo da coluna do banco de dados.
infinispan.store.jdbc.binary-keyed-table.table.data-column=A coluna do banco de dados para manter os dados de entrada do cache.
infinispan.store.jdbc.binary-keyed-table.table.data-column.column.name=O nome da coluna do banco de dados.
infinispan.store.jdbc.binary-keyed-table.table.data-column.column.type=O tipo da coluna do banco de dados.
infinispan.store.jdbc.binary-keyed-table.table.timestamp-column=A coluna do banco de dados para manter os timestamps de entrada do cache.
infinispan.store.jdbc.binary-keyed-table.table.timestamp-column.column.name=O nome da coluna do banco de dados.
infinispan.store.jdbc.binary-keyed-table.table.timestamp-column.column.type=O tipo da coluna do banco de dados.

infinispan.store.jdbc.string-keyed-table=Define uma tabela utilizada para armazenar as entradas de cache persistentes. 
infinispan.store.jdbc.string-keyed-table.deprecated=Preterido. Utilize recursos dependente table=string. 
infinispan.store.jdbc.string-keyed-table.table.prefix=O prefixo para o nome da tabela do banco de dados.
infinispan.store.jdbc.string-keyed-table.table.batch-size=O tamanho do lote determina quantas inser\u00E7\u00F5es s\u00E3o agrupadas em lote nas inser\u00E7\u00F5es DB.
infinispan.store.jdbc.string-keyed-table.table.fetch-size=O tamanho da pesquisa ser\u00E1 usada para determinar o tamanho da pesquisa no ResultSets nas consultas DB.
infinispan.store.jdbc.string-keyed-table.table.create-on-start=Indica se o store deve criar esta tabela de banco de dados quando o cache \u00E9 iniciado.
infinispan.store.jdbc.string-keyed-table.table.drop-on-stop=Indica se o store deve soltar esta tabela de banco de dados quando o cache \u00E9 parado.
infinispan.store.jdbc.string-keyed-table.table.column.name=
infinispan.store.jdbc.string-keyed-table.table.column.type=
infinispan.store.jdbc.string-keyed-table.table.id-column=A coluna do banco de dados para manter os ids da entrada do cache.
infinispan.store.jdbc.string-keyed-table.table.id-column.column.name=O nome da coluna do banco de dados.
infinispan.store.jdbc.string-keyed-table.table.id-column.column.type=O tipo da coluna do banco de dados.
infinispan.store.jdbc.string-keyed-table.table.data-column=A coluna do banco de dados para manter os dados de entrada do cache.
infinispan.store.jdbc.string-keyed-table.table.data-column.column.name=O nome da coluna do banco de dados.
infinispan.store.jdbc.string-keyed-table.table.data-column.column.type=O tipo da coluna do banco de dados.
infinispan.store.jdbc.string-keyed-table.table.timestamp-column=A coluna do banco de dados para manter os timestamps de entrada do cache.
infinispan.store.jdbc.string-keyed-table.table.timestamp-column.column.name=O nome da coluna do banco de dados.
infinispan.store.jdbc.string-keyed-table.table.timestamp-column.column.type=O tipo da coluna do banco de dados.

infinispan.store.binary-jdbc.deprecated=Preterido. Ser\u00E1 removido sem substitui\u00E7\u00E3o em um lan\u00E7amento futuro. Use store=jdbc como alternativa.
infinispan.store.mixed-jdbc.deprecated=Preterido. Ser\u00E1 removido sem substitui\u00E7\u00E3o em um lan\u00E7amento futuro. Use store=jdbc como alternativa.

infinispan.table.binary=Define uma tabela utilizada para armazenar entradas de cache cujas chaves n\u00E3o podem ser expressadas como sequ\u00EAncias. 
infinispan.table.binary.deprecated=Preterido. Define uma tabela usada para armazenar entradas de cache cujas chaves n\u00E3o podem ser expressadas como cadeias de caracteres.
infinispan.table.binary.add=Adiciona uma tabela utilizada para armazenar entradas de cache cujas chaves n\u00E3o podem ser expressadas como sequ\u00EAncias. 
infinispan.table.binary.remove=Remove uma tabela utilizada para armazenar entradas de cache cujas chaves n\u00E3o podem ser expressadas como sequ\u00EAncias. 
infinispan.table.string=Define uma tabela utilizada para armazenar entradas de cache cujas chaves podem ser expressadas como sequ\u00EAncias. 
infinispan.table.string.add=Adiciona uma tabela utilizada para armazenar entradas de cache cujas chaves podem ser expressadas como sequ\u00EAncias. 
infinispan.table.string.remove=Remove uma tabela utilizada para armazenar entradas de cache cujas chaves podem ser expressadas como sequ\u00EAncias. 

infinispan.table.prefix=O prefixo para o nome da tabela do banco de dados.
infinispan.table.batch-size=O tamanho do lote determina quantas inser\u00E7\u00F5es s\u00E3o agrupadas em lote nas inser\u00E7\u00F5es DB.
infinispan.table.batch-size.deprecated=Descontinuado. Use max-batch-size em vez disso.
infinispan.table.fetch-size=O tamanho da pesquisa ser\u00E1 usada para determinar o tamanho da pesquisa no ResultSets nas consultas DB.
infinispan.table.create-on-start=Indica se o store deve criar esta tabela de banco de dados quando o cache \u00E9 iniciado.
infinispan.table.drop-on-stop=Indica se o store deve soltar esta tabela de banco de dados quando o cache \u00E9 parado.
infinispan.table.id-column=A coluna do banco de dados para manter os ids da entrada do cache.
infinispan.table.id-column.column.name=O nome da coluna do banco de dados.
infinispan.table.id-column.column.type=O tipo da coluna do banco de dados.
infinispan.table.data-column=A coluna do banco de dados para manter os dados de entrada do cache.
infinispan.table.data-column.column.name=O nome da coluna do banco de dados.
infinispan.table.data-column.column.type=O tipo da coluna do banco de dados.
infinispan.table.timestamp-column=A coluna do banco de dados para manter os timestamps de entrada do cache.
infinispan.table.timestamp-column.column.name=O nome da coluna do banco de dados.
infinispan.table.timestamp-column.column.type=O tipo da coluna do banco de dados.

# /subsystem=infinispan/cache-container=X/cache=Y/store=remote
infinispan.store.remote=A configura\u00E7\u00E3o store remoto do cache.
infinispan.store.remote.deprecated=Use o reposit\u00F3rio HotRod em vez disso.
infinispan.store.remote.cache=O nome do cache remoto para uso no store remoto.
infinispan.store.remote.tcp-no-delay=Um valor TCP_NODELAY para a comunica\u00E7\u00E3o do cache remoto.
infinispan.store.remote.socket-timeout=O intervalo do socket para a comunica\u00E7\u00E3o do cache remoto.
infinispan.store.remote.remote-servers=Uma lista dos servidores remotos para esse store cache.
infinispan.store.remote.remote.servers.remote-server=Um servidor remoto, definido pelo binding do socket externo.
infinispan.store.remote.remote-servers.remote-server.outbound-socket-binding=Um binding do socket externo para o servidor remoto.
infinispan.store.remote.add=Adiciona o elemento de configura\u00E7\u00E3o do store cache remoto ao cache.
infinispan.store.remote.remove=Remove um elemento de configura\u00E7\u00E3o de store remoto do cache do cache.

# /subsystem=infinispan/cache-container=X/cache=Y/store=hotrod
infinispan.store.hotrod=Reposit\u00F3rio baseado no HotRod usando a inst\u00E2ncia do Infinispan Server para armazenar dados.
infinispan.store.hotrod.add=Adiciona um reposit\u00F3rio HotRod.
infinispan.store.hotrod.remove=Remove um reposit\u00F3rio HotRod.
infinispan.store.hotrod.cache-configuration=Nome do modelo de configura\u00E7\u00E3o de cache definido no Infinispan Server a partir do qual os caches ser\u00E3o criados.
infinispan.store.hotrod.remote-cache-container=Refer\u00EAncia a um cont\u00EAiner de cache remoto gerenciado por cont\u00EAiner.

infinispan.backup=Um site de backup no qual replicar este cache. 
infinispan.backup.add=Adiciona um site de backup para este cache.
infinispan.backup.remove=Remove um site de backup deste cache. 
infinispan.backup.strategy=A estrat\u00E9gia de backup para este cache
infinispan.backup.failure-policy=A pol\u00EDtica a seguir quando a conectividade ao site de backup falha. 
infinispan.backup.enabled=Indica se ativa ou n\u00E3o este site de backup. 
infinispan.backup.timeout=O tempo de expira\u00E7\u00E3o para replicar no site de backup. 
infinispan.backup.after-failures=Indica o n\u00FAmero de falhas ap\u00F3s as quais este site de backup deve passar para offline. 
infinispan.backup.min-wait=Indica o tempo m\u00EDnimo (em milissegundos) para aguardar ap\u00F3s o n\u00FAmero m\u00E1ximo de falhas \u00E9 atingido, depois do qual este site de backup deve passar para offline. 
# cross-site backup operations
infinispan.backup.site-status=Exibe o status atual do site de backup. 
infinispan.backup.bring-site-online=Reativa uma backup site previamente desabilitado. 
infinispan.backup.take-site-offline=Desativa backup para um site remoto. 

infinispan.component.backup-for=Uma cache para a qual este cache age como um backup (para utiliza\u00E7\u00E3o em replica\u00E7\u00E3o entre sites)
infinispan.component.backup-for.deprecated=Descontinuado. A designa\u00E7\u00E3o de backup deve corresponder ao nome do cache atual.
infinispan.component.backup-for.add=Adiciona uma designa\u00E7\u00E3o de backup para esta cache. 
infinispan.component.backup-for.remove=Remove uma designa\u00E7\u00E3o de backup para esta cache. 
infinispan.component.backup-for.remote-cache=O nome da cache remoto para o qual esta cache age como backup.
infinispan.component.backup-for.remote-cache.deprecated=Este recurso est\u00E1 preterido.
infinispan.component.backup-for.remote-site=O site da cache remota para o qual esta cache age como um backup. 
infinispan.component.backup-for.remote-site.deprecated=Este recurso est\u00E1 preterido.

infinispan.component.backups=Os backups remotos para esta cache. 
infinispan.component.backups.add=Adiciona um suporte de backup remoto para esta cache. 
infinispan.component.backups.remove=Remove suporte de backup remoto para esta cache. 
infinispan.component.backups.backup=Um backup remoto. 

# /subsystem=infinispan/remote-cache-container=*
infinispan.remote-cache-container=A configura\u00E7\u00E3o de um cont\u00EAiner do cache Infinispan remoto.
infinispan.remote-cache-container.add=Adiciona um cont\u00EAiner do cache remoto ao subsistema infinispan
infinispan.remote-cache-container.remove=Remove um cont\u00EAiner do cache do subsistema infinispan.
infinispan.remote-cache-container.component=Um componente de configura\u00E7\u00E3o de um cont\u00EAiner de cache remoto.
infinispan.remote-cache-container.thread-pool=Define pools de thread para este cont\u00EAiner de cache remoto.
infinispan.remote-cache-container.near-cache=Configura o cache pr\u00F3ximo.
infinispan.remote-cache-container.connection-timeout=Define o tempo limite m\u00E1ximo de conex\u00E3o do soquete antes de desistir da conex\u00E3o com o servidor.
infinispan.remote-cache-container.default-remote-cluster=Cluster de servidor remoto padr\u00E3o exigido.
infinispan.remote-cache-container.key-size-estimate=Essa dica permite o dimensionamento de buffers de bytes ao serializar e desserializar chaves, para minimizar o redimensionamento de matriz.
infinispan.remote-cache-container.max-retries=Define o n\u00FAmero m\u00E1ximo de novas tentativas para cada solicita\u00E7\u00E3o. Um valor v\u00E1lido deve ser maior ou igual a 0. Zero significa que n\u00E3o ser\u00E1 feita nova tentativa em caso de falha de rede.
infinispan.remote-cache-container.module=Define o m\u00F3dulo cujo carregador de classe deve ser usado ao configurar o marshaller do cont\u00EAiner de cache remoto.
infinispan.remote-cache-container.name=Identifica exclusivamente esse cont\u00EAiner de cache remoto.
infinispan.remote-cache-container.protocol-version=Essa propriedade define a vers\u00E3o do protocolo que o cliente deve usar.
infinispan.remote-cache-container.socket-timeout=Ative ou desative SO_TIMEOUT em conex\u00F5es de soquete para servidores Hot Rod remotos com o tempo limite especificado em milissegundos. Um tempo limite de 0 \u00E9 interpretado como um tempo limite infinito.
infinispan.remote-cache-container.statistics-enabled=Permite a coleta de estat\u00EDsticas para este cache remoto.
infinispan.remote-cache-container.tcp-no-delay=Ative ou desative o TCP_NODELAY em conex\u00F5es de soquete para servidores Hot Rod remotos.
infinispan.remote-cache-container.tcp-keep-alive=Configura o TCP Keepalive na pilha TCP.
infinispan.remote-cache-container.value-size-estimate=Essa dica permite o dimensionamento de buffers de bytes ao serializar e desserializar valores, para minimizar o redimensionamento de matriz.
infinispan.remote-cache-container.active-connections=O n\u00FAmero de conex\u00F5es ativas com o servidor Infinispan.
infinispan.remote-cache-container.connections=O n\u00FAmero total de conex\u00F5es com o servidor Infinispan.
infinispan.remote-cache-container.idle-connections=O n\u00FAmero de conex\u00F5es ociosas com o servidor Infinispan.
infinispan.remote-cache-container.remote-cache=Um recurso de tempo de execu\u00E7\u00E3o de cache remoto

infinispan.remote-cache.average-read-time=O tempo m\u00E9dio de leitura, em milissegundos, para este cache remoto.
infinispan.remote-cache.average-remove-time=O tempo m\u00E9dio de remo\u00E7\u00E3o, em milissegundos, para este cache remoto.
infinispan.remote-cache.average-write-time=O tempo m\u00E9dio de grava\u00E7\u00E3o, em milissegundos, para este cache remoto.
infinispan.remote-cache.near-cache-hits=O n\u00FAmero de acertos de near cache para este cache remoto.
infinispan.remote-cache.near-cache-invalidations=O n\u00FAmero de invalida\u00E7\u00F5es de near cache para este cache remoto.
infinispan.remote-cache.near-cache-misses=O n\u00FAmero de erros de near cache para este cache remoto.
infinispan.remote-cache.near-cache-size=O n\u00FAmero de entradas no near cache para este cache remoto.
infinispan.remote-cache.hits=O n\u00FAmero de acertos para este cache remoto, excluindo os acertos do near cache.
infinispan.remote-cache.misses=O n\u00FAmero de erros para este cache remoto.
infinispan.remote-cache.removes=O n\u00FAmero de remo\u00E7\u00F5es para este cache remoto.
infinispan.remote-cache.writes=O n\u00FAmero de grava\u00E7\u00F5es para este cache remoto.
infinispan.remote-cache.reset-statistics=Redefine as estat\u00EDsticas para este cache remoto.
infinispan.remote-cache.time-since-reset=O n\u00FAmero de segundos desde que as estat\u00EDsticas foram redefinidas neste cache remoto.

# /subsystem=infinispan/remote-cache-container=X/thread-pool=async
infinispan.thread-pool.async=Define um thread pool utilizado para opera\u00E7\u00F5es ass\u00EDncronas. 
infinispan.thread-pool.async.add=Adiciona uma configura\u00E7\u00E3o de pool de threads usada para opera\u00E7\u00F5es ass\u00EDncronas.
infinispan.thread-pool.async.remove=Remove uma configura\u00E7\u00E3o de pool de threads usada para opera\u00E7\u00F5es ass\u00EDncronas.

# /subsystem=infinispan/remote-cache-container=*/component=connection-pool
infinispan.component.connection-pool=Configura\u00E7\u00E3o do pool de conex\u00F5es.
infinispan.component.connection-pool.add=Adicionar uma configura\u00E7\u00E3o do pool de conex\u00F5es.
infinispan.component.connection-pool.remove=Remove uma configura\u00E7\u00E3o do pool de conex\u00F5es.
infinispan.component.connection-pool.exhausted-action=Especifica o que acontece quando \u00E9 solicitada uma conex\u00E3o do pool de um servidor e esse pool est\u00E1 esgotado.
infinispan.component.connection-pool.max-active=Controla o n\u00FAmero m\u00E1ximo de conex\u00F5es por servidor que s\u00E3o alocadas (verificadas para threads do cliente ou ociosas no pool) por vez. Quando n\u00E3o for positivo, n\u00E3o haver\u00E1 limite para o n\u00FAmero de conex\u00F5es por servidor. Quando maxActive for atingido, o pool de conex\u00F5es desse servidor ser\u00E1 considerado esgotado. O valor -1 significa sem limite.
infinispan.component.connection-pool.max-wait=A quantidade de tempo em milissegundos para aguardar uma conex\u00E3o ficar dispon\u00EDvel quando a a\u00E7\u00E3o esgotada for ExhaustedAction.WAIT, ap\u00F3s o qual uma java.util.NoSuchElementException ser\u00E1 lan\u00E7ada. Se um valor negativo for fornecido, o pool ser\u00E1 bloqueado indefinidamente.
infinispan.component.connection-pool.min-evictable-idle-time=Especifica a quantidade de tempo m\u00EDnima que uma conex\u00E3o pode ficar inativa no pool antes de ser eleg\u00EDvel para remo\u00E7\u00E3o devido ao tempo inativo. Quando n\u00E3o positivo, nenhuma conex\u00E3o ser\u00E1 descartada do pool somente devido ao tempo ocioso. Essa configura\u00E7\u00E3o n\u00E3o tem efeito a menos que timeBetweenEvictionRunsMillis > 0.
infinispan.component.connection-pool.min-idle=Define um valor de destino para o n\u00FAmero m\u00EDnimo de conex\u00F5es ociosas (por servidor) que deve estar sempre dispon\u00EDvel. Se esse par\u00E2metro for configurado para um n\u00FAmero positivo e timeBetweenEvictionRunsMillis > 0, sempre que o thread de remo\u00E7\u00E3o de conex\u00E3o ociosa for executado, ele tentar\u00E1 criar inst\u00E2ncias ociosas suficientes para que as inst\u00E2ncias inativas de minIdle fiquem dispon\u00EDveis para cada servidor.

# /subsystem=infinispan/remote-cache-container=*/near-cache=invalidation
infinispan.near-cache.invalidation=Configura usando o cache pr\u00F3ximo no modo invalidado. Quando as entradas forem atualizadas ou removidas do lado do servidor, as mensagens de invalida\u00E7\u00E3o ser\u00E3o enviadas aos clientes para remov\u00EA-las do cache local.
infinispan.near-cache.invalidation.add=Adiciona um cache pr\u00F3ximo no modo invalidado.
infinispan.near-cache.invalidation.remove=Remove um cache pr\u00F3ximo no modo invalidado.
infinispan.near-cache.invalidation.max-entries=Define o n\u00FAmero m\u00E1ximo de elementos a serem mantidos no cache pr\u00F3ximo.

# /subsystem=infinispan/remote-cache-container=*/near-cache=none
infinispan.near-cache.none=Desativa o cache pr\u00F3ximo.
infinispan.near-cache.none.add=Adiciona uma configura\u00E7\u00E3o que desativa o cache pr\u00F3ximo.
infinispan.near-cache.none.remove=Remove uma configura\u00E7\u00E3o que desativa o cache pr\u00F3ximo.

# /subsystem=infinispan/remote-cache-container=*/component=remote-clusters/remote-cluster=*
infinispan.remote-cluster=Configura\u00E7\u00E3o de um cluster remoto.
infinispan.remote-cluster.add=Adiciona uma configura\u00E7\u00E3o de cluster remoto que requer a configura\u00E7\u00E3o de socket-bindings.
infinispan.remote-cluster.remove=Remove essa configura\u00E7\u00E3o de cluster remoto.
infinispan.remote-cluster.socket-bindings=Lista de outbound-socket-bindings dos servidores Hot Rod para conex\u00E3o.
infinispan.remote-cluster.switch-cluster=Alterne o cluster com o qual este cliente HotRod deve se comunicar. Prim\u00E1rio usado para retornar ao site local em caso de failover de um site.

# /subsystem=infinispan/remote-cache-container=*/component=security
infinispan.component.security=Configura\u00E7\u00E3o de seguran\u00E7a.
infinispan.component.security.add=Adiciona configura\u00E7\u00E3o de seguran\u00E7a.
infinispan.component.security.remove=Remove configura\u00E7\u00E3o de seguran\u00E7a.
infinispan.component.security.ssl-context=Refer\u00EAncia ao SSLContext gerenciado pelo Elytron a ser usado para conex\u00E3o com o cluster remoto.

