# Subsystem
modcluster=Configuration et op\u00E9rations de runtime pour le sous-syst\u00E8me mod_cluster.
modcluster.add=Ajoutez le sous-syst\u00E8me mod_cluster qui laisse le serveur dans l'\u00E9tat \u00AB\u00A0reload-required\u00A0\u00BB.
modcluster.remove=supprimez le sous-syst\u00E8me mod_cluster qui laisse le serveur dans l'\u00E9tat \u00AB\u00A0reload-required\u00A0\u00BB.

# Proxy Configuration
modcluster.mod-cluster-config=Ressource de configuration obsol\u00E8te.
modcluster.proxy=Ressource proxy coupl\u00E9e \u00E0 un seul listener Undertow (et serveur) sp\u00E9cifiant la d\u00E9couverte de l'\u00E9quilibreur de charge, sa configuration et le fournisseur du facteur d'\u00E9quilibrage de charge.
modcluster.proxy.add=Ajout d'une ressource proxy n\u00E9cessitant une r\u00E9f\u00E9rence de listener Undertow laissant le serveur dans l'\u00E9tat \u00AB reload-required'\u00A0\u00BB
modcluster.proxy.remove=Supprimez une ressource proxy qui laisse le serveur dans l'\u00E9tat \u00AB\u00A0reload-required\u00A0\u00BB.
modcluster.proxy.advertise=Indique si le m\u00E9canisme Advertise bas\u00E9 sur la multidiffusion doit \u00EAtre activ\u00E9.
modcluster.proxy.advertise-security-key=Si cette valeur est sp\u00E9cifi\u00E9e, les cheksums de publicit\u00E9 des proxies inverses seront v\u00E9rifi\u00E9s \u00E0 l'aide de cette valeur.
modcluster.proxy.advertise-socket=Nom de la liaison de sockets \u00E0 utiliser pour le socket Advertise.
modcluster.proxy.auto-enable-contexts=Si false, les contextes sont enregistr\u00E9s avec le reverse proxy comme d\u00E9sactiv\u00E9, ils doivent \u00EAtre activ\u00E9s manuellement par l'op\u00E9ration \u00AB\u00A0enable-context\u00A0\u00BB ou via la console mod_cluster_manager (si disponible).
modcluster.proxy.balancer=Nom de l'\u00E9quilibreur de charge sur le proxy inverse aupr\u00E8s duquel s'enregistrer.
modcluster.proxy.connector=Le nom du listener d'Undertow auquel le proxy inverse de mod_cluster se connectera.
modcluster.proxy.connector.deprecated=Obsol\u00E8te. Fonctions d'alias pour l'attribut du listener.
modcluster.proxy.excluded-contexts=Liste des contextes \u00E0 exclure de l'enregistrement avec les proxies inverses.
modcluster.proxy.flush-packets=Indique si le vidage des paquets doit \u00EAtre activ\u00E9 sur le proxy inverse.
modcluster.proxy.flush-wait=Dur\u00E9e d'attente avant de vider les paquets sur le proxy inverse.
modcluster.proxy.listener=Le nom du listener d'Undertow auquel le proxy inverse de mod_cluster se connectera.
modcluster.proxy.load-balancing-group=Nom du groupe d'\u00E9quilibreur de charge auquel ce n\u0153ud appartient.
modcluster.proxy.max-attempts=Nombre maximum de tentatives de basculement par reverse proxy lors de l'envoi de la requ\u00EAte au serveur backend.
modcluster.proxy.node-timeout=D\u00E9lai d'expiration (en secondes) pour les connexions de proxy vers un n\u0153ud. Cela correspond au temps que mod_cluster attend la r\u00E9ponse renvoy\u00E9e avant d'envoyer une erreur.
modcluster.proxy.ping=Dur\u00E9e (en secondes) d'attente pour la r\u00E9ponse d'un pong \u00E0 un ping.
modcluster.proxy.proxies=R\u00E9pertorie les proxies inverses de mod_cluster auxquels se connecter d\u00E9finis par une liaison de socket sortante dans le groupe de liaisons de sockets.
modcluster.proxy.proxy-list=R\u00E9pertorie les proxies inverses sur lesquels s'enregistrer. Format (nom d'h\u00F4te:port) s\u00E9par\u00E9 par des virgules.
modcluster.proxy.proxy-list.deprecated=L'attribut \u00AB\u00A0proxy-list\u00A0\u00BB a \u00E9t\u00E9 d\u00E9pr\u00E9ci\u00E9 en faveur des proxys (liste de r\u00E9f\u00E9rences aux liaisons de sockets sortantes)
modcluster.proxy.proxy-url=URL de base pour les requ\u00EAtes MCMP.
modcluster.proxy.simple-load-provider=Le fournisseur de charge simple retourne un facteur d'\u00E9quilibrage de charge constant pr\u00E9configur\u00E9.
modcluster.proxy.simple-load-provider.deprecated=Obsol\u00E8te. Alias pour \u00E9quilibreur de charge de ressource enfant=simple.
modcluster.proxy.session-draining-strategy=Strat\u00E9gie de drainage de session utilis\u00E9e en cours de suppression de d\u00E9ploiement d'une application web.
modcluster.proxy.smax=Nombre maximum de connexions souples inactives pour le proxy inverse.
modcluster.proxy.socket-timeout=Dur\u00E9e du d\u00E9lai d'attente avant que le proxy ne r\u00E9ponde \u00E0 un message MCMP.
modcluster.proxy.ssl-context=R\u00E9f\u00E9rence au contexte SSL qui va \u00EAtre utilis\u00E9 par mod_cluster.
modcluster.proxy.status-interval=Nombre de secondes pendant lesquelles un message de STATUT est envoy\u00E9 du serveur d'application au proxy.
modcluster.proxy.sticky-session=Indique si les requ\u00EAtes suivantes d'une session donn\u00E9es doivent \u00EAtre rout\u00E9es vers le m\u00EAme n\u0153ud si possible.
modcluster.proxy.sticky-session-force=Indique si le proxy inverse doit envoyer une erreur dans l'hypoth\u00E8se o\u00F9 l'\u00E9quilibreur de charges est incapable d'acheminer une requ\u00EAte vers le n\u0153ud auquel il est coll\u00E9. Ignor\u00E9 si les sessions collantes sont d\u00E9sactiv\u00E9es.
modcluster.proxy.sticky-session-remove=Indique si le proxy inverse doit supprimer le collage de session dans l'hypoth\u00E8se o\u00F9 l'\u00E9quilibreur de charges est incapable d'acheminer une requ\u00EAte vers le n\u0153ud auquel il est coll\u00E9. Ignor\u00E9 si les sessions collantes sont d\u00E9sactiv\u00E9es.
modcluster.proxy.stop-context-timeout=Dur\u00E9e maximum d'attente avant que le processus g\u00E8re les requ\u00EAtes en attente.
modcluster.proxy.ttl=Dur\u00E9e de vie (en secondes) des connexions inactives au dessus de smax.
modcluster.proxy.worker-timeout=D\u00E9lai \u00E0 attendre (en seconde) avant qu'un worker soit disponible pour traiter une requ\u00EAte.

# Load Providers
modcluster.dynamic-load-provider=Ancien alias pour le fournisseur de charge dynamique.
modcluster.load-provider=Le fournisseur de charge fournit les calculs de charge.
modcluster.load-provider.simple=Le fournisseur de charge simple retourne un facteur d'\u00E9quilibrage de charge constant pr\u00E9configur\u00E9.
modcluster.load-provider.simple.add=Le fournisseur de charge simple retourne un facteur d'\u00E9quilibrage de charge constant pr\u00E9configur\u00E9.
modcluster.load-provider.simple.remove=Supprime un simple fournisseur de charge.
modcluster.load-provider.simple.factor=Le fournisseur de charge dynamique calcule le facteur d'\u00E9quilibrage de charge d'un n\u0153ud \u00E0 partir d'un ensemble d\u00E9fini de param\u00E8tres de charge.
modcluster.load-provider.dynamic.add=Ajout d'un fournisseur de charge dynamique sans param\u00E8tres de charge.
modcluster.load-provider.dynamic.remove=Supprimer un fournisseur de charge dynamique, par d\u00E9faut fournisseur de charge simple.
modcluster.load-provider.dynamic.decay=Facteur par lequel les valeurs de charge historiques devraient se d\u00E9grader en importance.
modcluster.load-provider.dynamic.history=Le nombre de valeurs de charge historiques (pr\u00E9c\u00E9dentes) \u00E0 prendre en compte dans le calcul du facteur d'\u00E9quilibrage de charge.
modcluster.load-provider.dynamic.initial-load=Charge initiale dans la plage[0...100] avec laquelle on peut pr\u00E9parer les valeurs historiques. Permet d'amener progressivement la charge au n\u0153ud. La valeur de 0 pr\u00E9-popule avec pleine charge et la valeur de -1 d\u00E9sactive ce comportement.

# Load Metrics
modcluster.load-metric=M\u00E9trique de charge int\u00E9gr\u00E9e contribuant une valeur au facteur de charge global d'un n\u0153ud. Les facteurs de charge de chaque m\u00E9trique sont agr\u00E9g\u00E9s en fonction de leur poids.
modcluster.load-metric.add=Ajoutez une m\u00E9trique de charge \u00E0 l'ensemble des m\u00E9triques de charge pour calculer le facteur de charge.
modcluster.load-metric.remove=Supprimez une m\u00E9trique de charge de l'ensemble des m\u00E9triques de charge pour calculer le facteur de charge.
modcluster.load-metric.type=Type d'une m\u00E9trique de charge int\u00E9gr\u00E9e \u00E0 partir des valeurs \u00E9num\u00E9r\u00E9es.
modcluster.load-metric.class=Nom de classe \u00E0 utiliser pour construire une m\u00E9trique de charge.
modcluster.load-metric.module=Nom du module pour charger la classe m\u00E9trique de charge.
modcluster.load-metric.weight=Nombre indiquant l'importance d'une m\u00E9trique par rapport aux autres m\u00E9triques : par exemple, une m\u00E9trique de poids 2 aura deux fois plus d'impact sur le facteur de charge global qu'une m\u00E9trique de poids 1.
modcluster.load-metric.capacity=Capacit\u00E9 maximale de la m\u00E9trique utilis\u00E9e pour normaliser les valeurs de charge d'une m\u00E9trique qui n\u00E9cessite une capacit\u00E9 explicite.
modcluster.load-metric.property=Propri\u00E9t\u00E9s \u00E0 appliquer sur une instance m\u00E9trique charg\u00E9e.
modcluster.custom-load-metric=M\u00E9trique de charge int\u00E9gr\u00E9e contribuant une valeur au facteur de charge global d'un n\u0153ud. Les facteurs de charge de chaque m\u00E9trique sont agr\u00E9g\u00E9s en fonction de leur poids.

# Runtime-only Operations
modcluster.add-proxy=Ajoute un proxy inverse \u00E0 la liste des proxies aupr\u00E8s desquels s'enregistrer.
modcluster.add-proxy.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.add-proxy.host=H\u00F4te du proxy inverse.
modcluster.add-proxy.port=Port du proxy inverse qui accepte les commandes MCMP.
modcluster.disable=Informe les proxies inverses que tous les contextes du n\u0153ud sont incapables de traiter des requ\u00EAtes.
modcluster.disable.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.disable-context=Informe les proxies inverses que le contexte est incapable de traiter de nouvelles requ\u00EAtes.
modcluster.disable-context.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.disable-context.context=Nom du contexte \u00E0 d\u00E9sactiver.
modcluster.disable-context.virtualhost=Nom de l'h\u00F4te virtuel sur lequel d\u00E9sactiver le contexte.
modcluster.enable=Informe les proxies inverses que tous les contextes sur le n\u0153ud sont pr\u00EAts \u00E0 recevoir des requ\u00EAtes.
modcluster.enable.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.enable-context=Informe les proxies inverses que le contexte est pr\u00EAt \u00E0 recevoir des requ\u00EAtes.
modcluster.enable-context.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.enable-context.context=Nom du contexte \u00E0 activer.
modcluster.enable-context.virtualhost=Nom de l'h\u00F4te virtuel sur lequel activer le contexte.
modcluster.list-proxies=R\u00E9pertories les proxies inverses aupr\u00E8s desquels le n\u0153ud est actuellement enregistr\u00E9.
modcluster.list-proxies.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.read-proxies-configuration=Envoie une commande DUMP aux proxies inverses et affiche le r\u00E9sultat.
modcluster.read-proxies-configuration.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.read-proxies-info=Envoie une commande INFO aux proxies inverses et affiche le r\u00E9sultat.
modcluster.read-proxies-info.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.refresh=Rafra\u00EEchit le n\u0153ud en envoyant un nouveau message CONFIG aux proxies inverses.
modcluster.refresh.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.remove-proxy=Supprime le proxy inverse de la liste des proxies aupr\u00E8s desquels s'enregistrer.
modcluster.remove-proxy.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.remove-proxy.host=H\u00F4te du proxy inverse.
modcluster.remove-proxy.port=Port du proxy inverse.
modcluster.reset=Restaure la connexion du n\u0153ud aux proxies inverses.
modcluster.reset.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.stop=Informe les proxies inverses que tous les contextes sur le n\u0153ud sont incapables de traiter des requ\u00EAtes.
modcluster.stop.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.stop.waittime=D\u00E9lai d'attente (en secondes) avant que commence le vidage des sessions et avant que s'arr\u00EAte le contexte si un vidage de session est en cours. Une valeur n\u00E9gative ou \u00E9gale \u00E0 z\u00E9ro signifie un d\u00E9lai illimit\u00E9.
modcluster.stop-context=Informe les proxies inverses que le contexte est incapable de traiter les requ\u00EAtes.
modcluster.stop-context.deprecated=D\u00E9sapprouv\u00E9 : utiliser une op\u00E9ration identique \u00E0 l'adresse d'un proxy sp\u00E9cifique.
modcluster.stop-context.context=Nom du contexte \u00E0 arr\u00EAter.
modcluster.stop-context.virtualhost=Nom de l'h\u00F4te virtuel sur lequel arr\u00EAter le contexte.
modcluster.stop-context.waittime=D\u00E9lai d'attente (en secondes) avant que commence le vidage des sessions et avant que s'arr\u00EAte le contexte si un vidage de session est en cours. Une valeur n\u00E9gative ou \u00E9gale \u00E0 z\u00E9ro signifie un d\u00E9lai illimit\u00E9.

# Deprecated/Legacy Metric Operations
modcluster.add-metric=Ajout d'une nouvelle m\u00E9trique au fournisseur de facteurs d'\u00E9quilibrage de charge dynamique.
modcluster.add-metric.deprecated=Obsol\u00E8te, utilisez l'op\u00E9ration de gestion \u00AB\u00A0ajouter\u00A0\u00BB.
modcluster.add-metric.type=Type de m\u00E9trique
modcluster.add-metric.weight=Poids de la m\u00E9trique.
modcluster.add-metric.capacity=Capacit\u00E9 de la m\u00E9trique.
modcluster.add-metric.property=Propri\u00E9t\u00E9s de la m\u00E9trique.
modcluster.remove-metric=Ajout d'une m\u00E9trique au fournisseur de facteurs d'\u00E9quilibrage de charge dynamique.
modcluster.remove-metric.deprecated=Obsol\u00E8te, utilisez l'op\u00E9ration standard de gestion \u00AB\u00A0supprimer\u00A0\u00BB.
modcluster.remove-metric.type=Type de m\u00E9trique
modcluster.add-custom-metric=Ajout d'une nouvelle m\u00E9trique au fournisseur de facteurs d'\u00E9quilibrage de charge dynamique.
modcluster.add-custom-metric.deprecated=Obsol\u00E8te, utilisez l'op\u00E9ration de gestion \u00AB\u00A0ajouter\u00A0\u00BB.
modcluster.add-custom-metric.class=Nom de classe de la m\u00E9trique personnalis\u00E9e.
modcluster.add-custom-metric.weight=Poids de la m\u00E9trique.
modcluster.add-custom-metric.capacity=Capacit\u00E9 de la m\u00E9trique.
modcluster.add-custom-metric.property=Propri\u00E9t\u00E9s de la m\u00E9trique.
modcluster.remove-custom-metric=Supprimer une m\u00E9trique personnalis\u00E9e du fournisseur de facteurs d'\u00E9quilibrage de charge dynamique.
modcluster.remove-custom-metric.deprecated=Obsol\u00E8te, utilisez l'op\u00E9ration standard de gestion \u00AB\u00A0supprimer\u00A0\u00BB.
modcluster.remove-custom-metric.class=Nom de classe de la m\u00E9trique personnalis\u00E9e.

# Deprecated/Legacy SSL resource
modcluster.ssl=La configuration SSL dans la logique MCMP du client.
modcluster.ssl.configuration.deprecated=Obsol\u00E8te. Utiliser l'attribut ssl-context pour r\u00E9f\u00E9rencer un contexte SSL g\u00E9r\u00E9 par Elytron.
modcluster.ssl.configuration.add=Ajoute la configuration SSL par d\u00E9faut dans la logique MCMP du client.
modcluster.ssl.configuration.remove=Supprime la configuration SSL de la logique MCMP du client.
modcluster.ssl.configuration.ca-certificate-file=Autorit\u00E9 du certificat.
modcluster.ssl.configuration.ca-revocation-url=Liste de r\u00E9vocation d'autorit\u00E9 des certificats.
modcluster.ssl.configuration.certificate-key-file=Fichier cl\u00E9 du certificat.
modcluster.ssl.configuration.cipher-suite=Liste s\u00E9par\u00E9e par des virgules de cryptogramme de chiffrement que la configuration est autoris\u00E9e \u00E0 utiliser.
modcluster.ssl.configuration.key-alias=L'alias de la cl\u00E9 d\u00E9tenant les certificats clients dans le magasin de cl\u00E9s.
modcluster.ssl.configuration.password=Mot de passe donnant acc\u00E8s au magasin de cl\u00E9s et au magasin de certificats.
modcluster.ssl.configuration.protocol=Protocoles SSL activ\u00E9s.

