# Subsystem
modcluster=Operaciones de configuraci\u00F3n y tiempo de ejecuci\u00F3n para el subsistema mod_cluster.
modcluster.add=A\u00F1ada el subsistema mod_cluster dejando el servidor en estado 'reload-required'.
modcluster.remove=Elimine el subsistema mod_cluster dejando el servidor en estado 'reload-required'.

# Proxy Configuration
modcluster.mod-cluster-config=Recurso de configuraci\u00F3n heredado.
modcluster.proxy=Recurso de proxy combinado con un solo oyente Undertow (y servidor) que especifica la detecci\u00F3n del equilibrador de carga, su configuraci\u00F3n y el proveedor del factor de equilibrio de carga. Se puede especificar la configuraci\u00F3n de proxy.
modcluster.proxy.add=A\u00F1ada un recurso de proxy que requiere una referencia de oyente Undertow, dejando el servidor en estado 'reload-required'.
modcluster.proxy.remove=Elimine un recurso de proxy, dejando el servidor en estado 'reload-required'.
modcluster.proxy.advertise=Si se habilitar\u00E1 el mecanismo de publicidad basado en multicast.
modcluster.proxy.advertise-security-key=Si se especifica, se verificar\u00E1n las sumas de control de los anuncios del proxy inverso utilizando este valor como un valor sal.
modcluster.proxy.advertise-socket=Nombre del enlace del socket que se utilizar\u00E1 para el socket advertise.
modcluster.proxy.auto-enable-contexts=Si son falsos, los contextos se registran con el proxy inverso deshabilitado. Necesitan habilitarse manualmente a trav\u00E9s de la operaci\u00F3n 'enable-context' o a trav\u00E9s de la consola mod_cluster_manager (si est\u00E1 disponible).
modcluster.proxy.balancer=El nombre del equilibrador en el proxy inverso con el cual debe registrarse.
modcluster.proxy.connector=El nombre del oyente Undertow que se registrar\u00E1 con el proxy inverso.
modcluster.proxy.connector.deprecated=Obsoleto. Funciones como alias para el atributo 'oyente'.
modcluster.proxy.excluded-contexts=Lista de contextos para excluir del registro con proxies inversos.
modcluster.proxy.flush-packets=Si se habilita el vaciado de paquetes en el proxy inverso.
modcluster.proxy.flush-wait=Tiempo que se debe esperar antes de vaciar los paquetes en el proxy inverso.
modcluster.proxy.listener=El nombre del oyente Undertow que se registrar\u00E1 con el proxy inverso.
modcluster.proxy.load-balancing-group=Nombre del grupo del equilibrador de carga al que pertenece este nodo.
modcluster.proxy.max-attempts=N\u00FAmero m\u00E1ximo de intentos de conmutaci\u00F3n por proxy inverso al enviar la solicitud al servidor de backend.
modcluster.proxy.node-timeout=Tiempo de espera (en segundos) para las conexiones proxy a un nodo. Este es el tiempo que mod_cluster esperar\u00E1 para que la unidad final responda antes de generar un error.
modcluster.proxy.ping=Cantidad de segundos a esperar por una respuesta pong de un ping.
modcluster.proxy.proxies=Lista de proxies inversos para que mod_cluster se registre definida por el 'enlace de sockets salientes' en el 'grupo de enlaces de sockets'.
modcluster.proxy.proxy-list=Lista de proxies inversos para el registro. Formato (hostname:port) separado por comas.
modcluster.proxy.proxy-list.deprecated=El atributo 'proxy-list' a quedado obsoleto en favor de proxy (lista de referencias de enlaces de sockets salientes)
modcluster.proxy.proxy-url=URL base para peticiones MCMP.
modcluster.proxy.simple-load-provider=El proveedor de carga simple devuelve un factor de equilibrio de carga preconfigurado constante.
modcluster.proxy.simple-load-provider.deprecated=Obsoleto. Alias para el equilibrador de carga de recurso secundario=simple.
modcluster.proxy.session-draining-strategy=La estrategia de drenaje de sesi\u00F3n utilizada durante el borrado de la implementaci\u00F3n de una aplicaci\u00F3n web.
modcluster.proxy.smax=Conteo de conexi\u00F3n inactiva m\u00E1xima para el proxy inverso.
modcluster.proxy.socket-timeout=Tiempo de espera para que el proxy inverso responda un mensaje MCMP.
modcluster.proxy.ssl-context=Hace referencia al contexto SSL que ser\u00E1 utilizado por mod_cluster.
modcluster.proxy.status-interval=Cantidad de segundos en la que se env\u00EDa un mensaje STATUS del servidor de la aplicaci\u00F3n al proxy.
modcluster.proxy.sticky-session=Indica si las solicitudes posteriores de una determinada sesi\u00F3n se enviar\u00E1n al mismo nodo, si es posible.
modcluster.proxy.sticky-session-force=Indica si el proxy inverso debe ejecutar un error en el caso de que el equilibrador no pueda enviar una solicitud al nodo en el cual est\u00E1 atascado. Se ignora si se deshabilitan las sesiones pegajosas.
modcluster.proxy.sticky-session-remove=Indica si el proxy inverso debe eliminar la adherencia de la sesi\u00F3n en el caso de que el equilibrador no pueda enviar una solicitud al nodo en el cual est\u00E1 atascado. Se ignora si se deshabilitan las sesiones atascadas.
modcluster.proxy.stop-context-timeout=Tiempo m\u00E1ximo de espera para que el contexto procese las solicitudes pendientes.
modcluster.proxy.ttl=Tiempo de vida (en segundos) para las conexiones inactivas superiores a smax.
modcluster.proxy.worker-timeout=Cantidad de segundos que se debe esperar para que un trabajador quede a disposici\u00F3n para gestionar una solicitud.

# Load Providers
modcluster.dynamic-load-provider=Alias heredado para el proveedor de carga din\u00E1mica.
modcluster.load-provider=El proveedor de carga ofrece c\u00E1lculos de carga.
modcluster.load-provider.simple=El proveedor de carga simple devuelve un factor de equilibrio de carga preconfigurado constante.
modcluster.load-provider.simple.add=A\u00F1ada un proveedor de carga simple que devuelva un factor de equilibrio de carga preconfigurado constante.
modcluster.load-provider.simple.remove=Elimine un proveedor de carga simple.
modcluster.load-provider.simple.factor=El proveedor de carga din\u00E1mica calcula el factor de equilibrio de carga de un nodo a partir de un conjunto definido de m\u00E9tricas de carga.
modcluster.load-provider.dynamic.add=A\u00F1ada un proveedor de carga din\u00E1mica sin m\u00E9tricas de carga.
modcluster.load-provider.dynamic.remove=Elimine un proveedor de carga din\u00E1mica predeterminado como proveedor de carga simple.
modcluster.load-provider.dynamic.decay=El factor por el cual los valores de carga hist\u00F3ricos deben disminuir en importancia.
modcluster.load-provider.dynamic.history=El n\u00FAmero de valores de carga hist\u00F3ricos (anteriores) a considerar en el c\u00E1lculo del factor de equilibrio de carga.
modcluster.load-provider.dynamic.initial-load=Carga inicial dentro del rango [0..100] con la que se pueden rellenar previamente los valores hist\u00F3ricos. Se usa para conducir gradualmente la carga al nodo. El valor de 0 rellena previamente con carga completa y el valor de -1 deshabilita este comportamiento.

# Load Metrics
modcluster.load-metric=M\u00E9trica de carga incorporada que aporta un valor al factor de carga global de un nodo. Los factores de carga de cada m\u00E9trica se agregan en funci\u00F3n de sus pesos.
modcluster.load-metric.add=A\u00F1ada una m\u00E9trica de carga al conjunto de m\u00E9tricas de carga desde el cual calcular el factor de carga.
modcluster.load-metric.remove=Elimine una m\u00E9trica de carga del conjunto de m\u00E9tricas de carga desde el cual calcular el factor de carga.
modcluster.load-metric.type=Tipo de m\u00E9trica de carga incorporada a partir de los valores enumerados.
modcluster.load-metric.class=Nombre de la clase a partir de la cual construir una m\u00E9trica de carga.
modcluster.load-metric.module=Nombre del m\u00F3dulo desde el cual cargar la clase de m\u00E9trica de carga.
modcluster.load-metric.weight=N\u00FAmero que indica la importancia de una m\u00E9trica con respecto a las dem\u00E1s m\u00E9tricas. Por ejemplo, una m\u00E9trica de peso 2 tendr\u00E1 el doble de impacto en el factor de carga global que una m\u00E9trica de peso 1.
modcluster.load-metric.capacity=Capacidad m\u00E1xima de la m\u00E9trica utilizada para normalizar los valores de carga de una m\u00E9trica que requiere capacidad expl\u00EDcita.
modcluster.load-metric.property=Propiedades a aplicar en una instancia de m\u00E9trica cargada.
modcluster.custom-load-metric=La m\u00E9trica de carga personalizada cargada desde una clase de Java espec\u00EDfica, la cual aporta un valor al factor de carga global de un nodo. Los factores de carga de cada m\u00E9trica se agregan en funci\u00F3n de sus pesos.

# Runtime-only Operations
modcluster.add-proxy=Agregar un proxy inverso a la lista de proxies para el registro.
modcluster.add-proxy.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.add-proxy.host=Host del proxy inverso.
modcluster.add-proxy.port=Puerto del proxy inverso que acepta los comandos MCMP.
modcluster.disable=Indicarles a los proxies inversos que ninguno de los contextos del nodo puede procesar nuevas solicitudes.
modcluster.disable.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.disable-context=Indicarles a los proxies inversos que el contexto no puede procesar nuevas solicitudes.
modcluster.disable-context.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.disable-context.context=Nombre del contexto que se debe deshabilitar.
modcluster.disable-context.virtualhost=Nombre del host virtual en el cual desea deshabilitar el contexto.
modcluster.enable=Indicarles a los proxies inversos que todos los contextos del nodo est\u00E1n listos para recibir solicitudes.
modcluster.enable.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.enable-context=Indicarles a los proxies inversos que el contexto est\u00E1 listo para recibir solicitudes.
modcluster.enable-context.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.enable-context.context=Nombre del contexto que se debe habilitar.
modcluster.enable-context.virtualhost=Nombre del host virtual para el cual desea habilitar el contexto.
modcluster.list-proxies=Enumerar los proxies inversos en los que est\u00E1 registrado este nodo actualmente.
modcluster.list-proxies.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.read-proxies-configuration=Enviar un comando DUMP a los proxies inversos y mostrar el resultado.
modcluster.read-proxies-configuration.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.read-proxies-info=Enviar un comando INFO a los proxies inversos y mostrar el resultado.
modcluster.read-proxies-info.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.refresh=Actualizar el nodo enviando un nuevo mensaje CONFIG a los proxies inversos.
modcluster.refresh.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.remove-proxy=Eliminar el proxy inverso de la lista de proxies para el registro.
modcluster.remove-proxy.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.remove-proxy.host=Host del proxy inverso.
modcluster.remove-proxy.port=Puerto del proxy inverso.
modcluster.reset=Reiniciar la conexi\u00F3n del nodo con los proxies inversos.
modcluster.reset.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.stop=Indicarles a los proxies inversos que ninguno de los contextos del nodo puede procesar solicitudes.
modcluster.stop.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.stop.waittime=Cantidad de segundos que se debe esperar para que las sesiones se drenen antes de detener todos los contextos si el drenaje de la sesi\u00F3n est\u00E1 en vigor. Si coloca un valor negativo o un cero para el tiempo de espera, se esperar\u00E1 indefinidamente.
modcluster.stop-context=Indicarles a los proxies inversos que el contexto no puede procesar solicitudes.
modcluster.stop-context.deprecated=Obsoleto. Use la misma operaci\u00F3n en la direcci\u00F3n de un proxy espec\u00EDfico.
modcluster.stop-context.context=Nombre del contexto que se debe detener.
modcluster.stop-context.virtualhost=Nombre del host virtual en el cual desea detener el contexto.
modcluster.stop-context.waittime=Cantidad de segundos que se debe esperar para que las sesiones se drenen antes de detener el contexto si el drenaje de la sesi\u00F3n est\u00E1 en vigor. Si coloca un valor negativo o un cero para el tiempo de espera, se esperar\u00E1 indefinidamente.

# Deprecated/Legacy Metric Operations
modcluster.add-metric=A\u00F1ada una nueva m\u00E9trica al proveedor del factor de equilibrio de carga din\u00E1mica.
modcluster.add-metric.deprecated=Obsoleto. Use la operaci\u00F3n de gesti\u00F3n 'agregar' regular.
modcluster.add-metric.type=Tipo de m\u00E9trica.
modcluster.add-metric.weight=Peso de la m\u00E9trica.
modcluster.add-metric.capacity=Capacidad de la m\u00E9trica.
modcluster.add-metric.property=Propiedades para la m\u00E9trica.
modcluster.remove-metric=Elimine una m\u00E9trica del proveedor del factor de equilibrio de carga din\u00E1mica.
modcluster.remove-metric.deprecated=Obsoleto. Use la operaci\u00F3n de gesti\u00F3n 'eliminar' regular.
modcluster.remove-metric.type=Tipo de m\u00E9trica.
modcluster.add-custom-metric=A\u00F1ada una nueva m\u00E9trica personalizada al proveedor del factor de equilibrio de carga din\u00E1mica.
modcluster.add-custom-metric.deprecated=Obsoleto. Use la operaci\u00F3n de gesti\u00F3n 'agregar' regular.
modcluster.add-custom-metric.class=Clase de m\u00E9trica personalizada.
modcluster.add-custom-metric.weight=Peso de la m\u00E9trica.
modcluster.add-custom-metric.capacity=Capacidad de la m\u00E9trica.
modcluster.add-custom-metric.property=Propiedades para la m\u00E9trica.
modcluster.remove-custom-metric=Elimine una m\u00E9trica personalizada del proveedor del factor de equilibrio de carga din\u00E1mica.
modcluster.remove-custom-metric.deprecated=Obsoleto. Use la operaci\u00F3n de gesti\u00F3n 'eliminar' regular.
modcluster.remove-custom-metric.class=Clase de m\u00E9trica personalizada.

# Deprecated/Legacy SSL resource
modcluster.ssl=La configuraci\u00F3n SSL a la l\u00F3gica MCMP de cliente.
modcluster.ssl.configuration.deprecated=Obsoleto. Use el atributo ssl-context para hacer referencia al SSLContext administrado por Elytron.
modcluster.ssl.configuration.add=Agregar configuraci\u00F3n predeterminada SSL a la l\u00F3gica del cliente MCMP.
modcluster.ssl.configuration.remove=Remover configuraci\u00F3n SSL de la l\u00F3gica del cliente MCMP.
modcluster.ssl.configuration.ca-certificate-file=Autoridad certificadora.
modcluster.ssl.configuration.ca-revocation-url=Lista de revocaci\u00F3n de autoridad certificadora.
modcluster.ssl.configuration.certificate-key-file=Archivo de llave para el certificado.
modcluster.ssl.configuration.cipher-suite=Lista separada por comas de cifras de encriptaci\u00F3n que la configuraci\u00F3n puede utilizar.
modcluster.ssl.configuration.key-alias=El alias de la llave que contiene los certificados de cliente en el almac\u00E9n de llaves.
modcluster.ssl.configuration.password=Contrase\u00F1a de acceso al almac\u00E9n de llaves y el almac\u00E9n de confianza.
modcluster.ssl.configuration.protocol=Los protocolos SSL que est\u00E1n disponibles.

