# Subsystem
modcluster=mod_cluster \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A\u304A\u3088\u3073\u30E9\u30F3\u30BF\u30A4\u30E0\u64CD\u4F5C
modcluster.add=\u30B5\u30FC\u30D0\u30FC\u304C 'reload-required' \u306E\u72B6\u614B\u3067 mod_cluster \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
modcluster.remove=\u30B5\u30FC\u30D0\u30FC\u304C 'reload-required' \u306E\u72B6\u614B\u3067 mod_cluster \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u524A\u9664\u3057\u307E\u3059\u3002

# Proxy Configuration
modcluster.mod-cluster-config=\u30EC\u30AC\u30B7\u30FC\u8A2D\u5B9A\u30EA\u30BD\u30FC\u30B9
modcluster.proxy=\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B5\u30FC\u306E\u691C\u51FA\u3001\u305D\u306E\u8A2D\u5B9A\u3001\u304A\u3088\u3073\u8CA0\u8377\u5206\u6563\u4FC2\u6570\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u6307\u5B9A\u3059\u308B\u5358\u4E00\u306E Undertow \u30EA\u30B9\u30CA\u30FC (\u304A\u3088\u3073\u30B5\u30FC\u30D0\u30FC) \u3068\u7D50\u5408\u3055\u308C\u305F\u30D7\u30ED\u30AD\u30B7\u30FC\u30EA\u30BD\u30FC\u30B9\u3002\u8907\u6570\u306E\u30D7\u30ED\u30AD\u30B7\u30FC\u8A2D\u5B9A\u3092\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002
modcluster.proxy.add=\u30B5\u30FC\u30D0\u30FC\u304C 'reload-required' \u306E\u72B6\u614B\u3067\u3001Undertow \u30EA\u30B9\u30CA\u30FC\u3092\u5FC5\u8981\u3068\u3059\u308B\u30D7\u30ED\u30AD\u30B7\u30FC\u30EA\u30BD\u30FC\u30B9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
modcluster.proxy.remove=\u30B5\u30FC\u30D0\u30FC\u304C 'reload-required' \u306E\u72B6\u614B\u3067\u30D7\u30ED\u30AD\u30B7\u30FC\u30EA\u30BD\u30FC\u30B9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
modcluster.proxy.advertise=\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30D9\u30FC\u30B9\u306E\u30A2\u30C9\u30D0\u30BF\u30A4\u30BA\u30E1\u30AB\u30CB\u30BA\u30E0\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B\u3002
modcluster.proxy.advertise-security-key=\u6307\u5B9A\u3055\u308C\u305F\u5834\u5408\u3001\u3053\u306E\u5024\u3092 salt \u3068\u3057\u3066\u4F7F\u7528\u3057\u3066\u3001\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u30A2\u30C9\u30D0\u30BF\u30A4\u30BA\u30E1\u30F3\u30C8\u306E\u30C1\u30A7\u30C3\u30AF\u30B5\u30E0\u304C\u691C\u8A3C\u3055\u308C\u307E\u3059\u3002
modcluster.proxy.advertise-socket=Advertise \u30BD\u30B1\u30C3\u30C8\u306B\u4F7F\u7528\u3059\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306E\u540D\u524D\u3002
modcluster.proxy.auto-enable-contexts=false \u306E\u5834\u5408\u3001\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306F\u7121\u52B9\u3068\u3057\u3066\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3068\u767B\u9332\u3055\u308C\u307E\u3059\u3002\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306F enable-context \u64CD\u4F5C\u307E\u305F\u306F mod_cluster_manager \u30B3\u30F3\u30BD\u30FC\u30EB (\u4F7F\u7528\u3067\u304D\u308B\u5834\u5408) \u3067\u624B\u4F5C\u696D\u3067\u6709\u52B9\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
modcluster.proxy.balancer=\u767B\u9332\u3059\u308B\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30D0\u30E9\u30F3\u30B5\u30FC\u306E\u540D\u524D\u3002
modcluster.proxy.connector=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3068\u767B\u9332\u3055\u308C\u308B Undertow \u30EA\u30B9\u30CA\u30FC\u306E\u540D\u524D\u3002
modcluster.proxy.connector.deprecated=\u975E\u63A8\u5968\u3002'listener' \u5C5E\u6027\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u3057\u3066\u6A5F\u80FD\u3057\u307E\u3059\u3002
modcluster.proxy.excluded-contexts=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3068\u306E\u767B\u9332\u304B\u3089\u9664\u5916\u3055\u308C\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u30EA\u30B9\u30C8\u3002
modcluster.proxy.flush-packets=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3067\u30D1\u30B1\u30C3\u30C8\u30D5\u30E9\u30C3\u30B7\u30F3\u30B0\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B\u3002
modcluster.proxy.flush-wait=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3067\u30D1\u30B1\u30C3\u30C8\u3092\u30D5\u30E9\u30C3\u30B7\u30E5\u3059\u308B\u524D\u306B\u5F85\u6A5F\u3059\u308B\u671F\u9593\u3002
modcluster.proxy.listener=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3068\u767B\u9332\u3055\u308C\u308B Undertow \u30EA\u30B9\u30CA\u30FC\u306E\u540D\u524D\u3002
modcluster.proxy.load-balancing-group=\u3053\u306E\u30CE\u30FC\u30C9\u304C\u5C5E\u3059\u308B\u30ED\u30FC\u30C9\u30D0\u30E9\u30F3\u30B7\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u540D\u524D\u3002
modcluster.proxy.max-attempts=\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30B5\u30FC\u30D0\u30FC\u306B\u9001\u4FE1\u3059\u308B\u5834\u5408\u306E\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306B\u3088\u308B\u30D5\u30A7\u30A4\u30EB\u30AA\u30FC\u30D0\u30FC\u306E\u6700\u5927\u8A66\u884C\u6570\u3002
modcluster.proxy.node-timeout=\u30CE\u30FC\u30C9\u3078\u306E\u30D7\u30ED\u30AD\u30B7\u30FC\u63A5\u7D9A\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u79D2\u5358\u4F4D)\u3002\u3053\u308C\u306F\u3001\u30A8\u30E9\u30FC\u3092\u8FD4\u3059\u524D\u306B mod_cluster \u304C\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u5FDC\u7B54\u3092\u5F85\u3064\u6642\u9593\u306B\u306A\u308A\u307E\u3059\u3002
modcluster.proxy.ping=ping \u306B\u5BFE\u3059\u308B pong \u8FD4\u7B54\u3092\u5F85\u3064\u6642\u9593 (\u79D2\u5358\u4F4D)\u3002
modcluster.proxy.proxies='socket-binding-group' \u306E 'outbound-socket-binding' \u306B\u3088\u3063\u3066\u5B9A\u7FA9\u3055\u308C\u308B\u3001\u767B\u9332\u3059\u308B mod_cluster \u306E\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30EA\u30B9\u30C8\u3002
modcluster.proxy.proxy-list=\u767B\u9332\u3059\u308B\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30EA\u30B9\u30C8\u3002\u5F62\u5F0F (hostname:port) \u306F\u30AB\u30F3\u30DE\u533A\u5207\u308A\u3002
modcluster.proxy.proxy-list.deprecated=\u30D7\u30ED\u30AD\u30B7\u30FC (outbound-socket-binding \u3078\u306E\u53C2\u7167\u306E\u30EA\u30B9\u30C8) \u304C\u5C0E\u5165\u3055\u308C\u305F\u305F\u3081 'proxy-list' \u5C5E\u6027\u306F\u975E\u63A8\u5968\u306B\u306A\u308A\u307E\u3057\u305F\u3002
modcluster.proxy.proxy-url=MCMP \u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u5BFE\u3059\u308B\u30D9\u30FC\u30B9 URL
modcluster.proxy.simple-load-provider=\u7C21\u5358\u306A\u30ED\u30FC\u30C9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306F\u5B9A\u6570\u306E\u4E8B\u524D\u8A2D\u5B9A\u3055\u308C\u305F\u8CA0\u8377\u5206\u6563\u4FC2\u6570\u3092\u8FD4\u3057\u307E\u3059\u3002
modcluster.proxy.simple-load-provider.deprecated=\u975E\u63A8\u5968\u3002\u5B50\u30EA\u30BD\u30FC\u30B9\u306E\u30A8\u30A4\u30EA\u30A2\u30B9 load-balancer=simple
modcluster.proxy.session-draining-strategy=Web \u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u4E2D\u306B\u4F7F\u7528\u3055\u308C\u308B\u30BB\u30C3\u30B7\u30E7\u30F3\u30C9\u30EC\u30A4\u30F3\u30B9\u30C8\u30E9\u30C6\u30B8\u30FC\u3002
modcluster.proxy.smax=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306E soft maximum \u30A2\u30A4\u30C9\u30EB\u63A5\u7D9A\u6570\u3002
modcluster.proxy.socket-timeout=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u304C MCMP \u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u5FDC\u7B54\u3059\u308B\u307E\u3067\u5F85\u6A5F \u3059\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u671F\u9593\u3002
modcluster.proxy.ssl-context=mod_cluster \u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B SSLContext \u3078\u306E\u53C2\u7167\u3002
modcluster.proxy.status-interval=STATUS \u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30D7\u30ED\u30AD\u30B7\u30FC\u3078\u9001\u4FE1\u3055\u308C\u308B\u79D2\u6570\u3002
modcluster.proxy.sticky-session=\u53EF\u80FD\u306A\u5834\u5408\u306B\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u5F8C\u7D9A\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u540C\u3058\u30CE\u30FC\u30C9\u306B\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3059\u308B\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u793A\u3057\u307E\u3059\u3002
modcluster.proxy.sticky-session-force=\u30D0\u30E9\u30F3\u30B5\u30FC\u304C\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u30B9\u30BF\u30C3\u30AF\u3057\u305F\u30CE\u30FC\u30C9\u3078\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3067\u304D\u306A\u3044\u5834\u5408\u306B\u3001\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u304C\u30A8\u30E9\u30FC\u3092\u5B9F\u884C\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u793A\u3057\u307E\u3059\u3002\u30B9\u30C6\u30A3\u30C3\u30AD\u30FC\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u7121\u52B9\u306A\u5834\u5408\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
modcluster.proxy.sticky-session-remove=\u30D0\u30E9\u30F3\u30B5\u30FC\u304C\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u30B9\u30BF\u30C3\u30AF\u3057\u305F\u30CE\u30FC\u30C9\u3078\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3067\u304D\u306A\u3044\u5834\u5408\u306B\u3001\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u304C\u30BB\u30C3\u30B7\u30E7\u30F3\u306E stickiness \u3092\u524A\u9664\u3059\u308B\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u793A\u3057\u307E\u3059\u3002\u30B9\u30C6\u30A3\u30C3\u30AD\u30FC\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u7121\u52B9\u306A\u5834\u5408\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
modcluster.proxy.stop-context-timeout=\u4FDD\u7559\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u51E6\u7406\u306B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u5F85\u6A5F\u3059\u308B\u6700\u5927\u671F\u9593\u3002
modcluster.proxy.ttl=smax \u3092\u8D85\u3048\u308B\u30A2\u30A4\u30C9\u30EB\u63A5\u7D9A\u306E\u751F\u5B58\u6642\u9593 (\u79D2\u5358\u4F4D)\u3002
modcluster.proxy.worker-timeout=\u30EF\u30FC\u30AB\u30FC\u304C\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308B\u307E\u3067\u5F85\u6A5F\u3059\u308B\u79D2\u6570\u3002

# Load Providers
modcluster.dynamic-load-provider=\u52D5\u7684\u30ED\u30FC\u30C9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30EC\u30AC\u30B7\u30FC\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
modcluster.load-provider=\u30ED\u30FC\u30C9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306F\u30ED\u30FC\u30C9\u306E\u8A08\u7B97\u3092\u63D0\u4F9B\u3057\u307E\u3059\u3002
modcluster.load-provider.simple=\u7C21\u5358\u306A\u30ED\u30FC\u30C9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306F\u5B9A\u6570\u306E\u4E8B\u524D\u8A2D\u5B9A\u3055\u308C\u305F\u8CA0\u8377\u5206\u6563\u4FC2\u6570\u3092\u8FD4\u3057\u307E\u3059\u3002
modcluster.load-provider.simple.add=\u5B9A\u6570\u306E\u4E8B\u524D\u8A2D\u5B9A\u3055\u308C\u305F\u8CA0\u8377\u5206\u6563\u4FC2\u6570\u3092\u8FD4\u3059\u7C21\u5358\u306A\u30ED\u30FC\u30C9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
modcluster.load-provider.simple.remove=\u7C21\u5358\u306A\u30ED\u30FC\u30C9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
modcluster.load-provider.simple.factor=\u52D5\u7684\u30ED\u30FC\u30C9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306F\u3001\u5B9A\u7FA9\u3055\u308C\u305F\u30ED\u30FC\u30C9\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u30BB\u30C3\u30C8\u304B\u3089\u30CE\u30FC\u30C9\u306E\u8CA0\u8377\u5206\u6563\u4FC2\u6570\u3092\u7B97\u51FA\u3057\u307E\u3059\u3002
modcluster.load-provider.dynamic.add=\u30ED\u30FC\u30C9\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u306A\u3044\u52D5\u7684\u30ED\u30FC\u30C9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
modcluster.load-provider.dynamic.remove=\u52D5\u7684\u30ED\u30FC\u30C9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u524A\u9664\u3057\u3001\u7C21\u5358\u306A\u30ED\u30FC\u30C9\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u30C7\u30D5\u30A9\u30EB\u30C8\u3068\u3057\u307E\u3059\u3002
modcluster.load-provider.dynamic.decay=\u904E\u53BB\u306E\u8CA0\u8377\u5024\u306E\u91CD\u8981\u5EA6\u304C\u4F4E\u4E0B\u3055\u308C\u308B\u4FC2\u6570\u3002
modcluster.load-provider.dynamic.history=\u8CA0\u8377\u5206\u6563\u4FC2\u6570\u306E\u8A08\u7B97\u3067\u8003\u616E\u3059\u308B\u904E\u53BB (\u4EE5\u524D) \u306E\u8CA0\u8377\u5024\u306E\u6570\u3002
modcluster.load-provider.dynamic.initial-load=\u5C65\u6B74\u5024\u3092\u4E8B\u524D\u5165\u529B\u3059\u308B\u7BC4\u56F2 [0..100] \u5185\u306E\u521D\u671F\u8CA0\u8377\u3002\u5F90\u3005\u306B\u8CA0\u8377\u3092\u30CE\u30FC\u30C9\u306B\u304B\u3051\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u30020 \u3092\u5024\u3068\u3059\u308B\u3068\u3001\u5B8C\u5168\u8CA0\u8377\u3067\u4E8B\u524D\u5165\u529B\u3057\u3001-1 \u3092\u5024\u3068\u3059\u308B\u3068\u3053\u306E\u52D5\u4F5C\u3092\u7121\u52B9\u306B\u3057\u307E\u3059\u3002

# Load Metrics
modcluster.load-metric=\u30CE\u30FC\u30C9\u306E\u8CA0\u8377\u4FC2\u6570\u5168\u4F53\u306B\u5024\u3092\u63D0\u4F9B\u3059\u308B\u30D3\u30EB\u30C8\u30A4\u30F3\u30ED\u30FC\u30C9\u30E1\u30C8\u30EA\u30C3\u30AF\u3002\u5404\u30E1\u30C8\u30EA\u30C3\u30AF\u304B\u3089\u306E\u8CA0\u8377\u4FC2\u6570\u306F\u91CD\u3055\u3092\u57FA\u306B\u96C6\u7D04\u3055\u308C\u307E\u3059\u3002
modcluster.load-metric.add=\u8CA0\u8377\u4FC2\u6570\u3092\u7B97\u51FA\u3059\u308B\u30ED\u30FC\u30C9\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u30BB\u30C3\u30C8\u306B\u30ED\u30FC\u30C9\u30E1\u30C8\u30EA\u30C3\u30AF\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
modcluster.load-metric.remove=\u8CA0\u8377\u4FC2\u6570\u3092\u7B97\u51FA\u3059\u308B\u30ED\u30FC\u30C9\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u30BB\u30C3\u30C8\u304B\u3089\u30ED\u30FC\u30C9\u30E1\u30C8\u30EA\u30C3\u30AF\u3092\u524A\u9664\u3057\u307E\u3059\u3002
modcluster.load-metric.type=\u5217\u6319\u5024\u304B\u3089\u306E\u30D3\u30EB\u30C9\u30A4\u30F3\u30ED\u30FC\u30C9\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u578B\u3002
modcluster.load-metric.class=\u30ED\u30FC\u30C9\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u69CB\u7BC9\u306B\u4F7F\u7528\u3059\u308B\u30AF\u30E9\u30B9\u540D\u3002
modcluster.load-metric.module=\u30ED\u30FC\u30C9\u30E1\u30C8\u30EA\u30C3\u30AF\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u5143\u3068\u306A\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u540D\u3002
modcluster.load-metric.weight=\u4ED6\u306E\u30E1\u30C8\u30EA\u30C3\u30AF\u3068\u6BD4\u8F03\u3057\u305F\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u91CD\u8981\u6027\u3092\u793A\u3059\u756A\u53F7\u3002\u305F\u3068\u3048\u3070\u3001\u91CD\u3055\u304C 2 \u306E\u30E1\u30C8\u30EA\u30C3\u30AF\u306F\u3001\u8CA0\u8377\u4FC2\u6570\u5168\u4F53\u3078\u306E\u5F71\u97FF\u304C\u91CD\u3055\u304C 1 \u306E\u30E1\u30C8\u30EA\u30C3\u30AF\u306E 2 \u500D\u306B\u306A\u308A\u307E\u3059\u3002
modcluster.load-metric.capacity=\u660E\u793A\u7684\u306A\u5BB9\u91CF\u3092\u5FC5\u8981\u3068\u3059\u308B\u30E1\u30C8\u30EA\u30C3\u30AF\u304B\u3089\u306E\u8CA0\u8377\u5024\u3092\u6B63\u898F\u5316\u3059\u308B\u306E\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u6700\u5927\u5BB9\u91CF\u3002
modcluster.load-metric.property=\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30E1\u30C8\u30EA\u30C3\u30AF\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u9069\u7528\u3055\u308C\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
modcluster.custom-load-metric=\u30CE\u30FC\u30C9\u306E\u8CA0\u8377\u4FC2\u6570\u5168\u4F53\u306B\u5024\u3092\u63D0\u4F9B\u3059\u308B\u6307\u5B9A\u306E Java \u30AF\u30E9\u30B9\u304B\u3089\u30ED\u30FC\u30C9\u3055\u308C\u308B\u30AB\u30B9\u30BF\u30E0\u30ED\u30FC\u30C9\u30E1\u30C8\u30EA\u30C3\u30AF\u3002\u5404\u30E1\u30C8\u30EA\u30C3\u30AF\u304B\u3089\u306E\u8CA0\u8377\u4FC2\u6570\u306F\u91CD\u3055\u3092\u57FA\u306B\u96C6\u7D04\u3055\u308C\u307E\u3059\u3002

# Runtime-only Operations
modcluster.add-proxy=\u767B\u9332\u3059\u308B\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30EA\u30B9\u30C8\u306B\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
modcluster.add-proxy.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.add-proxy.host=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30DB\u30B9\u30C8\u3002
modcluster.add-proxy.port=MCMP \u30B3\u30DE\u30F3\u30C9\u3092\u8A31\u53EF\u3059\u308B\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30DD\u30FC\u30C8\u3002
modcluster.disable=\u30CE\u30FC\u30C9\u306E\u3059\u3079\u3066\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u65B0\u3057\u3044\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3067\u304D\u306A\u3044\u3053\u3068\u3092\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306B\u4F1D\u3048\u307E\u3059\u3002
modcluster.disable.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.disable-context=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u65B0\u3057\u3044\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3067\u304D\u306A\u3044\u3053\u3068\u3092\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306B\u4F1D\u3048\u307E\u3059\u3002
modcluster.disable-context.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.disable-context.context=\u7121\u52B9\u306B\u3059\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u540D\u524D\u3002
modcluster.disable-context.virtualhost=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u7121\u52B9\u306B\u3059\u308B\u4EEE\u60F3\u30DB\u30B9\u30C8\u306E\u540D\u524D\u3002
modcluster.enable=\u30CE\u30FC\u30C9\u306E\u3059\u3079\u3066\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u30A8\u30A4\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u4FE1\u3059\u308B\u6E96\u5099\u304C\u3067\u304D\u305F\u3053\u3068\u3092\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306B\u4F1D\u3048\u307E\u3059\u3002
modcluster.enable.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.enable-context=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u4FE1\u3059\u308B\u6E96\u5099\u304C\u3067\u304D\u305F\u3053\u3068\u3092\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306B\u4F1D\u3048\u307E\u3059\u3002
modcluster.enable-context.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.enable-context.context=\u6709\u52B9\u306B\u3059\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u540D\u524D\u3002
modcluster.enable-context.virtualhost=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u6709\u52B9\u306B\u3059\u308B\u4EEE\u60F3\u30DB\u30B9\u30C8\u306E\u540D\u524D\u3002
modcluster.list-proxies=\u3053\u306E\u30CE\u30FC\u30C9\u304C\u73FE\u5728\u767B\u9332\u3055\u308C\u3066\u3044\u308B\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3092\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
modcluster.list-proxies.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.read-proxies-configuration=DUMP \u30B3\u30DE\u30F3\u30C9\u3092\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3078\u9001\u4FE1\u3057\u3001\u7D50\u679C\u3092\u8868\u793A\u3057\u307E\u3059\u3002
modcluster.read-proxies-configuration.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.read-proxies-info=INFO \u30B3\u30DE\u30F3\u30C9\u3092\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3078\u9001\u4FE1\u3057\u3001\u7D50\u679C\u3092\u8868\u793A\u3057\u307E\u3059\u3002
modcluster.read-proxies-info.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.refresh=\u65B0\u3057\u3044 CONFIG \u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306B\u9001\u4FE1\u3059\u308B\u30CE\u30FC\u30C9\u3092\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u3057\u307E\u3059\u3002
modcluster.refresh.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.remove-proxy=\u767B\u9332\u3059\u308B\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30EA\u30B9\u30C8\u304B\u3089\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
modcluster.remove-proxy.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.remove-proxy.host=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30DB\u30B9\u30C8\u3002
modcluster.remove-proxy.port=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30DD\u30FC\u30C8\u3002
modcluster.reset=\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u3078\u306E\u30CE\u30FC\u30C9\u306E\u63A5\u7D9A\u3092\u30EA\u30BB\u30C3\u30C8\u3057\u307E\u3059\u3002
modcluster.reset.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.stop=\u30CE\u30FC\u30C9\u306E\u3059\u3079\u3066\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3067\u304D\u306A\u3044\u3053\u3068\u3092\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306B\u4F1D\u3048\u307E\u3059\u3002
modcluster.stop.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.stop.waittime=\u30BB\u30C3\u30B7\u30E7\u30F3\u30C9\u30EC\u30A4\u30F3\u304C\u5B9F\u884C\u3055\u308C\u308B\u5834\u5408\u3001\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u30C9\u30EC\u30A4\u30F3\u3092\u5F85\u6A5F\u3059\u308B\u671F\u9593 (\u79D2\u6570)\u3002\u3053\u306E\u671F\u9593\u3092\u8D85\u3048\u308B\u3068\u3059\u3079\u3066\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u505C\u6B62\u3055\u308C\u307E\u3059\u3002\u30BC\u30ED\u307E\u305F\u306F\u8CA0\u306E\u5024\u3092\u6307\u5B9A\u3059\u308B\u3068\u6C38\u4E45\u306B\u5F85\u6A5F\u3057\u307E\u3059\u3002
modcluster.stop-context=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3067\u304D\u306A\u3044\u3053\u3068\u3092\u30EA\u30D0\u30FC\u30B9\u30D7\u30ED\u30AD\u30B7\u30FC\u306B\u4F1D\u3048\u307E\u3059\u3002
modcluster.stop-context.deprecated=\u975E\u63A8\u5968\u3002\u7279\u5B9A\u30D7\u30ED\u30AD\u30B7\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u540C\u3058\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.stop-context.context=\u505C\u6B62\u3059\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u540D\u524D\u3002
modcluster.stop-context.virtualhost=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u505C\u6B62\u3059\u308B\u4EEE\u60F3\u30DB\u30B9\u30C8\u306E\u540D\u524D\u3002
modcluster.stop-context.waittime=\u30BB\u30C3\u30B7\u30E7\u30F3\u30C9\u30EC\u30A4\u30F3\u304C\u5B9F\u884C\u3055\u308C\u308B\u5834\u5408\u3001\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u30C9\u30EC\u30A4\u30F3\u3092\u5F85\u6A5F\u3059\u308B\u671F\u9593 (\u79D2\u6570)\u3002\u3053\u306E\u671F\u9593\u3092\u8D85\u3048\u308B\u3068\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u505C\u6B62\u3055\u308C\u307E\u3059\u3002\u30BC\u30ED\u307E\u305F\u306F\u8CA0\u306E\u5024\u3092\u6307\u5B9A\u3059\u308B\u3068\u6C38\u4E45\u306B\u5F85\u6A5F\u3057\u307E\u3059\u3002

# Deprecated/Legacy Metric Operations
modcluster.add-metric=\u52D5\u7684\u8CA0\u8377\u5206\u6563\u4FC2\u6570\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u65B0\u3057\u3044\u30E1\u30C8\u30EA\u30C3\u30AF\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
modcluster.add-metric.deprecated=\u975E\u63A8\u5968\u3002\u6B63\u898F\u306E 'add' \u7BA1\u7406\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.add-metric.type=\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u30BF\u30A4\u30D7\u3002
modcluster.add-metric.weight=\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u91CD\u91CF
modcluster.add-metric.capacity=\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u5BB9\u91CF
modcluster.add-metric.property=\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u30D7\u30ED\u30D1\u30C6\u30A3
modcluster.remove-metric=\u52D5\u7684\u8CA0\u8377\u5206\u6563\u4FC2\u6570\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304B\u3089\u30E1\u30C8\u30EA\u30C3\u30AF\u3092\u524A\u9664\u3057\u307E\u3059\u3002
modcluster.remove-metric.deprecated=\u975E\u63A8\u5968\u3002\u6B63\u898F\u306E 'remove' \u7BA1\u7406\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.remove-metric.type=\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u30BF\u30A4\u30D7\u3002
modcluster.add-custom-metric=\u52D5\u7684\u8CA0\u8377\u5206\u6563\u4FC2\u6570\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u30AB\u30B9\u30BF\u30E0\u30E1\u30C8\u30EA\u30C3\u30AF\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
modcluster.add-custom-metric.deprecated=\u975E\u63A8\u5968\u3002\u6B63\u898F\u306E 'add' \u7BA1\u7406\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.add-custom-metric.class=\u30AB\u30B9\u30BF\u30E0\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u30AF\u30E9\u30B9\u3002
modcluster.add-custom-metric.weight=\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u91CD\u91CF
modcluster.add-custom-metric.capacity=\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u5BB9\u91CF
modcluster.add-custom-metric.property=\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u30D7\u30ED\u30D1\u30C6\u30A3
modcluster.remove-custom-metric=\u52D5\u7684\u8CA0\u8377\u5206\u6563\u4FC2\u6570\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304B\u3089\u30AB\u30B9\u30BF\u30E0\u30E1\u30C8\u30EA\u30C3\u30AF\u3092\u524A\u9664\u3057\u307E\u3059\u3002
modcluster.remove-custom-metric.deprecated=\u975E\u63A8\u5968\u3002\u6B63\u898F\u306E 'remove' \u7BA1\u7406\u64CD\u4F5C\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
modcluster.remove-custom-metric.class=\u30AB\u30B9\u30BF\u30E0\u30E1\u30C8\u30EA\u30C3\u30AF\u306E\u30AF\u30E9\u30B9\u3002

# Deprecated/Legacy SSL resource
modcluster.ssl=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 MCMP \u30ED\u30B8\u30C3\u30AF\u3078\u306E SSL \u8A2D\u5B9A
modcluster.ssl.configuration.deprecated=\u975E\u63A8\u5968\u3002ssl-context \u5C5E\u6027\u3092\u4F7F\u7528\u3057\u3066 Elytron \u7BA1\u7406\u306E SSLContext \u3092\u53C2\u7167\u3057\u307E\u3059\u3002
modcluster.ssl.configuration.add=SSL \u30C7\u30D5\u30A9\u30EB\u30C8\u8A2D\u5B9A\u3092\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 MCMP \u30ED\u30B8\u30C3\u30AF\u3078\u8FFD\u52A0
modcluster.ssl.configuration.remove=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 MCMP \u30ED\u30B8\u30C3\u30AF\u304B\u3089 SSL \u8A2D\u5B9A\u3092\u524A\u9664
modcluster.ssl.configuration.ca-certificate-file=\u8A3C\u660E\u6A5F\u95A2
modcluster.ssl.configuration.ca-revocation-url=\u8A3C\u660E\u6A5F\u95A2\u5931\u52B9\u30EA\u30B9\u30C8
modcluster.ssl.configuration.certificate-key-file=\u8A3C\u660E\u66F8\u5411\u3051\u306E\u30AD\u30FC\u30D5\u30A1\u30A4\u30EB
modcluster.ssl.configuration.cipher-suite=\u8A2D\u5B9A\u3067\u306E\u4F7F\u7528\u304C\u8A31\u53EF\u3055\u308C\u308B\u6697\u53F7\u306E\u30B3\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3002
modcluster.ssl.configuration.key-alias=\u30AD\u30FC\u30B9\u30C8\u30A2\u306B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A3C\u660E\u66F8\u3092\u4FDD\u6301\u3059\u308B\u30AD\u30FC\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
modcluster.ssl.configuration.password=\u30AD\u30FC\u30B9\u30C8\u30A2\u304A\u3088\u3073\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u3092\u8A31\u53EF\u3059\u308B\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
modcluster.ssl.configuration.protocol=\u6709\u52B9\u306A SSL \u30D7\u30ED\u30C8\u30B3\u30EB

