# Subsystem
modcluster=Opera\u00E7\u00F5es de configura\u00E7\u00E3o e tempo de execu\u00E7\u00E3o para o subsistema mod_cluster.
modcluster.add=Adicione o subsistema mod_cluster deixando o servidor no estado \u201Creload-required\u201D.
modcluster.remove=Remova o subsistema mod_cluster deixando o servidor no estado \u201Creload-required\u201D.

# Proxy Configuration
modcluster.mod-cluster-config=Recurso de configura\u00E7\u00E3o herdado.
modcluster.proxy=Recurso de proxy associado a um \u00FAnico ouvinte do Undertow (e servidor) especificando a descoberta do balanceador de carga, seu provedor de configura\u00E7\u00E3o e fator de balanceamento de carga. \u00C9 poss\u00EDvel especificar v\u00E1rias configura\u00E7\u00F5es de proxy.
modcluster.proxy.add=Adicione um recurso de proxy que exija uma refer\u00EAncia de ouvinte do Undertow deixando o servidor no estado \u201Creload-required\u201D.
modcluster.proxy.remove=Remova um recurso de proxy, deixando o servidor no estado \u201Creload-required\u201D.
modcluster.proxy.advertise=Se o mecanismo de an\u00FAncio com base em multicast deve ser ativado.
modcluster.proxy.advertise-security-key=Se especificado, as somas de verifica\u00E7\u00E3o de an\u00FAncios de proxy reverso ser\u00E3o verificadas usando este valor como um sal.
modcluster.proxy.advertise-socket=O nome da associa\u00E7\u00E3o de socket a ser usada para o socket de an\u00FAncio.
modcluster.proxy.auto-enable-contexts=Se falso, os contextos s\u00E3o registrados com o proxy reverso como desativados; eles precisam ser ativados manualmente por meio da opera\u00E7\u00E3o \u201Cenable-context\u201D ou do console mod_cluster_manager (se dispon\u00EDvel).
modcluster.proxy.balancer=O nome do balanceador no proxy reverso para registro.
modcluster.proxy.connector=O nome do ouvinte do Undertow que ser\u00E1 registrado com o proxy reverso.
modcluster.proxy.connector.deprecated=Descontinuado. Funciona como alias para o atributo \u201Clistener\u201D.
modcluster.proxy.excluded-contexts=Lista de contextos a excluir do registro com os proxies reversos.
modcluster.proxy.flush-packets=Se a libera\u00E7\u00E3o de pacotes deve ser ativada no proxy reverso.
modcluster.proxy.flush-wait=Tempo a aguardar antes de liberar pacotes no proxy reverso.
modcluster.proxy.listener=O nome do ouvinte do Undertow que ser\u00E1 registrado com o proxy reverso.
modcluster.proxy.load-balancing-group=O nome do grupo de balanceamento de carga ao qual este n\u00F3 pertence.
modcluster.proxy.max-attempts=N\u00FAmero m\u00E1ximo de tentativas de failover por proxy reverso ao enviar uma solicita\u00E7\u00E3o ao servidor de backend.
modcluster.proxy.node-timeout=Tempo limite (em segundos) para conex\u00F5es de proxy para um n\u00F3. Isso \u00E9 o tempo que mod_cluster aguardar\u00E1 pela resposta back-end antes de retornar um erro.
modcluster.proxy.ping=N\u00FAmero de segundos de espera por uma resposta pong a um ping.
modcluster.proxy.proxies=Lista de proxies reversos para registro de mod_cluster, definidos por \u201Coutbound-socket-binding\u201D em \u201Csocket-binding-group\u201D.
modcluster.proxy.proxy-list=Lista de proxies reversos com os quais registrar. Formato (hostname:port) separado com v\u00EDrgulas.
modcluster.proxy.proxy-list.deprecated=O atributo \u201Cproxy-list\u201D foi preterido em favor de proxys (lista de refer\u00EAncias para outbound-socket-binding)
modcluster.proxy.proxy-url=URL base para as solicita\u00E7\u00F5es MCMP.
modcluster.proxy.simple-load-provider=O provedor de carga simples retorna um fator de balanceamento de carga pr\u00E9-configurado constante.
modcluster.proxy.simple-load-provider.deprecated=Descontinuado. Alias para o recurso filho load-balancer=simple.
modcluster.proxy.session-draining-strategy=A estrat\u00E9gia de drenagem de sess\u00E3o usada durante a desimplanta\u00E7\u00E3o de um aplicativo web.
modcluster.proxy.smax=Contagem flex\u00EDvel m\u00E1xima de conex\u00E3o ociosa para proxy reverso.
modcluster.proxy.socket-timeout=Tempo limite para aguardar que o proxy reverso responda a uma mensagem MCMP.
modcluster.proxy.ssl-context=Refer\u00EAncia ao SSLContext a ser usado por mod_cluster.
modcluster.proxy.status-interval=N\u00FAmero de segundos em que uma mensagem STATUS \u00E9 enviada do servidor de aplicativo para o proxy.
modcluster.proxy.sticky-session=Indica se as solicita\u00E7\u00F5es subsequentes de uma determinada sess\u00E3o devem ser roteadas para o mesmo n\u00F3, se poss\u00EDvel.
modcluster.proxy.sticky-session-force=Indica se o proxy reverso dever\u00E1 executar um erro se o balanceador n\u00E3o puder rotear uma solicita\u00E7\u00E3o para o n\u00F3 ao qual est\u00E1 aderido. Ser\u00E1 ignorado se as sess\u00F5es sticky estiverem desativadas.
modcluster.proxy.sticky-session-remove=Indica se o proxy reverso deve remover a ades\u00E3o de sess\u00E3o se o balanceador n\u00E3o puder rotear uma solicita\u00E7\u00E3o para o n\u00F3 ao qual est\u00E1 aderido. Ignorado se as sess\u00F5es sticky estiverem desativadas.
modcluster.proxy.stop-context-timeout=Tempo m\u00E1ximo para aguardar que o contexto processe solicita\u00E7\u00F5es pendentes.
modcluster.proxy.ttl=Vida \u00FAtil (em segundos) para conex\u00F5es ociosas acima de smax.
modcluster.proxy.worker-timeout=N\u00FAmero de segundos a aguardar que um worker fique dispon\u00EDvel para processar uma solicita\u00E7\u00E3o.

# Load Providers
modcluster.dynamic-load-provider=Alias herdados para o provedor de carga din\u00E2mico.
modcluster.load-provider=O provedor de carga fornece c\u00E1lculos de carga.
modcluster.load-provider.simple=O provedor de carga simples retorna um fator de balanceamento de carga pr\u00E9-configurado constante.
modcluster.load-provider.simple.add=Adicione o provedor de carga simples retornando um fator de balanceamento de carga pr\u00E9-configurado constante.
modcluster.load-provider.simple.remove=Remova um provedor de carga simples.
modcluster.load-provider.simple.factor=O provedor de carga din\u00E2mica calcula o fator de balanceamento de carga de um n\u00F3 de um conjunto definido de m\u00E9tricas de carga.
modcluster.load-provider.dynamic.add=Adicione um provedor de carga din\u00E2mica sem m\u00E9tricas de carregamento.
modcluster.load-provider.dynamic.remove=Remova um provedor de carga din\u00E2mica, usando como padr\u00E3o para o provedor de carga simples.
modcluster.load-provider.dynamic.decay=O fator pelo qual os valores de carga hist\u00F3ricos devem se degradar em import\u00E2ncia.
modcluster.load-provider.dynamic.history=O n\u00FAmero de valores de carga hist\u00F3ricos (anteriores) a serem considerados no c\u00E1lculo do fator de balanceamento de carga.
modcluster.load-provider.dynamic.initial-load=Carga inicial no intervalo [0..100] com a qual pr\u00E9-popular valores hist\u00F3ricos. Usada para conduzir gradualmente a carga at\u00E9 o n\u00F3. O valor de 0 pr\u00E9-popula com carga completa e o valor de -1 desabilita esse comportamento.

# Load Metrics
modcluster.load-metric=M\u00E9trica de carga integrada que contribui com um valor para o fator de carga geral de um n\u00F3. Os fatores de carga de cada m\u00E9trica s\u00E3o agregados de acordo com seus pesos.
modcluster.load-metric.add=Adicione uma m\u00E9trica de carga ao conjunto de m\u00E9tricas de carga a partir do qual o fator de carga \u00E9 calculado.
modcluster.load-metric.remove=Remova uma m\u00E9trica de carga do conjunto de m\u00E9tricas de carga a partir do qual o fator de carga \u00E9 calculado.
modcluster.load-metric.type=Tipo de uma m\u00E9trica de carga integrada dos valores enumerados.
modcluster.load-metric.class=Nome da classe a partir da qual uma m\u00E9trica de carga \u00E9 calculada.
modcluster.load-metric.module=Nome do m\u00F3dulo a partir do qual a classe de m\u00E9trica \u00E9 carregada.
modcluster.load-metric.weight=N\u00FAmero que indica a import\u00E2ncia de uma m\u00E9trica em rela\u00E7\u00E3o \u00E0s outras m\u00E9tricas. Por exemplo, uma m\u00E9trica de peso 2 ter\u00E1 o dobro do impacto de uma m\u00E9trica de peso 1 no fator de carga geral.
modcluster.load-metric.capacity=Capacidade m\u00E1xima da m\u00E9trica usada para normalizar os valores de carga de uma m\u00E9trica que requer capacidade expl\u00EDcita.
modcluster.load-metric.property=Propriedades a serem aplicadas em uma inst\u00E2ncia de m\u00E9trica carregada.
modcluster.custom-load-metric=M\u00E9trica de carga personalizada carregada de uma classe Java especificada que contribui com um valor para o fator de carga geral de um n\u00F3. Os fatores de carga de cada m\u00E9trica s\u00E3o agregados de acordo com seus pesos.

# Runtime-only Operations
modcluster.add-proxy=Adicione um proxy reverso \u00E0 lista de proxies com os quais registrar.
modcluster.add-proxy.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.add-proxy.host=Host do proxy reverso.
modcluster.add-proxy.port=Porta do proxy reverso aceitando comandos MCMP.
modcluster.disable=Informe aos proxies reversos que todos os contextos no n\u00F3 n\u00E3o podem processar novas solicita\u00E7\u00F5es.
modcluster.disable.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.disable-context=Informe aos proxies reversos que o contexto n\u00E3o pode processar novas solicita\u00E7\u00F5es.
modcluster.disable-context.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.disable-context.context=Nome do contexto para desativar.
modcluster.disable-context.virtualhost=Nome do host virtual em que desativar o contexto.
modcluster.enable=Informe aos proxies reversos que todos os contextos no n\u00F3 est\u00E3o prontos para receber solicita\u00E7\u00F5es.
modcluster.enable.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.enable-context=Informe aos proxies reversos que o contexto est\u00E1 pronto para receber solicita\u00E7\u00F5es.
modcluster.enable-context.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.enable-context.context=Nome do contexto para ativar.
modcluster.enable-context.virtualhost=Nome do host virtual para o qual ativar contexto.
modcluster.list-proxies=Liste os proxies reversos com os quais este n\u00F3 est\u00E1 atualmente registrado.
modcluster.list-proxies.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.read-proxies-configuration=Envie um comando DUMP para os proxies reversos e exiba o resultado.
modcluster.read-proxies-configuration.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.read-proxies-info=Envie um comando INFO para os proxies reversos e exiba o resultado.
modcluster.read-proxies-info.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.refresh=Atualize o n\u00F3 enviando uma nova mensagem CONFIG aos proxies reversos.
modcluster.refresh.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.remove-proxy=Remova o proxy reverso da lista de proxies com os quais registrar.
modcluster.remove-proxy.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.remove-proxy.host=Host do proxy reverso.
modcluster.remove-proxy.port=Porta do proxy reverso.
modcluster.reset=Redefina a conex\u00E3o do n\u00F3 para os proxies reversos.
modcluster.reset.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.stop=Informe aos proxies reversos que todos os contextos no n\u00F3 n\u00E3o podem processar solicita\u00E7\u00F5es.
modcluster.stop.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.stop.waittime=N\u00FAmero de segundos a aguardar pela drenagem de sess\u00F5es antes de interromper todos os contextos se a drenagem de sess\u00E3o estiver em vigor. Um valor de tempo limite negativo ou zero significa aguardar indefinidamente.
modcluster.stop-context=Informe aos proxies reversos que o contexto n\u00E3o pode processar solicita\u00E7\u00F5es.
modcluster.stop-context.deprecated=Descontinuado. Use uma opera\u00E7\u00E3o id\u00EAntica em um endere\u00E7o de um proxy espec\u00EDfico.
modcluster.stop-context.context=Nome do contexto para interromper.
modcluster.stop-context.virtualhost=Nome do host virtual em que interromper o contexto.
modcluster.stop-context.waittime=N\u00FAmero de segundos a aguardar pela drenagem de sess\u00F5es antes de interromper o contexto se a drenagem de sess\u00E3o estiver em vigor. Um valor de tempo limite negativo ou zero significa aguardar indefinidamente.

# Deprecated/Legacy Metric Operations
modcluster.add-metric=Adicione uma nova m\u00E9trica ao provedor de fator de balanceamento din\u00E2mico de carga.
modcluster.add-metric.deprecated=Descontinuado. Use a opera\u00E7\u00E3o de gerenciamento regular \u201Cadd\u201D.
modcluster.add-metric.type=Tipo da m\u00E9trica.
modcluster.add-metric.weight=Peso da m\u00E9trica.
modcluster.add-metric.capacity=Capacidade da m\u00E9trica.
modcluster.add-metric.property=Propriedades da m\u00E9trica.
modcluster.remove-metric=Remova uma m\u00E9trica do provedor de fator de balanceamento din\u00E2mico de carga.
modcluster.remove-metric.deprecated=Descontinuado. Use a opera\u00E7\u00E3o de gerenciamento regular \u201Cremove\u201D.
modcluster.remove-metric.type=Tipo da m\u00E9trica.
modcluster.add-custom-metric=Adicione uma nova m\u00E9trica personalizada ao provedor de fator de balanceamento din\u00E2mico de carga.
modcluster.add-custom-metric.deprecated=Descontinuado. Use a opera\u00E7\u00E3o de gerenciamento regular \u201Cadd\u201D.
modcluster.add-custom-metric.class=Classe da m\u00E9trica personalizada.
modcluster.add-custom-metric.weight=Peso da m\u00E9trica.
modcluster.add-custom-metric.capacity=Capacidade da m\u00E9trica.
modcluster.add-custom-metric.property=Propriedades da m\u00E9trica.
modcluster.remove-custom-metric=Remova uma m\u00E9trica personalizada do provedor de fator de balanceamento din\u00E2mico de carga.
modcluster.remove-custom-metric.deprecated=Descontinuado. Use a opera\u00E7\u00E3o de gerenciamento regular \u201Cremove\u201D.
modcluster.remove-custom-metric.class=Classe da m\u00E9trica personalizada.

# Deprecated/Legacy SSL resource
modcluster.ssl=A configura\u00E7\u00E3o SSL para a l\u00F3gica MCMP do cliente.
modcluster.ssl.configuration.deprecated=Preterido. Use o atributo ssl-context para referenciar SSLContext gerenciado por Elytron.
modcluster.ssl.configuration.add=Adiciona a configura\u00E7\u00E3o default SSL \u00E0 l\u00F3gica MCMP do cliente.
modcluster.ssl.configuration.remove=Remove a configura\u00E7\u00E3o SSL da l\u00F3gica MCMP do cliente.
modcluster.ssl.configuration.ca-certificate-file=Autoridade do certificado.
modcluster.ssl.configuration.ca-revocation-url=Lista de revoca\u00E7\u00E3o de autoridade de certificado.
modcluster.ssl.configuration.certificate-key-file=O arquivo de tecla para o certificado.
modcluster.ssl.configuration.cipher-suite=Lista separada por v\u00EDrgulas de chaves de criptografia que a configura\u00E7\u00E3o pode usar.
modcluster.ssl.configuration.key-alias=O alias da chave que cont\u00E9m os certificados do cliente no armazenamento de chaves.
modcluster.ssl.configuration.password=Senha que concede acesso ao armazenamento de chaves e ao armazenamento de confian\u00E7a.
modcluster.ssl.configuration.protocol=Os protocolos SSl que est\u00E3o ativados.

